{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "09. KINH CHÚNG TẬP",
        "Số Phẩm": "PHẦN 2",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Tôi nghe như vầy:",
        "Một thời, Phật du hành ở Mạt-la cùng với một nghìn hai trăm năm mươi Tỳ-kheo, rồi đi dần đến thành Ba-bà, vườn Am-bà của Xà-đầu .",
        "Bấy giờ, vào ngày mười lăm lúc trăng tròn , Thế Tôn ngồi ở giữa khoảng đất trống với các Tỳ-kheo vây quanh trước sau. Thế tôn, sau khi đã thuyết pháp nhiều qua đêm, nói với Xá-lợi-phất :",
        "“Các Tỳ-kheo bốn phương tụ tập về, thảy đều siêng năng, dẹp bỏ ngủ nghỉ. Nhưng ta đau lưng, muốn nghỉ một chút, ngươi nay hãy thuyết pháp cho các Tỳ-kheo.”",
        "Xá-lợi-phất đáp:",
        "“Kính vâng. Con sẽ làm theo Thánh giáo.”",
        "Thế Tôn gấp tư tăng-già-lê nằm nghiêng phía hữu như con sư tử, hai chân chồng lên nhau.",
        "Khi ấy Xá-lợi-phất nói với các Tỳ kheo:",
        "“Nay trong thành Ba-bà này có Nikiền Tử mạng chung chưa bao lâu, nhưng các đệ tử chia ra làm hai bộ, luôn luôn tranh chấp nhau, tìm sở trường và sở đoản của nhau, mắng nhiếc nhau, thị phi với nhau rằng: ‘Ta biết pháp này. Ngươi không biết pháp này. Ngươi theo tà kiến. Ta theo chánh kiến. Ngươi nói năng hỗn loạn, chẳng có trước sau, tự cho điều mình nói là chân chính. Lập ngôn của ta thắng. Lập ngôn của ngươi bại. Nay ta làm chủ cuộc đàm luận, ngươi có điều muốn hỏi thì đến hỏi ta.’",
        "“Này các Tỳ-kheo, lúc bấy giờ nhân dân trong nước những ai theo Ni-kiền Tử đều chán ghét những tiếng cãi vã của bọn này. Đó là vì pháp ấy không chân chính. Pháp không chân chính thì không có con đường xuất ly . Ví như ngôi tháp đã đổ thì không còn đổ nữa. Đó không phải là điều mà đấng Chánh giác đã dạy.",
        "“Các Tỳ-kheo, duy chỉ Pháp vô thượng tôn của đức Thích-ca ta là chân chánh mới có thể có con đường xuất ly. Cũng như ngôi tháp mới có thể được dễ dàng trang hoàng. Vì đó là điều mà đấng Chánh giác giảng dạy.",
        "“Các Tỳ-kheo, hôm nay chúng ta cần phải kiết tập pháp luật để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài làm lợi ích cho số đông, cho chư thiên và nhân loại được an lạc.",
        "“Như Lai nói một chánh pháp: Hết thảy chúng sanh đều do thức ăn mà tồn tại.",
        "“Như Lai lại nói một chánh pháp: tất cả chúng sanh đều do các hành mà tồn tại.",
        "“Đó là một pháp đã được Như Lai giảng dạy. Chúng ta hãy cùng kiết tập để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài làm lợi ích cho số đông, cho chư thiên và nhân loại được an lạc.",
        "“Các Tỳ-kheo, Như Lai nói hai chánh pháp: một là danh, hai là sắc.",
        "“Lại có hai pháp: một là si, hai là ái",
        "“Lại có hai pháp: hữu kiến và vô kiến",
        "“Lại có hai pháp: không biết tàm và không biết quí.",
        "“Lại có hai pháp: có tàm và có quí. “Lại có hai pháp: tận trí và vô sanh trí.",
        "“Lại có hai pháp, hai nhân hai duyên sanh ra ái dục: Một, sắc tịnh diệu; hai, không tư duy.",
        "“Lại có hai pháp, hai nhân, hai duyên sanh nơi sân nhuế: thù ghét và không tư duy.",
        "“Lại có hai pháp, hai nhân, hai duyên sanh nơi tà kiến: nghe từ người khác và tà tư duy.",
        "“Lại có hai pháp, hai nhân, hai duyên sanh nơi chánh kiến: nghe từ người khác và chánh tư duy.",
        "“Lại có hai pháp, hai nhân, hai duyên: giải thoát hữu học và giải thoát vô học",
        "“Lại có hai pháp hai nhân, hai duyên: hữu vi giới và vô vi giới.",
        "“Các Tỳ-kheo, đó là hai pháp đã được Như Lai giảng dạy. Chúng ta hãy cùng kiết tập để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài làm lợi ích cho số đông, cho chư thiên và nhân loại được an lạc.",
        "“Các Tỳ-kheo, Như Lai nói ba pháp, tức là ba bất thiện căn: tham dục, sân nhuế và ngu si.",
        "“Lại có ba pháp, tức là ba thiện căn : không tham, không nhuế và không si.",
        "“Lại có ba pháp, tức là ba bất thiện hành: thân hành bất thiện , khẩu hành bất thiện và ý hành bất thiện.",
        "“Lại có ba pháp, tức là ba bất thiện hành: bất thiện hành của thân, bất thiện hành của khẩu và bất thiện hành của ý.",
        "“Lại nữa, có ba pháp, tức là ba ác hành ác hành của thân, ác hành của khẩu và ác hành của ý.",
        "“Lại có ba pháp, tức là ba thiện hành: thiện hành của thân, thiện hành vủa khẩu và thiện hành của ý.",
        "“Lại có ba pháp, tức là ba tưởng bất thiện: dục tưởng, sân tưởng và hại tưởng.",
        "“Lại có ba pháp tức là ba tưởng thiện: vô dục tưởng, vô sân tưởng và vô hại tưởng.",
        "“Lại có ba pháp tức là ba tư bất thiện: dục tư, nhuế tư và hại tư",
        "“Lại có ba pháp tức là ba tư thiện: vô dục tư, vô nhuế tư và vô hại tư.",
        "“Lại có ba loại phước nghiệp: nghiệp bố thí, nghiệp bình đẳng và nghiệp tư",
        "duy.",
        "“Lại có ba pháp, tức là ba thọ: lạc thọ, khổ thọ và phi khổ phi lạc thọ.",
        "“Lại có ba pháp tức là ba ái: dục ái, hữu ái, vô hữu ái.",
        "“Lại có ba pháp tức là ba hữu lậu:",
        "dục lậu, hữu lậu và vô minh lậu.",
        "“Lại có ba pháp, tức là ba thứ lửa: lửa dục, lửa sân và lửa si.",
        "“Lại có ba pháp tức là ba cầu: dục cầu, hữu cầu và phạm hạnh cầu.",
        "“Lại có ba pháp tức là ba tăng thịnh: ngã tăng thịnh, thế tăng thịnh và pháp",
        "tăng thịnh.",
        "“Lại có ba pháp tức là ba giới: dục giới, sân giới và hại giới",
        "“Lại có ba pháp tức là ba giới: xuất ly giới, vô sân giới và vô hại giới.",
        "“Lại có ba pháp tức là ba giới: sắc giới , vô sắc giới, tận giới",
        "“Lại có ba pháp tức là ba tụ: giới tụ, định tụ và huệ tụ.",
        "“Lại có ba pháp tức là ba giới: tăng thịnh giới (cấm), tăng thịnh ý, tăng thịnh tuệ",
        "“Lái có ba pháp tức là ba tam-muội: không tam-muội, vô nguyện tam-muội, và vô tướng tam-muội",
        "“Lại có ba pháp tức là ba tướng: chỉ tức tướng, tinh cần tướng, và xả tướng.",
        "“Lại có ba pháp tức là ba minh: tự thức túc mạng trí minh , thiên nhãn trí minh, và lậu tận trí minh.",
        "“Lại có ba pháp tức là ba biến hóa: thần túc biến hóa, biết tâm người mà tùy ý thuyết pháp và giáo giới. “Lại có ba pháp tức là ba căn bổn dục sinh : Do hiện dục hiện tiền sinh trời người, do hóa dục sinh trời Hóa tự tai , do tha hóa dục sinh trời Tha hóa tự tại.",
        "“Lại có ba pháp tức là ba lạc sinh :",
        "1. Chúng sanh tự nhiên thành biện sanh hoan hỷ tâm như trời Phạm quang âm vào lúc mới sinh.",
        "2. Có chúng sanh lấy niệm làm an vui tự xướng ‘lành thay’ như trời Quang âm.",
        "3. Lạc do được chỉ tức như trời Biến tịnh",
        "“Lại có ba pháp tức là ba khổ: dục khổ, hành khổ, và biến dịch khổ. “Lại có ba pháp tức là ba căn: vị tri dục tri căn, tri căn, tri dĩ căn",
        "“Lại có ba pháp tức là ba đường: Hiền Thánh đường, thiên đường, phạm đường",
        "“Lại có ba pháp tức là ba sự phát hiện : phát hiện do thấy, phát hiện do nghe và phát hiện do nghi.",
        "“Lại có ba pháp tức là ba luận: Quá khứ có sự như thế, có luận như thế. Vị lai có sự như thế, có luận như thế. Hiện tại có sự như thế có luận như thế. “Lại có ba pháp tức là ba tụ : chánh định tụ, tà định tụ, và bất định tụ.",
        "“Lại có ba pháp tức là ba ưu: thân ưu, khẩu ưu, và ý ưu.",
        "“Lại có ba pháp, tức ba Trưởng lão: trưởng lão do tuổi tác, trưởng lão do pháp và trưởng lão do tác thành. “Lại có ba pháp tức là ba con mắt: con mắt thịt, con mắt trời và con mắt tuệ.",
        "“Các Tỳ-kheo, đó là ba pháp đã được Như Lai giảng dạy. Chúng ta hãy cùng kiết tập để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài làm lợi ích cho số đông, cho chư thiên và nhân loại được an lạc.",
        "“Các Tỳ-kheo, Như Lai nói bốn pháp, tức là bốn ác hành do miệng:",
        "1. nói dối, 2. hai lưỡi. 3. ác khẩu, 4. ỷ ngữ.",
        "“Lại có bốn pháp, tức là bốn thiện hành của miệng:",
        "1. Nói sự thật, 2. Nói dịu dàng, 3. Không ỷ ngữ, 4. Không hai lưỡi.",
        "“Lại có bốn pháp tức là bốn phi thánh ngôn:",
        "1. Không thấy nói thấy 2. Không nghe nói nghe 3. Không cảm thấy nói cảm thấy 4. Không biết nói biết.",
        "“Lại có bốn pháp tức là bốn thánh ngôn:",
        "1. Thấy nói thấy 2. Nghe nói nghe 3. Hay nói hay 4. Biết nói biết.",
        "“Lại có bốn pháp tức là bốn thức ăn:",
        "1. Thức ăn vo nắm 2. Thức ăn bởi xúc 3. Thức ăn bởi niệm 4. Thức ăn bởi thức.  “Lại có bốn pháp tức là bốn thọ:",
        "1. Khổ hành trong hiện tại thọ khổ báo về sau, 2. Khổ hành hiện tại thọ lạc báo về sau, 3. Lạc hành hiện tại thọ khổ báo về sau, 4. Lạc hành hiện tại thọ lạc báo về sau.",
        "“Lại có bốn pháp tức là bốn thọ:",
        "1. Dục thọ, 2. Ngã thọ, 3. Giới thọ, 4. Kiến thọ.",
        "“Lại có bốn pháp tức là bốn phược :",
        "1. Thân phược bởi dục tham, 2. Thân phược bởi sân nhuế, 3. Thân phược bởi giới đạo, 4. Thân phược bởi ngã kiến.",
        "“Lại có bốn pháp, tức bốn gai nhọn:",
        "1. Gai nhọn dục; 2. Gai nhọn nhuế; 3. Gai nhọn kiến; 4. Gai nhọn mạn.",
        "“Lại có bốn pháp tức là bốn sanh:",
        "1. Sanh từ trứng, 2. Sanh từ bào thai, 3. Sanh do ẩm thấp, 4. Sanh do biến hóa.",
        "“Lại có bốn pháp tức bốn niệm xứ:",
        "1. Ở đây, Tỳ-kheo quán thân trên nội thân tinh cần không biếng nhác, ức niệm không quên, trừ bỏ tham ưu ở đời; quán thân trên ngoại thân tinh cần không biếng nhác, ức niệm không quên, trừ bỏ tham ưu ở đời; quán thân trên nội ngoại thân tinh cần không biếng nhác, ức niệm không quên, trừ bỏ tham ưu ở đời; 2. Quán thọ, 3. Quán ý, 4. Quán pháp, cũng vậy.",
        "“Lại có bốn pháp tức là bốn ý đoạn :",
        "1. Ở đây Tỳ-kheo ác pháp chưa khởi, phương tiện khiến không khởi,",
        "2. Ác pháp đã khởi phương tiện khiến diệt,",
        "3. Thiện pháp chưa khởi pháp, phương tiện khiến khởi,",
        "4. Thiện pháp đã khởi phương tiện khiến tăng trưởng. “Lại có bốn pháp tức là bốn thần túc:",
        "1. Ở đây Tỳ-kheo tư duy dục định diệt hành thành tựu,",
        "2. Tinh tấn định,",
        "3. Ý định,",
        "4. Tư duy định cũng vậy.",
        "“Lại có bốn pháp tức là bốn thiền:",
        "1. Ở đây, Tỳ-kheo trừ dục, ác bất thiện pháp, có giác có quán, hỷ lạc phát sanh do viễn ly , nhập sơ thiền,",
        "2. Diệt giác và quán, nội tịnh nhất tâm, không giác không quán, có hỷ lạc do định sanh, nhập đệ nhị thiền;",
        "3. Lìa hỷ tu xả, niệm tiến , tự giác thân lạc, có lạc và xả niệm, mà bậc Thánh tìm cầu , nhập đệ tam thiền;",
        "4. Lìa các hạnh khổ và lạc, hỷ và ưu đã diệt từ trước không khổ không lạc xả niệm thanh tịnh, nhập đệ tứ thiền.",
        "“Lại có bốn pháp tức là bốn phạm đường: Từ, bi, hỷ và xả.",
        "“Lại có bốn pháp tức là bốn vô sắc định:",
        "1. Ở đây, Tỳ-kheo siêu việt hết thảy sắc tưởng, sân tưởng đã diệt từ trước, không niệm các tưởng khác, tư duy vô lượng không xứ;",
        "2. Sau khi xả không xứ, nhập thức xứ;",
        "3. Sau khi xả thức xứ nhập vô hữu xứ;",
        "4. Sau khi xả vô hữu xứ nhập phi tưởng phi phi tưởng xứ.",
        "“Lại có bốn pháp tức là bốn pháp túc:",
        "Pháp túc không tham, pháp túc không sân, pháp túc chánh niệm và pháp túc chánh định.",
        "“Lại có bốn pháp tức là bốn dòng dõi Hiền Thánh:",
        "1. Ở đây, Tỳ-kheo tri túc về y thực, được thứ tốt không mừng, được cái xấu không buồn; không nhiễm không trước, biết điều cấm kỵ, biết con đường xuất yếu; ở trong pháp này tinh cần không biếng nhác; thành tựu sự ấy không khuyết không giảm và cũng dạy người thành tựu sự ấy. Đó là thứ nhất; tri túc, an trú trong sự truyền thừa của hiền thánh, từ xưa đến nay chưa thường não loạn. Chư thiên, Ma, Phạm, Sa-môn, Bà-la-môn, Trời và Người không ai có thể chê trách.",
        "2. Thức ăn.",
        "3. Vật dụng nằm ngồi,",
        "4. Thuốc thang trị bệnh, tất cả đều cũng tri túc như thế.",
        "“Lại có bốn pháp tức là bốn nhiếp pháp: bố thí, ái ngữ, lợi hành và đồng sự.",
        "“Lại có bốn pháp, tức là bốn chi của Tu-đà-hoàn : Tỳ-kheo thành tựu tín tâm bất hoại đối với Phật, đối với Pháp, đối với Tăng và đối với giới.",
        "“Lại có bốn pháp tức là bốn thọ chứng:",
        "1. Thọ chứng do thấy sắc,",
        "2. Thọ chứng do thân hoại diệt.",
        "3. Thọ chứng do nhớ về túc mạng.",
        "4. Thọ chứng do biết hữu lậu đã bị diệt tận.",
        "“Lại có bốn pháp tức là bốn đạo: khổ đắc chậm, khổ đắc nhanh, lạc đắc chậm và lạc đắc nhanh",
        "“Lại có bốn pháp tức là bốn thánh đế: khổ thánh đế, khổ tập thánh đế, khổ xuất yếu thánh đế.",
        "“Lại có bốn pháp tức là bốn Sa-môn quả: Tu-đà-hoàn quả, Tư-đà-hàm quả, a na hàm quả, A-la-hán quả.",
        "“Lại có bốn pháp tức là bốn xứ: thật xứ, thí xứ, trí xứ, chỉ tức xứ ù. “Lại có bốn pháp tức là bốn trí: pháp trí, vị tri trí, đẳng trí, và tha tâm trí.",
        "“Lại có bốn pháp tức là bốn biện tài: pháp biện tài, nghĩa biện tài, từ biện tài, ứng thuyết biện tài.",
        "“Lại có bốn pháp tức là bốn trú xứ của thức: sắc là trú xứ của thức, duyên sắc mà trú, sắc và ái cùng tăng trưởng.",
        "Thọ, tưởng, hành, cũng đều như vậy. “Lại có bốn pháp tức là bốn ách: dục là ách, hữu là ách, kiến là ách, vô minh là ách. “Lại có bốn pháp tức là bốn vô ách: vô dục ách, vô hữu ách, vô kiến ách, vô vô minh ách.",
        "“Lại có bốn pháp tức là bốn tịnh: giới tịnh, tâm tịnh, kiến tịnh, và độ nghi tịnh.",
        "“Lại nữa có bốn pháp tức là bốn sự biết: đáng thọ biết thọ, đáng hành biết hành, đáng lạc biết lạc, đáng xả biết xả.",
        "“Lại có bốn pháp tức là bốn oai nghi: đáng đi biết đi, đáng đứng biết đứng, đáng ngồi biết ngồi, đáng nằm biết nằm.",
        "“Lại có bốn pháp tức là bốn tư duy: tư duy ít, tư duy rộng, tư duy vô lượng, không tư duy gì cả.",
        "“Lại có bốn pháp tức là bốn ký luận : quyết định ký luận, phân biệt ký luận, cật vấn ký luận, chỉ trú ký luận. “Lại có bốn tức là bốn pháp không cần phòng hộ của Phật: 1. Như Lai thân hành thanh tịnh, không khiếm khuyết, không rò rỉ; có thể tự phòng hộ; 2. Khẩu hành thanh tịnh; 3. Ý hành thanh tịnh; 4. Mạng hành thanh tịnh cũng đều như vậy.",
        "“Các Tỳ-kheo, đó là bốn pháp đã được Như Lai giảng dạy. Chúng ta hãy cùng kiết tập để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài làm lợi ích cho số đông cho chư thiên và nhân loại được an lạc.",
        "“Như Lai nói năm chánh pháp, tức là năm nhập : mắt, sắc; tai, tiếng; mũi, hương; lưỡi, vị; thân, xúc.",
        "“Lại có năm pháp tức là năm thọ ấm : sắc thủ uẩn; thọ, tưởng, hành, thức thủ uẩn.",
        "“Lại có năm pháp, tức là năm cái: tham dục cái, sân nhuế cái, thùy miên cái, trạo cử cái, nghi cái.",
        "“Lại có năm pháp tức là năm hạ phần kết: thân kiến, giới đạo , nghi, tham dục và sân nhuế.",
        "“Lại có năm pháp tức là năm thuận thượng phần kết: sắc ái, vô sắc ái, vô minh, mạn, trạo hối.",
        "“Lại có năm pháp tức là năm căn: tín, tấn, niệm, định, huệ.",
        "“Lại có năm pháp tức là năm lực: tín, tấn, niệm, định, huệ.",
        "“Lại có năm pháp tức là năm diệt tận chi :",
        "1. Tỳ-kheo tin Phật, Như Lai, Chí chân, Đẳng chánh giác, mười hiệu thành tựu.",
        "2. Tỳ-kheo không bịnh, thân thường an ổn.",
        "3. Chất trực, không dua xiểm. Được như thế thì Như Lai chỉ bày con đường đi đến Niết-bàn.",
        "4. Tự chuyên tâm không để thác loạn. Những điều đã tụng đọc từ trước ghi nhớ không quên.",
        "5. Khéo quán sát sự sinh và diệt của các pháp bằng sự thực hiện của Hiền Thánh mà diệt tận gốc rễ của khổ.",
        "“Lại có năm pháp tức là năm sự phát ngôn : phát phi thời, phát hư dối, phát phi nghĩa, phát hư ngôn , phát không từ tâm.",
        "“Lại có năm pháp tức là năm thiện phát: phát đúng thời, phát sự thật, phát có nghĩa, phát lời nói hòa, phát khởi từ tâm.",
        "“Lại có năm pháp tức là năm sự tật đố: tật đố về trú xứ, tật đố về thí chủ, tật đố về lợi dưỡng, tật đố về sắc, tật đố về pháp.",
        "“Lại có năm pháp tức là năm thú hướng giải thoát: tưởng về thân bất tịnh, tưởng về thức ăn bất tịnh, tưởng hết thảy các hành vô thường, tưởng hết thảy thế gian không đáng vui, tưởng về sự chết.",
        "“Lại có năm pháp tức là năm xuất ly giới:",
        "1. Tỳ-kheo đối với dục không hoan hỷ, bất động, cũng không thân cận, mà chỉ niệm sự thoát ly, hoan hỷ nơi sự viễn ly, thân cận không giải đãi, tâm mềm mại, xuất ly, ly dục. Vị ấy đối với các lậu triền do nhân dục mà khởi, cũng dứt sạch, xả ly diệt trừ mà được giải thoát. Đó gọi là dục thoát ly.",
        "2. Sân nhuế xuất ly,",
        "3. Tật đố xuất ly,",
        "4. Sắc xuất ly,",
        "5. Thân kiến xuất ly cũng vậy.",
        "“Lại có năm pháp tức năm hỷ giải thoát nhập . Nếu Tỳ-kheo tinh cần không biếng nhác, ưa ở nơi nhàn tĩnh, chuyên niệm nhất tâm, chưa giải thoát thì được giải thoát, chưa an thì được an. Những gì là năm?",
        "1. Ở đây Tỳ kheo nghe Như Lai thuyết pháp, hoặc nghe đồng phạm hạnh thuyết pháp, hoặc nghe sư trưởng thuyết pháp, tư duy, quán sát, phân biệt pháp nghĩa, tâm đắc hoan hỷ. Sau khi được hoan hỷ thì được pháp ái, sau khi được pháp ái thân tâm an ổn, sau khi thân tâm an ổn thì chứng đắc thiền định. Đắc thiền định rồi, đắc như thật kiến. Đó là giải thoát xứ thứ nhất.",
        "2. Ở đây, Tỳ-kheo sau khi nghe pháp hoan hỷ.",
        "3. Thọ trì đọc tụng cũng lại hoan hỷ.",
        "4. Thuyết cho người khác cũng lại hoan hỷ.",
        "5. Tư duy phân biệt cũng lại hoan hỷ, ở nơi pháp mà đắc định cũng như vậy. “Lại có năm pháp tức là năm hạng người ; trung bát-niết-bàn, sanh bátniết-bàn, vô hành bát-niết-bàn, hữu hành bát-niết-bàn, thượng lưu sắc cứu cánh.",
        "“Các Tỳ-kheo, đó là năm chánh pháp đã được Như Lai giảng dạy. Chúng ta hãy cùng kiết tập để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài làm lợi ích cho số đông cho chư thiên và nhân loại được an lạc.",
        "“Lại nữa, các Tỳ-kheo, Như Lai nói sáu chánh pháp tức là sáu nội nhập : mắt, tai, mũi, lưỡi, thân, ý.",
        "“Lại có sáu pháp tức là sáu ngoại nhập: sắc, tiếng, hương, vị, xúc, pháp.",
        "“Lại có sáu pháp tức là sáu thức thân: nhãn thức thân, nhĩ thức thân, tỷ thức thân, thiệt thức thân, thân thức thân, ý thức thân.",
        "“Lại nữa có sáu pháp tức là sáu xúc thân: nhãn xúc thân, nhĩ xúc thân, tỷ xúc thân, thiệt xúc thân, thân xúc thân, ý xúc thân.",
        "“Lại có sáu pháp tức là sáu thọ thân: nhãn thọ thân, nhĩ thọ thân, tỷ thọ thân, thiệt thọ thân, thân thọ thân, ý thọ thân.",
        "“Lại có sáu pháp tức là sáu tưởng thân : sắc, thanh, hương, vị, xúc, pháp tưởng thân.",
        "“Lại có sáu pháp tức sáu tư thân: sắc, thanh, hương, vị, xúc, pháp tư thân.",
        "“Lại có sáu pháp tức là sáu ái thân: sắc, thanh, hương, vị, xúc, pháp ái thân.",
        "“Lại có sáu pháp tức là gốc rễ tranh cãi :",
        "1. Nếu Tỳ-kheo ưa sân không bỏ, không kính Như Lai, cũng không kính Pháp, cũng không kính Chúng tăng, ở nơi giới có lọt có rĩ, nhiễm ô bất tịnh, ở trong chúng ưa gây tranh cãi mà ai cũng ghét, tranh chấp nhiễu loạn, trời và người bất an. Các Tỳ-kheo, các ngươi hãy tự mình quán sát bên trong, giả sử có sự sân hận như kẻ nhiễu loạn kia, hãy tập hợp hòa hợp chúng, rộng đặt phương tiện, nhỗ sạch gốc rễ tranh cãi ấy. Các ngươi lại hãy chuyên niệm, tự quán sát. Nếu kết hận đã diệt lại hãy thêm phương tiện ngăn cản tâm ấy không để sinh khởi trở lại.",
        "2. Các Tỳ kheo ngoan cố không chịu nghe.",
        "3. Xan tham tật đố.",
        "4. Xảo ngụy hư vọng.",
        "5. Cố chấp kiến giải của mình không chịu bỏ.",
        "6. Nghe lầm nơi tà kiến cùng với biên kiến cũng như vậy.",
        "“Lại có sáu pháp tức là sáu giới: địa giới, hỏa giới, thủy giới, phong giới, không giới, thức giới.",
        "“Lại có sáu pháp tức là sáu sát hành : con mắt sát hành sắc, tai đối với tiếng, mũi đối với hương, lưỡi đối với vị, thân đối với xúc, ý đối với pháp. “Lại có sáu pháp tức là sáu xuất ly giới:",
        "1. Nếu Tỳ-kheo nói như vầy: ‘Tôi tu từ tâm nhưng lại tâm sanh sân nhuế.’ Các Tỳ-kheo khác bảo: ‘Ngươi chớ nói như vậy. Chớ báng bổ Như Lai. Như Lai không nói như vậy: muốn khiến tu từ giải thoát mà sanh sân nhuế tưởng, không có trường hợp ấy. Phật nói: trừ sân nhuế rồi sau mới đắc từ.’ Nếu Tỳ kheo nói: ‘Tôi thực hành bi giải thoát nhưng tâm sanh tật đố.’",
        "2. ‘Thực hành bi giải thoát nhưng sanh tâm ưu não.’",
        "4. ‘Thực hành xả giải thoát nhưng sanh tâm yêu ghét.’",
        "5 ‘Thực hành vô ngã nhưng sanh tâm hồ nghi.’",
        "6. ‘Thực hành vô tưởng nhưng sanh tâm loạn tưởng;’ cũng giống như vậy.",
        "“Lại có sáu pháp tức là sáu vô thượng: kiến vô thượng, văn vô thượng, lợi dưỡng vô thượng, giới vô thượng, cung kính vô thượng, ức niệm vô thượng.",
        "“Lại có sáu pháp tức là sáu tư niệm: niệm Phật, niệm pháp, niệm tăng, niệm giới, niệm thí, niệm thiên.",
        "“Các Tỳ-kheo, đó là sáu pháp đã được Như Lai giảng dạy. Chúng ta hãy cùng kiết tập để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài làm lợi ích cho số đông, cho chư thiên và nhân loại được an lạc.",
        "“Các Tỳ-kheo, Như Lai nói bảy chánh pháp, tức là bảy phi pháp: không có tín, không có tàm, không có quí, ít học hỏi, biếng nhác, hay quên, vô trí.",
        "“Lại có bảy pháp tức là bảy chánh pháp: có tín, có tàm, có qúi, đa văn. tinh tấn, tổng trì, đa trí.",
        "“Lại có bảy pháp tức là bảy thức trụ:",
        "1. Hoặc có chúng sanh với thân sai biệt, với tưởng sai biệt, tức là chư thiên và loài người đó là trú xứ thứ nhất của thức.",
        "2. Hoặc có chúng sanh với nhiều thân khác nhau nhưng chỉ một tưởng, đó là trời Phạm Quang âm, lúc đầu tiên mới thọ sinh. Đó là trú xứ thứ hai của thức.",
        "3. Hoặc có chúng sanh với một thân nhưng nhiều tưởng sai biệt tức là trời Quang âm. Đó là trú xứ thứ ba của thức.",
        "4. Hoặc có chúng sanh với một thân và một tưởng đó là trời Biến tịnh. Đó là trú xứ thứ tư của thức.",
        "5. Hoặc có chúng sanh trú ở không xứ.",
        "6. Trú ở thức xứ.",
        "7. Trú ở vô hữu xứ.",
        "“Lại có bảy pháp tức là bảy tinh cần:",
        "1. Tỳ-kheo tinh cần nơi sự thực hành giới.",
        "2. Tinh cần diệt tham dục.",
        "3. Tinh cần phá tà kiến.",
        "4. Tinh cần nơi đa văn.",
        "5. Tinh cần nơi tinh tấn.",
        "6. Tinh cần nơi chánh niệm.",
        "7. Tinh cần nơi thiền định.",
        "“Lại có bảy pháp tức là bảy tưởng: tưởng về thân bất tịnh, tưởng về thức ăn bất tịnh, tưởng về hết thảy thế gian không đáng ưa thích, tưởng về sự chết, tưởng về vô thường, tưởng về vô thường là khổ, tưởng về khổ là vô ngã. “Lại có bảy pháp tức là bảy tam muội thành tựu: chánh kiến, chánh tư duy, chánh ngữ, chánh nghiệp, chánh mạng, chánh phương tiện, chánh niệm.",
        "“Lại có bảy pháp tức là bảy giác chi: niệm giác chi, trạch pháp giác chi, tinh tấn giác chi, hỷ giác giác chi, khinh an giác chi, định giác chi, huệ xả giác chi.",
        "“Các Tỳ-kheo, đó là bảy pháp đã được Như Lai giảng dạy. Chúng ta hãy cùng kiết tập để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài làm lợi ích cho số đông, cho chư thiên và nhân loại được an lạc.",
        "“Các Tỳ-kheo, Như Lai nói tám chánh pháp tức là tám pháp ở đời: đắc, thất, vinh, nhục, khen, chê, lạc và khổ",
        "“Lại có tám pháp tức là tám giải thoát:",
        "1. Sắc quán sắc giải thoát.",
        "2. Nội không sắc tưởng quán ngoại sắc giải thoát.",
        "3. Tịnh giải thoát,",
        "4. Vượt quá sắc tưởng, diệt sân nhuế tưởng, an trú hư không xứ giải thoát.",
        "5. Vượt hư không xứ an trú hư không xứ giải thoát.",
        "6. Vượt thức xứ an trú vô hữu xứ giải thoát, vượt vô sở hữu xứ an trú phi phi tưởng xứ giải thoát. 8. Vượt phi tưởng phi phi tưởng xứ, an trú diệt tận định giải thoát.",
        "“Lại có tám pháp tức là tám thánh đạo: chánh kiến, chánh chí, chánh ngữ, chánh nghiệp, chánh mạng, chánh phương tiện, chánh niệm, chánh định. “Lại có tám pháp tức tám nhân cách: Tu-đà-hoàn hướng, Tu-đà-hoàn quả, Tư-đà-hàm hướng, Tư-đà-hàm quả, Ana-hàm hướng, A-na-hàm quả; A-la-hán hướng, A-la-hán quả.",
        "“Các Tỳ-kheo, đó là tám pháp đã được Như Lai giảng dạy. Chúng ta hãy cùng kiết tập để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài, làm lợi ích cho số đông cho chư thiên và nhân loại được an lạc.",
        "“Các Tỳ-kheo, Như Lai nói chín chánh pháp, tức là chín chúng sanh cư:",
        "1. Hoặc có chúng sanh có nhiều thân khác nhau, với nhiều tưởng khác nhau, tức là chư thiên và loài người. Đó là nơi cư trú thứ nhất của chúng sanh.",
        "2. Lại có chúng sanh có nhiều thân khác nhau, nhưng với một tưởng giống nhau, tức là trời Phạm Quang âm lúc mới sanh. Đó là cư trú thứ hai của chúng sinh.",
        "3. Lại có chúng sanh với một thân giống nhau, nhưng với nhiều tưởng khác nhau, tức là trời Quang âm. Đó là cư trú thứ ba của chúng sanh.",
        "4. Lại có chúng sanh với một thân một tưởng giống nhau, tức là trời Biến tịnh. Đó là cư trú thứ tư của chúng sanh.",
        "5. Lại có chúng sanh không có tưởng và không có giác tri, tức là trời Vô tưởng. Đó là cư trú thứ năm của chúng sanh.",
        "6. Lại có chúng sanh an trú hư không xứ. Đó là cư trú thứ sáu của chúng sanh.",
        "7. Lại có chúng sanh an trú thức xứ. Đó là cư trú thứ bảy của chúng sanh.",
        "8. Lại có chúng sanh an trú vô sở hữu xứ. Đó là cư trú thứ tám của chúng sanh.",
        "9. Lại có chúng sanh an trú phi tưởng phi phi tưởng xứ. Đó là cư trú thứ chín của chúng sanh.",
        "“Các Tỳ-kheo, đó là chín pháp đã được Như Lai giảng dạy. Chúng ta hãy cùng kiết tập để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài, làm lợi ích cho số đông, cho chư thiên và nhân loại được an lạc.",
        "“Các Tỳ-kheo, Như Lai nói mười chánh pháp, tức là mười pháp vô học: vô học chánh kiến, vô học chánh tư duy, vô học chánh ngữ, vô học chánh nghiệp, vô học chánh mạng, vô học chánh niệm, vô học chánh phương tiện, vô học chánh định, vô học chánh trí, vô học chánh giải thoát.",
        "“Các Tỳ-kheo, đó là mười pháp đã được Như Lai giảng dạy. Chúng ta hãy cùng kiết tập để ngăn ngừa sự tranh cãi, khiến cho phạm hạnh tồn tại lâu dài, làm lợi ích cho số đông, cho chư thiên và nhân loại được an lạc.” Bấy giờ, Thế Tôn ấn khả những điều Xá-lợi-phất đã nói. Các Tỳ-kheo sau khi nghe những điều Xá-lợi-phất đã nói, hoan hỷ phụng hành."
    ]
}