{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "30. KINH THẾ KÝ - PHẨM 06 : A-TU-LUÂN",
        "Số Phẩm": "PHẦN 3",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Phật bảo các tỳ kheo:",
        "“Trong đáy nước biển lớn ở phía Bắc của núi Tu-di, có một thành của La-ha A-tu-luân, bề ngang rộng khoảng tám vạn do-tuần, thành của nó có bảy lớp, bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang điểm chung quanh đều bằng bảy thứ báu tạo thành. Chiều cao của thành là ba nghìn do-tuần, rộng hai nghìn do-tuần. Cửa thành của nó cao một nghìn do-tuần, rộng cũng một nghìn do-tuần. Thành vàng thì cửa bạc, thành bạc thì cửa vàng,… cho đến, vô số các loài chim cùng nhau ríu rít cũng lại như trên. Tiểu thành, chỗ ngự trị của vị vua A-tu-luân này ở ngay trong thành lớn có tên là Luân-thâu-ma-bạt-tra, dọc ngang sáu vạn do-tuần. Thành của nó gồm bảy lớp, bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang điểm chung quang bằng bảy thứ báu tạo thành. Thành cao ba nghìn do tuần, rộng hai nghìn do-tuần. Cửa thành của nó cao hai nghìn do-tuần, rộng một nghìn do-tuần. Thành vàng thì cửa bạc, cửa bạc thì thành vàng,… cho đến, vô số các loài chim cùng nhau ríu rít cũng lại như trên.",
        "“Ở trong thành này, xây dựng riêng nhà hội nghị có tên là Thất-thi-lợi-sa , bảy lớp tường hào, bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang điểm chung quanh bằng bảy thứ báu tạo thành. Nền nhà hội nghị hoàn toàn dùng bằng xa cừ; cột nhà, sà nhà hoàn toàn đều dùng bảy báu. Chu vi những trụ cột ở chính giữa một nghìn do-tuần, cao một vạn do-tuần. Ở dưới những trụ cột này có tòa Chánh pháp , dọc ngang bảy trăm do-tuần, đều dùng bảy báu chạm trổ mà thành. Nhà này có bốn cửa, được bao quanh bằng bảy lớp đình thềm lan can, bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang hoàng chung quanh bằng bảy báu,… cho đến, các loài chim cùng nhau ríu rít, cũng lại như đã kể.",
        "“Ở phía Bắc nhà hội nghị này có cung điện A-tu-luân, dọc ngang một vạn do-tuần. Cung điện có bảy lớp tường, bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang hoàng chung quanh bằng bảy báu, cho đến, vô số các loài chim cùng nhau ríu rít, cũng như đã kể.",
        "“Phía Đông nhà hội nghị này có một khu rừng vườn tên là Sa-la, dọc ngang một vạn do-tuần. Vườn có bảy lớp tường, bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang hoàng chung quanh bằng bảy báu,… cho đến, vô số các loài chim cùng nhau ríu rít, cũng lại như đã kể.",
        "“Phía Nam nhà hội nghị này có một khu vườn rừng tên là Cực diệu, dọc ngang một vạn do-tuần như vườn Sala.",
        "“Phía Tây nhà hội nghị có một khu vườn rừng tên là Thiểm ma, dọc ngang một vạn do-tuần cũng như vườn rừng Ta la.",
        "“Phía Bắc nhà hội nghị này có một khu vườn rừng, tên là Nhạc lâm, bề ngang một vạn do-tuần cũng như vườn rừng Sa-la.",
        "“Giữa hai khu vườn Sa-la và Cựcdiệu có cây trú độ, thấp là bảy do tuần cao thì một trăm do-tuần, cành lá vươn ra bốn phía cỡ năm mươi do tuần, cây có bảy lớp bờ tường, bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang hoàng chung quanh bằng bảy báu,… cho đến, vô số các loài chim cùng nhau ríu rít, cũng lại như đã kể. Lại nữa, giữa hai khu vườn Thiểm-ma và Nhạc-lâm này có ao Bạt-nan-đà, nước của nó trong mát, không có cáu bẩn, hào báu bảy lớp, chung quanh cạnh thềm là bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang hoàng chung quanh bằng bảy thứ báu. Ở trong ao này sinh ra bốn loài hoa, lá hoa bề ngang rộng một do-tuần, hương thơm bay phảng phất cũng một do-tuần; rễ như ổ trục xe, nhựa của nó lưu xuất ra có màu trắng như sữa, vị ngọt như mật, và vô số các loài chim cùng nhau hót líu lo. Hơn nữa, bên cạnh ao này có bảy lớp đình thềm, bảy lớp tường cửa, bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang hoàng chung quanh bằng bảy thứ báu,… cho đến, vô số các loài chim cùng nhau hót líu lo, cũng lại như vậy.",
        "“Cung điện thần hạ của vua A-tuluân, dọc ngang một vạn do-tuần, rồi chín nghìn, tám nghìn, và cho đến cung điện nhỏ nhất là một nghìn do-tuần. Cung điện có bảy lớp tường, bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang hoàng chung quanh bằng bảy thứ báu,… cho đến, vô số các loài chim cùng nhau hót líu lo, cũng lại như vậy. “Cung điện của Tiểu A-tu-luân, dọc ngang một nghìn do-tuần, rồi chín trăm, tám trăm, và cho đến cung điện cực nhỏ là một trăm do-tuần. Cung điện có bảy lớp tường, bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, trang hoàng chung quanh bằng bảy thứ báu,… cho đến, vô số các loài chim cùng nhau hót líu lo, cũng lại như vậy.",
        "“Phía Bắc nhà hội nghị có bảy đường cấp báu dẫn vào trong cung điện; lại có đường cấp dẫn đến vườn Sa-la; có đường cấp dẫn đến vườn Cực diệu; có đường dẫn đến vườn Thiểm-ma; có đường cấp dẫn đến vườn Nhạc lâm; có đường cấp dẫn đến cây trú độ; có đường cấp dẫn đến ao Bạt-nan-đà; có đường cấp dẫn đến cung điện đại thần; có đường cấp dẫn đến cung điện của Tiểu A-tu-luân.",
        "“Nếu khi nào vua A-tu-luân muốn đến vườn Sa-la để ngoạn cảnh, chỉ cần nghĩ đến vua Tỳ-ma-chất-đa A-tu-luân, thì vua Tỳ-ma-chất-đa A-tu-luân lại tự nghĩ rằng: ‘vua La-ha A-tu-luân đang nghĩ đến ta.’ Liền tự sửa soạn trang bị, đóng ngựa vào xe báu, cùng vô số người hầu kẻ hạ vây quanh theo sau, đến trước vua La-ha A-tu-luân, đứng một bên.",
        "“Lại khi vua A-tu-luân lại nghĩ đến vua Ba-la-ha A-tu-luân, thì vua Bala-ha A-tu-luân nghĩ rằng: ‘Nay vua đang nghĩ đến ta.’ Liền tự sửa soạn trang bị, đóng ngựa vào xe báu, cùng với vô số kẻ hầu người hạ vây quanh theo sau đến đứng một bên trước vua La-ha.",
        "“Khi vua A-tu-luân lại nghĩ đến vua Thiểm-ma A-tu-luân, thì vua Thiểm-ma A-tu-luân lại tự nghĩ rằng:",
        "‘Hiện nay vua đang nghĩ đến ta.’ Liền tự sửa soạn trang bị đóng ngựa vào xe báu, cùng vô số kẻ hầu người hạ vây quanh theo sau, đến đứng một bên trước vua La-ha.",
        "“Khi vua lại nghĩ đến đại thần của vua A-tu-luân, thì đại thần của A-tuluân lại nghĩ rằng: ‘Nay vua đang nghĩ đến ta.’ Liền tự sửa soạn trang bị đóng ngựa vào xe báu, cùng vô số kẻ hầu người hạ vây quanh theo sau, đến đứng một bên trước vua La-ha. Lúc này, vua lại nghĩ đến Tiểu A-tu-luân, thì Tiểu Atu-luân lại nghĩ rằng: ‘Nay vua đang nghĩ đến ta.’ Liền tự sửa soạn trang bị cùng mọi người đến đứng một bên trước vua La-ha.",
        "“Lúc này, vua La-ha mình mặc áo báu, đóng ngựa vào xe báu, cùng với vô số mọi người vây quanh trước sau đến trong rừng Sa-la, thì tự nhiên có gió thổi cửa tự mở, tự nhiên gió thổi đất sạch, tự nhiên gió thổi hoa rụng xuống đất, ngập đến đầu gối. Sau khi vua La-ha vào vườn này rồi, thì cùng nhau vui đùa từ một ngày, hai ngày,… cho đến bảy ngày. Sau khi vua đùa xong, liền trở về lại cung điện mình. Sau đó việc ngoạn cảnh đối với vườn Cực diệu, vườn Thiểm-ma, vườn Nhạc lâm, thì cũng lại như vậy. Lúc này, vua La-ha luôn luôn có năm Đại A-tu-luân hầu cận và bảo vệ hai bên: một tên là Đề Trì, hai tên là Hùng Lực, ba tên là Võ Di, bốn tên là Đầu Thủ, năm tên là Tồi Phục .Năm Đại A-tu-luân này luôn luôn hầu cận bảo vệ hai bên. Cung điện của vua La-ha này ở dưới nước biển lớn. Nước biển ở trên được duy trì bởi bốn thứ gió: một là trụ phong, hai là trì phong, ba là bất động, bốn là kiên cố, chúng giữ cho nước biển lớn, treo ngược giữa hư không, giống như mây nổi, cách cung điện A-tu-luân một vạn do-tuần, không bao giờ bị rớt. Oai thần, công đức, và phước báo của vua A-tu-luân là như vậy.”"
    ]
}