{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "11. KINH TĂNG NHẤT",
        "Số Phẩm": "PHẦN 2",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Tôi nghe như vầy:",
        "Một thời, Phật ở tại nước Xá-vệ, rừng cây Kỳ-đà, vườn Cấp cô độc, cùng với chúng đại Tỳ-kheo một ngàn hai trăm năm mươi người.",
        "Bấy giờ, Thế Tôn nói với các Tỳ kheo:",
        "“Nay Ta sẽ nói pháp cho các thầy nghe; pháp vi diệu, khoảng đầu, khoảng giữa, khoảng cuối thảy đều chân chánh, có đầy đủ nghĩa và vị, phạm hạnh thanh tịnh. Đó là pháp tăng nhất. Các thầy hãy lắng nghe, hãy suy ngẫm kỹ. Ta sẽ giảng thuyết.” Các Tỳ-kheo vâng lời lắng nghe. Phật nói với các Tỳ-kheo:",
        "“Pháp tăng nhất ấy là, một thành pháp, một tu pháp, một giác pháp, một diệt pháp, một chứùng pháp.",
        "“Thế nào là một thành pháp? Đó là: không bỏ các pháp thiệân.",
        "“Thế nào là một tu pháp? Đó là: thường tự niệm thân.",
        "“Thế nào là một giác pháp? Đó là:",
        "xúc hữu lậu.",
        "“Thế nào là một diệt pháp? Đó là:",
        "ngã mạn.",
        "“Thế nào là một chứng pháp? Đó là: vô ngại tâm giải thoát.",
        "“Lại nữa, có hai thành pháp, hai tu pháp, hai giác pháp, hai diệt pháp, hai chứng pháp.",
        "“Thế nào là hai thành pháp? Biết tàm và biết quí.",
        "“Thế nào là hai tu pháp? Chỉ và quán .",
        "“Thế nào là hai giác pháp? Danh và sắc.",
        "“Thế nào là hai diệt pháp? Vô minh và hữu ái.",
        "“Thế nào là hai chứng pháp? Minh và giải thoát.",
        "“Lại nữa, có ba thành pháp, ba tu pháp, ba giác pháp, ba diệt pháp, ba chứng pháp.",
        "“Thế nào là ba thành pháp?",
        "1. Thân cận thiện hữu,",
        "2. Tai nghe pháp âm,",
        "3. Thành tựu pháp và tùy pháp.",
        "“Thế nào là ba tu pháp? Đó là ba tam-muội: không tam-muội, vô tướng tam-muội, vô tác tam-muội.",
        "“Thế nào là ba giác pháp? Đó là ba thọ: khổ thọ, lạc thọ, phi khổ phi lạc thọ.",
        "“Thế nào là ba diệt pháp? Đó là ba ái: dục ái, hữu ái, vô hữu ái.",
        "“Thế nào là ba chứng pháp? Đó là ba minh: túc mạng trí, thiên nhãn trí và lậu tận trí.",
        "“Lại nữa, có bốn thành pháp, bốn tu pháp, bốn giác pháp, bốn diệt pháp, bốn chứng pháp.",
        "“Thế nào là bốn thành pháp? Đó là luân pháp:",
        "1. Sống ở trung ương của đất nước,",
        "2. Gần thiện hữu,",
        "3. Tự cẩn thận,",
        "4. Có gốc rễ thiện đã được trồng từ đời trước.",
        "“Thế nào là bốn tu pháp? Đó là bốn niệm xứ: Tỳ-kheo quán thân trên nội thân, tinh cần không biếng nhác, ức niệm không quên, trừ tham ưu ở đời. Quán thân trên ngoại thân, tinh cần không biếng nhác, ức niệm không quên, trừ tham ưu ở đời. Quán thân trên nội ngoại thân, tinh cần không biếng nhác, ức niệm không quên, trừ tham ưu ở đời. 2. Quán thọ, 3. Quán ý, 4. Quán pháp cũng như vậy.",
        "“Thế nào là bốn giác pháp? Đó là bốn thức ăn: thức ăn bằng vo nắm, thức ăn bằng cảm xúc, thức ăn bằng tư niệm, thức ăn do thức.",
        "“Thế nào là bốn diệt pháp? Đó là bốn thủ: dục thủ, ngã ngữ thủ, giới cấm thủ, và kiến thủ.",
        "“Thế nào là bốn chứng pháp? Đó là bốn Sa-môn quả: Tu-đà-hoàn quả, Tưđa-hàm quả, A-na-hàm quả, A-la-hán quả.",
        "“Lại nữa, có năm thành pháp, năm tu pháp, năm giác pháp, năm diệt pháp, năm chứng pháp.",
        "“Thế nào là năm thành pháp? Đó là năm diệt tận chi:",
        "1. Tin Phật, Như Lai, Chí chân, mười hiệu thành tựu,",
        "2. Không bệnh, thân thường an ổn,",
        "3. Chất trực, không dua xiểm, hướng thẳng đến con đường dẫn đến Niết-bàn của Như Lai,",
        "4. Chuyên tâm không tán loạn, đọc cũng không quên lãng,",
        "5. Khéo léo quán sát sự sinh diệt của pháp, bằng thực hành của Hiền Thánh mà diệt tận gốc rễ khổ.",
        "“Thế nào là năm tu pháp? Đó là năm căn: tín căn, tinh tấn căn, niệm căn, định căn, và tuệ căn.",
        "“Thế nào là năm giác pháp? Đó là năm thọ ấm: sắc thọ ấm, thọ, tưởng, hành thức thọ ấm.",
        "“Thế nào là năm diệt pháp? Đó là năm cái: tham dục cái, sân nhuế cái, thụy miên cái, trạo hối cái, và nghi cái.",
        "“Thế nào là năm chứng pháp? Đó là năm tụ vô học: tụ vô học giới, tụ vô học định, tụ vô học tuệ, tụ vô học giải thoát, tụ vô học giải thoát tri kiến.",
        "“Lại nữa có sáu thành pháp, sáu tu pháp, sáu giác pháp, sáu diệt pháp, sáu chứng pháp.",
        "“Thế nào là sáu thành pháp? Đó là sáu pháp tôn trọng: Nếu có Tỳ-kheo tu sáu pháp tôn trọng, đáng kính, đáng trọng, hòa hợp với chúng không có tranh tụng, độc hành không hỗn tạp. Những gì là sáu?",
        "1. Ở đây, Tỳ-kheo thân thường hành từ, kính đồng phạm hạnh, sống với tâm nhân ái. Đó gọi là pháp, tôn trọng, đáng kính, đáng trọng, hòa hợp với chúng, không có tranh tụng, độc hành không tạp.",
        "2-4. Lại nữa, Tỳ-kheo khẩu hành từ, ý hành từ; được vật lợi dưỡng đúng pháp và những thức ăn ở trong bát cũng đều đem chia cho người khác dùng chung, không phân biệt đây kia.",
        "5. Lại nữa, Tỳ-kheo, đối với giới mà bậc thánh hành trì, không phạm, không hủy, không nhiễm ô, được bậc trí khen ngợi, khéo thọ trì đầy đủ, thành tựu định ý.",
        "6. Chánh kiến và các phạm hạnh để thành tựu sự xuất yếu của hiền thánh, để chân chánh diệt tận khổ, đó gọi là pháp tôn trọng, đáng kính đáng trọng, hòa hợp với chúng, không có tranh tụng, độc hành không hỗn tạp.",
        "“Thế nào là sáu tu pháp? Đó là sáu tu niệm: niệm Phật, niệm Pháp, niệm Tăng, niệm giới, niệm thí, niệm thiên.",
        "“Thế nào là sáu giác pháp? Đó là sáu nội nhập: nhãn nhập, nhĩ nhập, tỷ nhập, thiệt nhập, thân nhập, ý nhập.",
        "“Thế nào là sáu diệt pháp? Đó là sáu ái: sắc ái, thanh ái, hương ái, vị ái, xúc ái, pháp ái.",
        "“Thế nào là sáu chứng pháp? Đó là sáu thần thông:",
        "1. Thần túc thông chứng,",
        "2. Thiên nhĩ thông chứng,",
        "3. Tri tha tâm thông chứng,",
        "4. Túc mạng thông chứng,",
        "5. Thiên nhãn thông chứng.",
        "6. Lậu tận thông chứng.",
        "“Lại nữa, có bảy thành pháp, bảy tu pháp, bảy giác pháp, bảy diệt pháp, bảy chứng pháp.",
        "“Thế nào là bảy thành pháp? Đó là bảy tài sản: tín là tài sản, giới là tài sản, tàm là tài sản, quí là tài sản, đa văn là tài sản, huệ thí là tài sản.",
        "“Thế nào là bảy tu pháp? Đó là bảy giác ý: ở đây, Tỳ-kheo tu niệm giác ý, y vô dục, y tịch diệt, y viễn ly. Tu pháp, tu tinh tấn, tu hỷ, tu ỷ, tu định, tu xả, y vô dục, y tịch diệt, y viễn ly.",
        "“Thế nào là bảy giác pháp? Đó là bảy trú xứ thức: Hoặc có chúng sanh với nhiều tâm khác nhau, nhiều tưởng khác nhau, đó là Trời và Người vậy. Đó là thức trú thứ nhất. Lại có chúng sanh, với nhiều thân khác nhau nhưng một tưởng, đó là trời Phạm Quang âm lúc mới sanh đầu tiên. Đó là thức trú thứ hai. Lại có chúng sanh với một thân nhưng nhiều tưởng khác nhau, đó là trời Quang âm. Đó là thức trú thứ ba. Lại có chúng sanh với một thân và một tưởng giống nhau, đó là trời Biến tịnh.",
        "Đó là thức trú thứ tư. Lại có chúng sanh trú hư không xứ. Đó là thức trú thứ năm. Lại có chúng sanh trú ở thức xứ. Đó là thức trú thứ sáu. Hoặc trú bất dụng xứ. Đó là thức trú thứ bảy.",
        "“Thế nào là bảy diệt pháp? Đó là bảy sử: sai sử bởi dục ái, sai sử bởi hữu ái, sai sử bởi kiến, sai sử bởi mạn, sai sử bởi sân nhuế, sai sử bởi vô minh, sai sử bởi nghi.",
        "“Thế nào là bảy chứng pháp? Đó là bảy năng lực diệt tận lậu hoặc: ở đây, Tỳ-kheo, đối với hết thảy khổ, sự tập khởi của khổ, sự diệt trừ, vị ngọt, sự tai hại, và sự xuất ly của khổ mà biết như thật, thấy như thật; quán sát dục như hầm lửa, và cũng như đao kiếm, biết dục, thấy dục, không tham nơi dục, tâm không trụ nơi dục. Ở trong đó lại khéo quán sát; sau khi đã như thật giác tri, như thật thấy, tham, tật, ác bất thiện pháp của thế gian không rò rỉ, không sinh khởi. Tu tứ niệm xứ, tu tập nhiều lần, thực hành nhiều lần. Tu năm căn, năm lực, bảy giác ý, tám Hiền Thánh đạo, tu tập nhiều lần, thực hành nhiều lần.",
        "“Lại nữa, có tám thành pháp, tám tu pháp, tám giác pháp, tám diệt pháp, tám chứng pháp.",
        "“Thế nào là tám thành pháp? Đó là tám nhân duyên khiến cho chưa sở đắc phạm hạnh nhưng có thể sở đắc trí, và nếu đã sở đắc phạm hạnh thì trí tăng trưởng. Những gì là tám? Ở đây, Tỳ kheo sống nương tựa Thế Tôn, hoặc nương tựa sư trưởng, hoặc nương tựa người phạm hạnh có trí tuệ, sanh tâm tàm quý, có ái, có kỉnh. Đó là nhân duyên thứ nhất, khiến cho chưa đắc phạm hạnh mà chứng đắc trí; nếu đắc phạm hạnh rồi thì trí tăng trưởng. Lại nữa, nương tựa Thế Tôn, tùy thời mà thưa hỏi: ‘Pháp này có ý nghĩa gì? Dẫn đến đâu?’, khi ấy các tôn trưởng liền mở bày cho nghĩa lý thậm thâm. Đó là nhân duyên thứ hai. Sau khi nghe pháp thân tâm an lạc, an tĩnh. Đó là nhân duyên thứ ba. Không luận bàn những tạp luận vô ích làm chướng ngại đạo; vị ấy đến giữa đại chúng, hoặc tự mình thuyết pháp, hoặc thỉnh người khác thuyết, mà vẫn không bỏ sự im lặng của Hiền Thánh. Đó là nhân duyên thứ tư. Đa văn, quảng bác, ghi nhớ không quên các pháp thâm áo, hay khéo ở khoảng đầu, khoảng giữa và khoảng cuối, có nghĩa có vị, chân thật, đầy đủ phạm hạnh. Sau khi nghe thì ghi nhớ trong lòng, kiến giải không lay động. Đó là nhân duyên thứ năm. Tu tập tinh cần, diệt ác tăng thiện, gắng sức thực hành không bỏ pháp ấy. Đó là nhân duyên thứ sáu. Bằng trí tuệ mà nhận thức pháp sanh diệt, chỗ thú hướng của Hiền Thánh, tận cùng biên tế của khổ. Đó là nhân duyên thứ bảy. Quán tướng sanh và tướng diệt của năm thọ ấm: Đây là sắc, đây là sự tập khởi của sắc, đây là sự diệt tận của sắc. Đây là sự tập khởi của thọ, tưởng, hành, thức, sự diệt tận của thọ, tưởng, hành, thức. Đó là nhân duyên thứ tám, khiến cho chưa sở đắc phạm hạnh mà sở đắc trí, nếu đã sở đắc phạm hạnh thì trí tuệ tăng trưởng.",
        "“Thế nào là tám tu pháp? Đó là tám con đường của Hiền Thánh: chánh kiến, chánh chí, chánh ngữ, chánh nghiệp, chánh mạng, chánh phương tiện, chánh niệm, chánh định.",
        "“Thế nào là tám giác pháp? Đó là tám pháp ở đời: lợi, suy, vinh, nhục, khen, chê, khổ, lạc.",
        "“Thế nào là tám diệt pháp? Đó là tám tà: tà kiến, tà tư, tà ngữ, tà nghiệp, tà mạng, tà phương tiện, tà niệm, tà định. “Thế nào là tám chứng pháp? Đó là tám giải thoát. Bên trong có sắc tưởng, quán sắc: giải thoát thứ nhất. Bên trong có sắc tưởng, quán ngoại sắc: giải thoát thứ hai. Tịnh giải thoát: giải thoát thứ ba. Vượt sắc tưởng, diệt sân nhuế tưởng, an trú không xứ: giải thoát thứ tư. Vượt qua không xứ, an trú thức xứ: giải thoát thứ năm. Vượt qua thức xứ, an trú bất dụng xứ: giải thoát thứ sáu. Vượt qua bất dụng xứ, an trú hữu tưởng vô tưởng xứ: giải thoát thứ bảy. Vượt hữu tưởng vô tưởng xứ, an trú tưởng tri diệt: giải thoát thứ tám.",
        "“Lại nữa, có chín thành pháp, chín tu pháp, chín giác pháp, chín diệt pháp, chín chứng pháp.",
        "“Thế nào là chín thành pháp? Đó là chín tịnh diệt chi: giới tịnh diệt chi, tâm tịnh diệt chi, kiến tịnh diệt chi, độ nghi tịnh diệt chi, phân biệt tịnh diệt chi, đạo tịnh diệt chi, trừ tịnh diệt chi, vô dục tịnh diệt chi, giải thoát tịnh diệt chi.",
        "“Thế nào là chín tu pháp? Đó là chín gốc rễ của hỷ: 1. hỷ, 2. ái, 3. duyệt, 4. lạc, 5. định, 6. như thật tri, 7. trừ xả, 8. vô dục, 9. giải thoát.",
        "“Thế nào chín giác pháp? Đó là chín chúng sanh cư.",
        "1. Hoặc có chúng sanh có nhiều thân khác nhau, với nhiều tưởng khác nhau, tức là chư Thiên và loài Người. Đó là nơi cư trú thứ nhất của chúng sanh.",
        "2. Lại có chúng sanh có nhiều thân khác nhau, nhưng với một tưởng giống nhau, tức là trời Phạm Quang âm lúc mới sanh. Đó là cư trú thứ hai của chúng sinh.",
        "3. Lại có chúng sanh với một thân giống nhau, nhưng với nhiều tưởng khác nhau, tức là trời Quang âm. Đó là cư trú thứ ba của chúng sanh.",
        "4. Lại có chúng sanh với một thân một tưởng giống nhau, tức là trời Biến tịnh. Đó là cư trú thứ tư của chúng sanh.",
        "5. Lại có chúng sanh không có tưởng và không có giác tri, tức là trời Vô tưởng. Đó là cư trú thứ năm của chúng sanh.",
        "6. Lại có chúng sanh an trú hư không xứ. Đó là cư trú thứ sáu của chúng sanh.",
        "7. Lại có chúng sanh an trú thức xứ. Đó là an trú thứ bảy của chúng sanh.",
        "8. Lại có chúng sanh an trú vô sở hữu xứ. Đó là cư trú thứ tám của chúng sanh.",
        "9. Lại có chúng sanh an trú phi tưởng phi phi tưởng xứ. Đó là cư trú thứ chín của chúng sanh.",
        "“Thế nào là chín diệt pháp? Đó là chín gốc rễ của ái. Nhân ái có tìm cầu. Nhân cầu có lợi. Nhân lợi có dụng. Nhân dụng có dục. Nhân dục có dính trước. Nhân trước có tật đố. Nhân tật có bảo thủ. Nhân thủ có hộ.",
        "“Thế nào là chín chứng pháp? Đó là chín tận. Nếu nhập sơ thiền, thì gai nhọn là âm thanh bị diệt trừ. Nhập đệ nhị thiền, gai nhọn là giác và quán bị diệt trừ. Nhập đệ tam thiền, gai nhọn là hỷ bị diệt trừ. Nhập đệ tứ thiền, gai nhọn là hơi thở ra vào bị diệt trừ. Nhập không xứ, gai nhọn là sắc tưởng bị diệt trừ. Nhập thức xứ, gai nhọn là không tưởng bị diệt trừ. Nhập bất dụng xứ, gai nhọn là thức tưởng bị diệt trừ. Nhập hữu tưởng vô tưởng xứ, gai nhọn là bất dụng tưởng bị diệt trừ. Nhập diệt tận định, gai nhọn là tưởng và thọ bị diệt trừ.",
        "“Lại nữa, có mười thành pháp, mười tu pháp, mười giác pháp, mười diệt pháp, mười chứng pháp.",
        "“Thế nào là mười thành pháp? Đó là mười cứu pháp.",
        "1. Tỳ-kheo đầy đủ hai trăm năm mươi giới, đầy đủ oai nghi, thấy lỗi nhỏ nhặt sanh tâm lo sợ lớn, chân chánh học giới, tâm không nghiêng lệch.",
        "2. Có được thiện tri thức.",
        "3. Ngôn ngữ trung chánh, nhẫn nhịn được nhiều điều.",
        "4. Ưa cầu thiện pháp, phân bố không tiếc lẫn.",
        "5. Các đồng phạm hạnh có việc phải làm liền đến giúp đỡ không lấy làm mệt nhọc, làm được những việc khó làm và cũng dạy người khác làm.",
        "6. Nghe nhiều; nghe xong thì ghi nhớ không hề quên.",
        "7. Tinh tấn, diệt trừ bất thiện pháp, tăng trưởng thiện pháp.",
        "8. Thường tự chuyên niệm, không có tưởng khác, nhớ những hành vi thiện từ trước như thấy trước mắt.",
        "9. Trí tuệ thành tựu, quán sự sanh diệt của các pháp, bằng pháp luật Hiền Thánh mà đoạn trừ gốc khổ.",
        "10. Vui với sự nhàn cư, chuyên niệm tư duy, ở trung gian thiền, không có đùa giỡn.",
        "“Thế nào là mười tu pháp? Đó là mười chánh hạnh. Chánh kiến, chánh tư duy, chánh ngữ, chánh nghiệp, chánh mạng, chánh phương tiện, chánh niệm, chánh định, chánh giải thoát, chánh tri.",
        "“Thế nào là mười giác pháp? Đó là mười sắc nhập. Nhãn nhập, nhĩ, tỉ, thiệt, thân nhập; sắc, thanh, hương, vị, xúc nhập.",
        "“Thế nào là mười diệt pháp? Đó là mười tà hạnh. Tà kiến, tà tư duy, tà ngữ, tà nghiệp, tà mạng, tà phương tiện, tà niệm, tà định, tà giải thoát, tà trí.",
        "“Thế nào là mười chứùng pháp? Đó là mười vô học pháp. Vô học chánh kiến, chánh tư duy, chánh ngữ, chánh nghiệp, chánh mạng, chánh phương tiện, chánh niệm, chánh định, chánh giải thoát, chánh trí.",
        "“Các Tỳ-kheo, đó tăng nhất pháp. Ta nay đã nói cho các thầy pháp như vậy. Ta, Như Lai, đã làm đầy đủ những điều cần làm cho đệ tử. Với lòng thương yêu, Ta đã răn dạy các thầy. Các thầy cũng nên tinh tấn phụng hành.",
        "“Này các Tỳ-kheo, hãy ở chỗ thanh vắng, dưới gốc cây hay bãi đất trống, tinh cần tọa thiền, chớ tự để mình buông lung. Nay không gắng sức, về sau hối hận nào có ích gì. Đó là lời Ta răn dạy, hãy tinh tấn thọ trì.”",
        "Bấy giờ, các Tỳ-kheo sau khi nghe những điều Phật thuyết, hoan hỷ phụng hành."
    ]
}