{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "08. KINH TÁN-ĐÀ-NA",
        "Số Phẩm": "PHẦN 2",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Tôi nghe như vầy:",
        "Một thời, Phật ở tại động cây Thất diệp , núi Tỳ-ha-la, thành La-duyệt-kỳ cùng chúng đại Tỳ-kheo một ngàn hai trăm năm mươi người.",
        "Lúc đó, ở thành Vương xá có một cư sĩ tên Tán-đà-na , tính ưa đi dạo, cứ ngày ngày ông ra khỏi thành, đến chỗ đức Thế Tôn. Một hôm, ông xem bóng mặt trời rồi thầm nghĩ: “Giờ này chưa phải lúc đến bái yết Phật. Giờ nầy Phật còn nhập định tại tịnh thất, và các Tỳ kheo cũng đang thiền tịnh. Ta hãy đi đến rừng của nữ Phạm chí Ô-tạm-bà-lỵ , chờ đúng giờ sẽ đến Phật để lễ bái và gặp các Tỳ-kheo cung kính thăm viếng”.",
        "Trong rừng của nữ Phạm chí lúc đó có Phạm chí tên Ni-câu-đà cùng năm trăm đệ tử đang tụ tập một chỗ, lớn tiếng bàn luận, suốt ngày chỉ nói những điều phù phiếm, chướng đạo. Hoặc luận bàn quốc sự. Hoặc bàn việc đao binh chiến tranh. Hoặc bàn việc quốc gia hòa nghĩa. Hoặc bàn việc đại thần, việc thứ dân. Hoặc bàn chuyện xe ngựa, công viên, rừng. Hoặc bàn chuyện chiếu giường, y phục, ăn uống, phụ nữ. Hoặc bàn việc núi biển, rùa trạnh. Nghĩa là họ chỉ bàn những điều chướng ngại đạo như thế mà hết ngày.",
        "Khi Phạm chí kia vừa xa thấy bóng cư sĩ Tán-đà-na đi lại liền ra lệnh: “Chúng ngươi hãy tĩnh lặng. Vì sao vậy? Vì có đệ tử của Sa-môn Cù-đàm đang từ ngoài đến. Trong hàng đệ tử bạch y của Sa-môn Cù-đàm, ông đó vào hạng trưởng thượng. Ông ấy chắc đi đến đây. Các ngươi hãy im lặng”. Các Phạm chí đều im lặng. Cư sĩ Tánđà-na đi đến chỗ Phạm chí, chào hỏi xong ngồi một bên và nói với Phạm chí:",
        "“Thầy tôi, Đức Thế Tôn, thường ưa nhàn tĩnh, chẳng ưa huyên náo. Không như các ông và đệ tử các ông ưa ở giữa đám đông cao tiếng luận đàm. Nhưng chỉ toàn những lời chướng đạo, vô ích.”",
        "Phạm chí nói lại:",
        "“Sa-môn Cù-đàm có từng cùng mọi người đàm luận không? Mọi người làm sao biết được Sa-môn có đại trí tuệ? Thầy ngươi thường ưa ở chỗ biên địa. Cũng như con trâu đui ăn cỏ, chỉ hài lòng với chỗ mà nó thấy. Thầy ngươi là Cù-đàm cũng thế. Cứ ham điều độc kiến riêng nên mới ưa chỗ không người. Nếu thầy ngươi lại đây, chúng ta sẽ kêu là trâu đui. Sa-môn Cù-đàm thường xưng là bậc đại trí tuệ, nhưng ta chỉ cần một câu là đủ làm cho cùng bí mà phải im lặng. Ví như con rùa thun hết mình vào vỏ cho thế là yên ổn rồi. Nhưng ta chỉ cần một mũi tên là làm cho không chỗ tránh.”",
        "Lúc đó, đức Thế Tôn đang ở tại tịnh thất, bằng thiên nhĩ, nghe câu chuyện giữa Phạm chí và cư sĩ như thế, liền ra khỏi động Thất-diệp, đi đến rừng nữ Phạm chí Ô-tạm-bà-lỵ. Khi Phạm chí vừa từ xa thấy Phật đi lại, bảo các đệ tử:",
        "“Các ngươi im lặng. Sa-môn Cù-đàm đang muốn đến đây. Các ngươi chớ đứng dậy nghinh đón, cung kính lễ bái, cũng đừng mời ngồi. Chỉ riêng một chỗ cho ông ta ngồi thôi. Khi y ngồi xong các ngươi hãy hỏi: ‘Sa-môn Cù-đàm, từ trước đến nay ông dạy bảo cho đệ tử những pháp gì để họ được an ổn, tịch định, tịnh tu phạm hạnh’.”",
        "Bấy giờ, Thế Tôn vừa đi đến khu vườn, Phạm chí bất giác đứng dậy, nghinh đón Thế Tôn và nói rằng:",
        "“Xin mời đến đây, Cù-đàm. Xin mời đến đây, Sa-môn. Từ lâu không được gặp, nay có việc gì Ngài đến đây? Xin mời ngồi tạm ở đàng trước.”",
        "Khi ấy, đức Thế Tôn ngồi xuống, vui vẻ mỉm cười và thầm nghĩ: ‘Các người ngu nầy không tự chủ được. Trước đã đặt lệnh ước với nhau mà rốt cuộc không giữ toàn.’ Sở dĩ vậy, là vì thần lực của Phật khiến ác tâm của chúng tự nhiên tiêu tan.",
        "Cư sĩ Tán-đà-na đảnh lễ chân Phật rồi ngồi một bên.",
        "Phạm chí Ni-câu-đà chào hỏi Phật xong cũng ngồi một bên và bạch Phật:  “Sa-môn Cù-đàm từ trước đến nay dạy bảo hàng đệ tử những pháp gì khiến họ được tịch định an vui, tịnh tu phạm hạnh?”",
        "Phật nói:",
        "“Hãy thôi Phạm chí. Pháp Ta sâu rộng. Những điều mà từ trước đến nay Ta dạy các đệ tử được an vui, tịnh tu phạm hạnh, không phải là những điều mà ông có thể theo kịp.”",
        "Rồi Phật lại nói với Phạm chí:",
        "“Dẫu đến cả đạo pháp mà thầy của ông và các đệ tử của ông tu hành, tịnh hay bất tịnh , Ta cũng nói được cả.” Lúc đó năm trăm đệ tử Phạm chí nầy đều cất tiếng bảo nhau: “Sa-môn Cùđàm có oai thế lớn, có thần lực lớn thật. Người ta hỏi nghĩa lý mình, mình lại giảng trở lại nghĩa lý của người ta!” Phạm chí bạch Phật:",
        "“Lành thay Cù-đàm! Xin Ngài phân biệt cho.”",
        "Phật bảo Phạm chí:",
        "“Này Phạm chí, hãy lắng nghe, hãy lắng nghe. Ta sẽ nói.” Phạm chí đáp:",
        "“Rất vui lòng được nghe.” Phật nói:",
        "“Những điều sở hành của ông toàn là thấp hèn. Như việc, cởi bỏ y phục để trần truồng , hoặc lấy tay che , hoặc không nhận đồ ăn đựng trong cái ghè , không nhận đồ ăn đựng trong chậu, không nhận đồ ăn giữa hai bức vách , không nhận đồ ăn giữa hai người, không nhận đồ ăn giữa hai con dao , không nhận đồ ăn giữa hai cái chậu , không nhận đồ ăn từ gia đình đang ăn chung , không nhận đồ ăn từ nhà có thai, không nhận đồ ăn từ nhà được thấy có chó đứng trước cửa, không nhận đồ ăn từ nhà có nhiều ruồi, không nhận lời mời ăn, không nhận đồ ăn từ người nói đã có biết từ trước, không ăn cá, không ăn thịt, không uống rượu, không ăn với hai chén bát, một bữa ăn, một lần nuốt cho đến bảy lần nuốt thì thôi, nhận thức ăn được thêm , không quá bảy lần thêm, hoặc mỗi ngày ăn một bữa, hoặc hai ngày, ba ngày, bốn ngày, năm ngày, sáu ngày, bảy ngày ăn một bữa, hoặc chỉ ăn rau , hoặc chỉ ăn cỏ lúa , hoặc chỉ uống nước cơm, hoặc chỉ ăn mè, hoặc ăn gạo lứt, hoặc ăn phân bò, hoặc ăn phân nai, hoặc ăn rễ, nhánh lá, trái, hột cây, hoặc ăn trái cây tự rụng, hoặc choàng áo, hoặc mặc áo cỏ cú , hoặc mặc vỏ cây, hoặc lấy cỏ quấn mình, hoặc mặc da nai, hoặc để đầu tóc , hoặc mang tấm lông bện, hoặc mặc áo vất ở gò mả, hoặc thường đưa tay lên, hoặc không ngồi giường chiếu, hoặc thường ngồi chồm hổm, hoặc cạo tóc chừa râu, hoặc nằm trên chông gai, hoặc nằm trên dưa quả, hoặc lõa hình nằm trên phân bò, hoặc một ngày tắm ba lần, hoặc một đêm tắm ba lần. Tóm lại là lấy vô số chuyện khổ cực hành hạ xác thân. Ni-câu-đà, ý ngươi nghĩ sao?",
        "Tu những hạnh như thế, đáng gọi là thanh tịnh pháp chăng? ” Ni-câu-đà đáp:",
        "“Pháp đó là tịnh , chớ chẳng phải bất tịnh.”",
        "Phật nói:",
        "“Ngươi bảo là tịnh, Ta sẽ từ trong cái tịnh của ông đó chỉ ra điều cấu uế cho ông xem.”",
        "Ni-câu-đà nói: “Hay lắm, Cù-đàm! Ngài cứ nói, tôi xin nghe”.",
        "Phật nói:",
        "“Những người kia trong khi tu khổ hạnh mà tâm thường tính nghĩ rằng: ‘Ta làm như thế này sẽ được mọi người cúng dường, cung kính, lễ bái.’ Thế là cấu uế. Người tu khổ hạnh kia khi được cúng dường rồi thì say đắm giữ chặt, ưa luyến không rời, không biết xa lìa, không biết cách thoát ra. Thế là cấu uế. Người tu khổ hạnh kia mà vừa trông thấy bóng ai đi đến, thì cùng nhau ngồi thiền. Khi không ai thì mặc ý nằm ngồi. Thế là cấu uế. Người tu khổ hạnh kia mà nếu nghe chánh nghĩa người khác, không chịu nhìn nhận. Thế là cấu uế. Người tu khổ hạnh kia nếu mà có ai hỏi ngay, tiếc lẫn không chịu đáp. Thế là cấu uế. Người tu khổ hạnh kia mà hễ thấy người nào cúng dường Sa-môn, Bà-la-môn thì la rầy, ngăn cản. Thế là cấu uế. Người tu khổ hạnh kia nếu thấy Sa-môn, Bà-la-môn ăn vật có thể sinh sản nữa liền đến chê trách. Thế là cấu uế. Người tu khổ hạnh kia có thức ăn bất tịnh, không chịu cho người khác mà tham ăn một mình, không thấy lỗi lầm của mình, không biết con đường xuất ly. Thế là cấu uế. Người tu khổ hạnh kia tự khen mình hay, chê bai người khác. Thếù là cấu uế. Người tu khổ hạnh kia mà giết, trộm, tà dâm, hai lưỡi, ác khẩu, nói dối, nói thêu dệt, tham lam, tật đố, tà kiến điên đảo. Thế là cấu uế. Người tu khổ hạnh kia mà lười biếng, lãng quên , không tập thiền, không có trí tuệ, chẳng khác nào cầm thú. Thế là cấu uế. Người tu khổ hạnh kia mà cống cao, kiêu mạn, mạn, tăng thượng mạn .Thế là cấu uế.",
        "Người tu khổ hạnh kia mà không có tín nghĩa, lại không báo đáp, không trì tịnh giới, không hay tinh cần chịu nghe người khuyên răn, thường kết bạn bọn xấu làm điều xấu ác không thôi. Thế là cấu uế. Người tu khổ hạnh kia mà ôm nhiều sân hận, ưa làm xảo quyệt, cậy mình hiểu biết, tìm tòi hay dở của người, thường chấp tà kiến, biên kiến . Thế là cấu uế. Ni-câu-đà, ý ngươi nghĩ thế nào? Tu khổ hạnh như trên, đáng gọi là thanh tịnh ư?  Ni-câu-đà đáp:",
        "“Đó là bất tịnh chứ không phải tịnh.” Phật nói: “Nay Ta từ trong pháp cấu uế ấy của ông mà chỉ ra phần thanh tịnh, vô cấu cho ông hiểu”.",
        "Phạm chí nói: “Xin hãy nói”.",
        "Phật nói:",
        "“Những người tu khổ hạnh kia, nếu không tính nghĩ rằng ta tu như thế này sẽ được sự cúng dường cung kính, lễ bái. Đó là pháp khổ hạnh không cấu uế. Người tu khổ hạnh nếu được cúng dường tâm không tham đắm, hiểu biết xa lìa, rõ biết con đường xuất ly. Đó là pháp khổ hạnh không cấu uế. Người tu khổ hạnh lo tọa thiền thường lệ, không vì có người không người mà thay đổi. Đó là pháp khổ hạnh thanh tịnh . Người tu khổ hạnh, nếu nghe ai nói chánh nghĩa thì hoan hỷ tín nhận. Đó là pháp khổ hạnh thanh tịnh. Người tu khổ hạnh nếu gặp ai hỏi ngay thì hoan hỷ đáp. Đó là pháp khổ hạnh thanh tịnh. Người tu khổ hạnh hễ thấy ai cúng dường Sa-môn, Bà-la-môn thì hoan hỷ thay họ, chứ không la rầy ngăn cản. Đó là pháp khổ hạnh thanh tịnh. Người tu khổ hạnh nếu thấy Sa-môn, Bà-la-môn ăn vật có cơ sanh lại, không tới chê bai. Đó là pháp khổ hạnh thanh tịnh. Người tu khổ hạnh mà gặp món ăn bất tịnh, tâm không lẫn tiếc, gặp món ăn tịnh tâm không say đắm, xét thấy lỗi mình, biết cách thoát ly. Đó là pháp khổ hạnh thanh tịnh. Người tu khổ hạnh không tự khen mình, không chê kẻ khác. Đó là pháp khổ hạnh thanh tịnh. Người tu khổ hạnh không sát, không đạo, không dâm, không hai lưỡi, không ác khẩu, không nói dối, không thêu dệt, không tham lam, không tật đố, không tà kiến. Đó là pháp khổ hạnh thanh tịnh. Người tu khổ hạnh mà tinh cần không quên, ưa tập thiền định, tu nhiều trí tuệ, chẳng ngu như thú. Đó là pháp khổ hạnh thanh tịnh. Người tu khổ hạnh mà không cống cao, kiêu mạn, tự đại. Đó là pháp khổ hạnh thanh tịnh. Người tu khổ hạnh mà có lòng tín nghĩa, tập hạnh báo bổ, giữ gìn tịnh giới, siêng năng học hỏi, thường kết bạn với người lành, chứa điều lành mãi. Đó là pháp khổ hạnh thanh tịnh. Người tu khổ hạnh mà không ôm lòng sân hận, không xảo ngụy, không cậy mình biết, không tìm dở người, không chấp chặt tà kiến cũng không biên kiến. Đó là pháp khổ hạnh thanh tịnh. Phạm chí nghĩ thế nào? Pháp khổ hạnh như thế, đáng gọi là pháp thanh tịnh vô cấu không?” Ni-câu-đà đáp:",
        "“Quả như vậy, quả thật là pháp khổ hạnh thanh tịnh vô cấu.”",
        "Rồi Phạm chí hỏi Phật:",
        "“Khổ hạnh đến chừng mực như vậy đã được gọi là bậc nhất, kiên cố chưa?”",
        "Phật nói:",
        "“Chưa! Đó mới là khổ hạnh vỏ ngoài”",
        "Ni-câu-đà thưa:",
        "“Xin Phật cho biết cốt lõi”",
        "Phật nói:",
        "“Ngươi hãy lắng nghe. Ta sẽ nói cho.”",
        "Phạm chí thưa:",
        "“Vâng. Bạch Thế Tôn, tôi mong muốn được nghe.” Phật nói:",
        "“Này Phạm chí! Người tu khổ hạnh mà tự mình không giết, không dạy người giết, tự mình không trộm cắp, không dạy người trộm cắp, tự mình không tà dâm, không dạy người tà dâm, tự mình không nói dối, không dạy người nói dối. Người ấy đem tâm từ rải khắp một phương, rồi các phương khác cũng vậy, từ tâm quảng đại, bình đẳng vô lượng, khắp cả thế gian, không chút oán kết. Bi tâm, hỷ tâm, xả tâm cũng như thế. Chính đó mới là pháp khổ hạnh thuộc cốt lõi.”",
        "Phạm chí bạch Phật:",
        "“Xin Ngài dạy cho cái nghĩa khổ hạnh kiên cố.” Phật nói:",
        "“Này Phạm chí, hãy lắng nghe, hãy lắng nghe, Ta sẽ nói cho.” Phạm chí đáp:",
        "“Thưa vâng. Bạch Thế Tôn, tôi mong muốn được nghe.” Phật nói:",
        "“Này Phạm chí, người tu khổ hạnh mà tự mình không giết còn dạy người không giết, tự mình không trộm cắp còn dạy người không trộm cắp, tự mình không tà dâm còn dạy người không tà dâm, tự mình không nói dối còn dạy người không nói dối. Người ấy đem từ tâm rải khắp một phương, rồi các phương khác cũng vậy, từ tâm quảng đại, bình đẳng vô lượng, khắp cả thế gian, không chút oán kiết. Bi tâm, hỷ tâm, xả tâm cũng như thế. Người khổ hạnh kia lại có thể biết được việc xảy ra vô số kiếp trước, hoặc một đời, hai đời cho đến vô số đời, quốc độ thành hoại hay kiếp số trước sau, đều thấy đều biết cả. Lại còn thấy biết mình từng sanh vào chủng tộc đó, tên tuổi như thế, ăn uống như thế, sống lâu như thế, chịu khổ chịu vui như thế, từ kia sanh đây, từ đây sanh kia như thế. Những việc từ vô số kiếp như thế đều nhớ cả. Ấy gọi là khổ hạnh kiên cố không hoại của Phạm chí.” Phạm chí bạch Phật:",
        "“Còn thế nào gọi là khổ hạnh bậc nhất?”",
        "Phật nói:",
        "“Này Phạm chí, hãy lắng nghe, hãy lắng nghe, Ta sẽ nói cho.” Phạm chí đáp:",
        "“Thưa vâng. Bạch Thế Tôn, tôi mong muốn được nghe.”",
        "Phật nói:",
        "“Này Phạm chí, những người tu khổ hạnh mà tự mình không giết còn dạy người không giết, tự mình không trộm cắp còn dạy người không trộm cắp, tự mình không tà dâm còn dạy người không tà dâm, tự mình không nói dối còn dạy người không nói dối. Người ấy đem từ tâm rải khắp một phương, các phương khác cũng vậy, từ tâm rộng lớn, trùm khắp, vô nhị vô lượng, không có kết hận, cùng khắp thế gian. Bi, hỷ và xả tâm cũng như vậy.",
        "“Người khổ hạnh ấy tự biết sự việc vô số kiếp quá khứ về trước, một đời, hai đời, cho đến vô số đời, quốc độ, thành hoại, kiếp số chung thủy, thảy đều thấy hết biết hết. Lại tự mình thấy biết: Ta đã từng sanh vào chủng tánh kia, tên họ như vậy, ăn uống, thọ mạng như vậy, cảm nghiệm khổ lạc như vậy, từ đây sanh kia, từ kia sanh đây. Như thế, nhớ hết sự việc vô số kiếp. Vị ấy bằng thiên nhãn thanh tịnh xem xét các loài chúng sanh chết đây sanh kia, nhan sắc đẹp xấu, chỗ hướng đến tốt hay xấu, tùy theo hành vi mà bị đọa lạc; thảy đều thấy hết biết hết.",
        "“Lại biết chúng sanh với thân hành bất thiện, khẩu hành bất thiện, ý hành bất thiện, phỉ báng Hiền Thánh, tà tín điên đảo, sau khi thân hoại mạng chung sẽ đọa vào ba đường dữ. Hoặc có chúng sanh với thân hành thiện, khẩu hành thiện, ý hành thiện, không phỉ báng Hiền Thánh, tu hạnh chánh tín, khi thân hoại mệnh chung được sinh vào cõi trời cõi người. Bằng thiên nhãn thanh tịnh xem thấy các chúng sanh có hành vi nào sinh tới chỗ nào, đều thấy biết hết. Đó gọi là khổ hạnh thù thắng bậc nhất.”",
        "Phật lại nói với Phạm chí:",
        "“Này Phạm chí, ở trong pháp này lại có pháp thù thắng hơn nữa mà Ta thường đem dạy cho hàng Thanh-văn. Họ nhờ pháp đó tu được phạm hạnh.”",
        "Bấy giờ năm trăm đệ tử Phạm chí lớn tiếng bảo nhau:",
        "“Nay chúng ta mới thấy đức Thế Tôn là bậc tối thượng, thầy ta không bằng.” Rồi cư sĩ Tán-đà-na nói với Phạm chí:",
        "“Lúc nãy ông nói ‘nếu gặp Cù-đàm đến thì chúng ta gọi là trâu đui.’ Nay đức Thế Tôn đến sao ông không gọi. Lúc nãy ông nói ‘chỉ cần một câu là đủ làm cho Cù-đàm cùng bí phải làm thinh. Như con rùa thun cả vào vỏ cho thế là yên ổn, ta chỉ cần một mũi tên là không chỗ trốn’, sao nay ông không đem một câu làm cùng bí Như Lai ?” Phật hỏi Phạm chí:",
        "“Thật ngươi có nói lời đó chăng?” Đáp: “Thưa có”.",
        "Phật nói với Phạm chí:",
        "“Ngươi há không nghe các vị tiên túc Phạm chí nói: chư Phật Như Lai ưa ở chỗ núi rừng nhàn tịnh, như Ta ngày nay ưa chỗ nhàn tĩnh, chẳng phải như pháp của các ông chỉ ưa chỗ huyên náo, nói chuyện vô ích suốt ngày ư?” Phạm chí nói:",
        "“Tôi có nghe chư Phật quá khứ ưa chỗ nhàn tĩnh, một mình sống ở núi rừng, như Thế Tôn ngày nay. Không như pháp chúng tôi ưa chỗ huyên náo, nói những chuyện vô ích để cho hết ngày.”",
        "Phật nói: “Ngươi há không suy nghĩ rằng, Sa-môn Cù-đàm có thể thuyết bồ đề, có thể tự điều phục mình và cũng có thể điều phục người khác; có thể tự tịch tịnh và có thể khiến người khác tịch tịnh; có thể tự mình qua bờ bên kia và đưa người khác sang bờ bên kia; tự mình giải thoát và có thể khiến người khác giải thoát; có thể tự mình diệt độ và có thể khiến người khác được diệt độ?”",
        "Lúc bấy giờ, Phạm chí bèn rời chỗ ngồi đứng dậy, đầu mặt làm lễ, hai tay sờ bàn chân Phật, tự xưng tên mình, nói rằng:",
        "“Con là Phạm chí Ni-câu-đà. Con là Phạm chí Ni-câu-đà. Nay tự mình quy y, làm lễ dưới chân Thế Tôn.” Phật nói với Phạm chí:",
        "“Thôi đủ rồi, hãy dừng lại. Miễn sao tâm ngươi tỏ rõ, đó là kính lễ.”",
        "Phạm chí lại lễ dưới chân Phật một lần nữa, rồi ngồi xuống một bên. Phật bảo Phạm chí:",
        "“Ngươi sẽ chẳng nói rằng Phật vì lợi dưỡng mà thuyết pháp chăng? Chớ móng tâm như thế. Nếu có sự lợi dưỡng nào, Ta cũng cho ngươi hết. Pháp được Ta nói, là vi diệu đệ nhất, để diệt trừ bất thiện, tăng trưởng thiện pháp.”",
        "Rồi Phật lại bảo Phạm chí:",
        "“Ngươi sẽ chẳng nói rằng Phật vì tiếng tăm mà thuyết pháp chăng? Vì để được tôn trọng, vì để đứng đầu, vì để có những người tùy thuộc, ví để có chúng đông, mà thuyết pháp chăng? Chớ móng khởi tâm ấy. Nay những người tùy thuộc ngươi vẫn là tùy thuộc của ngươi. Pháp mà Ta nói là để diệt trừ bất thiện, tăng trưởng thiện pháp.” Rồi Phật lại bảo Phạm chí:",
        "“Ngươi sẽ không nói rằng Phật đặt ngươi vào trong tụ bất thiện, tụ tối tăm chăng? Chớ nghĩ như vậy. Các tụ bất thiện và các tụ tối tăm, ngươi hãy loại bỏ đi. Ta vì ngươi mà nói pháp thiện tịnh.”",
        "Lại bảo Phạm chí:",
        "“Ngươi sẽ không nghĩ rằng Phật truất ngươi ra khỏi tụ thiện pháp, tụ thanh bạch chăng? Chớ nghĩ như vậy. Ngươi cứ ở trong tụ thiện pháp, tụ thanh bạch mà tinh cần tu hành. Ta vì ngươi mà nói tụ thiện tịnh, tụ thanh bạch, diệt trừ hành vi bất thiện, tăng thêm thiện pháp.”",
        "Bấy giờ năm trăm đệ tử Phạm chí đều đoan tâm chánh ý nghe Phật thuyết pháp.",
        "Thấy vậy, ma Ba-tuần nghĩ rằng: “Năm trăm đệ tử Phạm chí đang đem tâm ý đoan chính nghe theo Phật pháp có lẽ ta phải đến phá tâm ý đó đi”. Rồi ác ma liền đem sức phá hoại thiện ý của năm trăm đệ tử ấy.",
        "Phật bảo với cư sĩ Tán-đà-na:  “Năm trăm đệ tử Phạm chí này đoan tâm chánh ý nghe Ta nói pháp. Thiên ma Ba-tuần đã phá hoại ý ấy. Ta muốn trở về, ngươi hãy cùng đi với Ta.”",
        "Phật liền lấy tay mặt dẫn cư sĩ Tánđà-na đặt trong bàn tay, rồi nương hư không mà trở về.",
        "Cư sĩ Tán-đà-na, Phạm chí Ni-câu-đà và năm trăm đệ tử, sau khi nghe những điều Phật nói, hoan hỷ phụng hành."
    ]
}