{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "30. KINH THẾ KÝ - PHẨM 12 : THẾ BỔN DUYÊN",
        "Số Phẩm": "PHẦN 3",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Phật bảo Tỳ-kheo:",
        "“Sau khi qua khỏi hỏa tai, khi trời đất của thế gian này sắp sửa thành tựu trở lại, một số chúng sanh khác phước hết, hành hết, mạng hết, mạng chung ở cõi trời Quang âm thiên, sinh vào cung điện Phạm thiên trống không, rồi sinh tâm đắm nhiễm chỗ đó, yêu thích chỗ đó, nên nguyện cho chúng sanh khác cũng sinh vào nơi này. Sau khi phát sanh ý nghĩ này rồi, thì những chúng sanh khác phước hết, hành hết, mạng hết, từ cõi trời Quang âm thiên, sau khi thân hoại mạng chung, sinh vào cung điện Phạm thiên trống không. Bấy giờ, vị Phạm thiên sinh ra trước liền tự nghĩ rằng: ‘Ta là Phạm vương, là Đại Phạm thiên vương, không có ai sáng tạo ra ta, ta tự nhiên mà có, không bẩm thọ cái gì từ ai hết; ở trong một nghìn thế giới ta hoàn toàn tự tại, thông rõ các nghĩa lý, giàu có sung mãn, có khả năng tạo hóa vạn vật; ta là cha mẹ của tất cả chúng sanh.’",
        "“Các Phạm thiên sanh sau lại tự nghĩ rằng: ‘Vị Phạm thiên sanh trước kia là Phạm vương, là Đại Phạm thiên vương. Vị ấy tự nhiên mà có, không do ai có sáng tạo; là đấng tối tôn ở trong một nghìn thế giới, không bẩm thọ từ ai cái gì, thông rõ các nghĩa lýù, giàu có sung mãn, có khả năng sáng tạo vạn vật, là cha mẹ của tất cả chúng sanh. Ta từ vị ấy mà có.’",
        "“Nhan sắc dung mạo của vị Phạm thiên vương này thường như đồng tử, cho nên Phạm vương được gọi là Đồng tử",
        "“Hoặc có lúc, khi thế giới này chuyển thành trở lại, phần lớn chúng sanh có kẻ sinh về Quang âm thiên, bằng hóa sinh tự nhiên, sống bằng thức ăn là sự hoan hỉ, mình phát ra ánh sáng, có thần túc bay trong hư không, an vui không ngại, mạng sống lâu dài. Sau đó thế gian này biến thành đại hồng thủy, tràn ngập khắp nơi. Vào lúc bấy giờ thiên hạ hoàn toàn tối tăm, không có mặt trời mặt trăng, tinh tú, ngày đêm, và cũng không có năm tháng hay con số bốn mùa. Sau đó, khi thế gian này bắt đầu sắp chuyển biến, một số chúng sanh khác phước hết, hành hết, mạng hết, từ cõi Quang âm thiên sau khi mạng chung sinh đến thế gian này, bằng hóa sinh, và ăn bằng sự hoan hỷ, tự thân phát sáng, có thần túc bay trong hư không, an vui không ngại, sống lâu dài ở đây. Khi ấy, không có nam nữ, tôn ty, trên dưới, cũng không có những tên khác nhau. Các chúng cùng sinh ở thế gian này, cho nên gọi là chúng sinh.",
        "“Bấy giờ, đất này tự nhiên phát sinh ra vị đất, ngưng tụ trong đất. Cũng như đề hồ, vị đất khi xuất hiện cũng như vậy; giống như sanh tô,  vị ngọt như mật. Sau đó chúng sanh dùng tay nếm thử để biết vị ra sao. Vừa mới nếm, liền có cảm giác ngon, nên sanh ra mê đắm vị ấy. Như vậy, lần lượt nếm mãi không thôi nên sanh ra tham đắm, bèn lấy bàn tay mà vốc, dần thành thói ăn bốc. Ăn bốc mãi như thế, những chúng sanh khác thấy vậy lại bắt chước ăn, và cách ăn này không bao giờ chấm dứt. Khi ấy, những chúng sanh này thân thể trở nên thô kịch, ánh sáng mất dần, không còn có thần túc, không thể bay đi. Bấy giờ, chưa có mặt trời mặt trăng. Ánh sáng của chúng sanh biến mất. Khi ấy, trời đất hoàn toàn tối om, không khác như trước. Một thời gian lâu, rất lâu về sau, có một trận cuồng phong mạnh nổi lên thổi nước biển lớn, sâu tám vạn bốn nghìn do-tuần, khiến cho biển bị tách làm hai, mang cung điện mặt Trời đặt ở lưng núi Tu-di, an trí quỹ đạo mặt Trời, mọc ở phương Đông và lặn ở phương Tây, đi quanh khắp thiên hạ.",
        "“Nhật cung thứ hai mọc từ phương Đông, lặn phương Tây. Chúng sanh khi ấy nói: ‘Đấy là ngày hôm qua’hoặc nói: ‘Không phải ngày hôm qua.’  “Nhật cung thứ ba đi quanh núi Tudi, mọc ở phương Đông, lặn ở phương Tây. Chúng sanh khi ấy bảo rằng: ‘Nhất định là một ngày’. Ngày, có nghĩa là nhân của ánh sáng đi trước, do đó gọi là ngày. Mặt trời có hai nghĩa: một, trụ thường độ; hai, cung điện.Nhìn xa từ bốn hướng, cung điện có hình tròn. Nóng lạnh dễ chịu, được tạo thành bởi vàng của trời; được xen bằng pha lê. Hai phần là vàng trời, thuần chân không pha tạp; trong suốt từ trong ra ngoài, ánh sáng rọi xa. Một phần là pha lê, thuần chân không tạp, trong suốt từ trong ra ngoài, ánh sáng rọi xa.",
        "“Nhật cung rộng năm mươi mốt do tuần. Đất và vách tường của cung điện mỏng như bẹ lau",
        "“Tường cung có bảy lớp, với bảy lớp lan can, bảy lớp lưới, bảy lớp chuông báu, bảy lớp hàng cây, các trang trí chung quanh đều được làm bằng bảy báu. Tường bằng vàng thì cửa bằng bạc, tường bạc thì cửa vàng; tường lưu ly thì cửa thủy tinh, tường thủy tinh thì cửa lưu ly; tường ngọc đỏ thì cửa mã não, tường mã não thì cửa ngọc đỏ; tường xa cừ thì cửa bằng các thứ báu, tường bằng các thứ báu thì cửa xa cừ. Lại nữa, các lan can kia, nếu thanh ngang bằng vàng thì cọc bằng bạc, thanh ngang bạc thì cọc vàng; thanh ngang lưu ly thì cọc thủy tinh, thanh ngang thủy tinh thì cọc lưu ly; thanh ngang ngọc đỏ thì cọc mã não, thanh ngang mã não thì cọc ngọc đỏ; thanh ngang bằng các loại báu thì cọc bằng xa cừ, thanh ngang xa cừ thì cọc là các loại báu. Lưới vàng thì linh bạc, lưới bạc thì linh vàng; lưới thủy tinh thì linh lưu ly, lưới lưu ly thì linh thủy tinh; lưới ngọc đỏ thì linh mã não, lưới mã não thì linh ngọc đỏ; lưới xa cừ thì linh bằng các loại báu, lưới bằng các loại báu thì linh xa cừ. Những cây bằng vàng này thì lá, hoa quả bạc; cây bằng lưu ly thì hoa quả thủy tinh, cây thủy tinh thì hoa quả lưu ly; cây bằng ngọc đỏ thì hoa quả mã não, cây mã não thì hoa quả ngọc đỏ; cây bằng xa cừ thì hoa quả các loại báu, cây là các loại báu thì hoa quả là xa cừ. Tường của cung điện có bốn cửa, cửa của nó có bảy bực thềm, bao quanh bằng lan can; có lầu các đền đài, ao tắm, vườn rừng đều theo thứ lớp đối nhau, sanh các loại hoa báu, hàng nào hàng nấy đều xứng nhau; có nhiều loại cây ăn trái, hoa lá nhiều màu sắc, hương thơm ngạt ngào của cây cỏ lan tỏa xa khắp bốn phương, cùng các loài chim ríu rít hòa vang.",
        "“Nhật cung điện kia, được duy trì bởi năm loại gió. Một là trì phong, hai là dưỡng phong, ba là thọ phong, bốn là chuyển phong, năm là điều phong. Điện chính, nơi Nhật thiên tử ngự, hoàn toàn được xây dựng bằng vàng ròng, cao mười sáu do-tuần. Điện có bốn cửa, đều có lan can bao quanh. Tòa của Nhật thiên tử rộng nửa do-tuần, làm bằng bảy báu, trong sạch mềm mại, giống như thiên y. Nhựt thiên tử tự thân phóng ra ánh sáng chiếu điện vàng; ánh sáng điện vàng chiếu khắp nhựt cung; ánh sáng của nhựt cung lại chiếu ra khắp bốn phương thiên hạ. Tuổi thọ của Nhựt thiên tử năm trăm năm nhà trời; con cháu đều kế thừa nhau không bao giờ gián đoạn. Cung điện này không bao giờ bị hoại diệt, trong vòng thời gian là một kiếp. Khi cung điện mặt trời di chuyển, thì Nhựt thiên tử không có ý di chuyển rằng: ‘Ta đi. Ta dừng.’Mà chỉ luôn luôn hưởng thụ ngũ dục. Lúc mà cung điện mặt trời vận hành thì vô số trăm nghìn chư thiên, thiên thần đi theo dẫn đường trước, hoan hỷ không mệt mỏi, thích đi nhanh nhẹn, vì vậy Nhựt thiên tử được gọi là ‘Nhanh nhẹn.’",
        "“Thân Nhựt thiên tử phát ra nghìn tia sáng; năm trăm tia sáng chiếu xuống, và năm trăm tia sáng chiếu chung quanh, đó là vì công đức của nghiệp đời trước nên có nghìn tia sáng này. Thế nên Nhựt thiên tử còn gọi là Thiên Quang. Thế nào là công đức của nghiệp đời trước? Hoặc có một người phát tâm cúng dường Sa-môn, Bà-la-môn, cùng cứu giúp những người đói khát cùng khốn, cho họ đồ ăn thức uống, y phục, thuốc thang, voi ngựa, xe cộ, phòng xá, đèn đuốc, tùy thời ban phát, tùy theo nhu cầụ, không trái ý người, và cúng dường cho các vị Hiền Thánh trì giới. Do bởi nhân duyên vô số pháp hỷ quang minh khác nhau kia, mà thiện hoan hỷ. Như vua Quán đảnh dòng sát lợi lúc bắt đầu lên ngôi, thiện tâm hoan hỷ cũng lại như vậy. Do nhân duyên này, thân hoại mạng chung làm Nhựt thiên tử, được Nhựt cung điện, có nghìn tia sáng, cho nên nói là nghiệp lành được nghìn tia sáng.",
        "“Lại nữa, do duyên gì mà gọi là ánh sáng của nghiệp đời trước? Hoặc có người không sát sanh, không trộm cắp, không tà dâm, không hai lưỡi, không ác khẩu, không nói dối, không thêu dệt, không tham giữ, không sân nhuế, không tà kiến, vì những nhân duyên này mà tâm lành hoan hỷ. Giống như đầu ngã tư đường có hồ tắm lớn trong mát không nhơ, có người đi xa, mệt mỏi nóng khát, lại vào trong hồ nước này tắm rửa cho mát mẻ rồi cảm thấy vui mừng yêu thích; thì người thực hành mười điều lành, tâm lành vui mừng của họ lại cũng như vậy. Thân người này sau khi thân hoại mạng chung, làm Nhựt thiên tử, sống ở Nhựt cung điện, có nghìn tia sáng, vì nhân duyên này cho nên gọi là ánh sáng nghiệp lành.",
        "“Lại nữa, vì duyên gì gọi là nghìn tia sáng? Hoặc có người không sát sanh, không trộm cắp, không tà dâm, không dối, không uống rượu; do những nhân duyên này, mà thiện tâm hoan hỷ; thân hoại mạng chung, làm Nhựt thiên tử, sống ở Nhựt cung điện, có nghìn tia sáng. Do những nhân duyên như vậy nên gọi là nghìn tia sáng nghiệp lành.",
        "“Trong sáu mươi niệm khoảnh gọi là một la-da, ba mươi la-da gọi là ma-hầu-đa, trăm ma-hầu-đa gọi là ưu-ba-ma. Nhựt cung điện mỗi năm có sáu tháng đi theo hướng Nam, mỗi ngày di chuyển ba mươi dặm; cực Nam không vượt qua khỏi Diêm-phù-đề. Mặt trời di chuyển về hướng Bắc, cũng vậy.",
        "“Vì duyên gì nên ánh sánh mặt trời nóng bức? Có mười nhân duyên. Những gì là mười? Một, ngoài núi Tudi có núi Khư-đà-la cao bốn vạn hai nghìn do-tuần, rộng bốn vạn hai nghìn do-tuần, biên núi không ước lượng được; núi được tạo thành bởi bảy báu. Khi ánh sáng mặt trời chiếu đến núi, xúc chạm mà phát sinh ra nhiệt. Đây là duyên thứ nhất ánh sáng mặt trời nóng bức.",
        "“Hai, bên ngoài núi Khư-đà-la có núi Y-sa-đà cao hai vạn một nghìn do tuần, rộng cũng hai vạn một nghìn do tuần, chu vi là vô lượng, tạo thành bởi bảy báu, khi ánh sáng chiếu đến núi này, xúùc chạm mà phát sinh ra nhiệt. Đó là duyên thứ hai ánh sáng mặt trời nóng bức.",
        "“Ba, bên ngoài núi Y-sa-đà có núi Thọ-đề-đà-la, bên trên cao một vạn hai nghìn do-tuần, rộng một vạn hai nghìn do-tuần, chu vi là vô lượng, tạo thành bởi bảy báu. Khi ánh sáng mặt trời chiếu đến núi này, xúc chạm mà phát sinh ra nhiệt. Đó là duyên thứ ba ánh sáng mặt trời nóng bức.",
        "“Bốn, ở ngoài cách núi Thọ-đề-đa-la không xa có núi gọi là Thiện kiến, cao sáu nghìn do-tuần, rộng sáu nghìn do-tuần, chu vi là vô lượng, núi được hình thành bởi bảy báu, khi ánh sáng mặt trời chiếu đến sẽ phát sinh ra nhiệt, đó là duyên thứ tư để ánh sáng mặt trời nóng bức.",
        "“Năm, ở ngoài núi Thiện kiến có núi Mã tự cao ba nghìn do-tuần, ngang rộng cũng ba nghìn do-tuần, chu vi là vô lượng, núi được hình thành bởi bảy báu, khi ánh sáng mặt trời chiếu đến sẽ phát sinh ra nhiệt, đó là duyên thứ năm để ánh sáng mặt trời nóng bức. “Sáu, ở ngoài cách núi Mã tự không xa có núi Ni-di-đà-la, cao một nghìn hai trăm do-tuần, rộng một nghìn hai trăm do-tuần, chu vi thì vô lượng, núi được hình thành bởi bảy báu, khi ánh sáng mặt trời chiếu đến sẽ phát sinh ra nhiệt, đó là duyên thứ sáu để ánh sáng mặt trời nóng bức.",
        "“Bảy, ở ngoài cách núi Ni-di-đà-la không xa có núi Điều phục, cao sáu trăm do-tuần, rộng cũng sáu trăm do tuần, chu vi thì vô lượng, núi được hình thành bởi bảy báu, khi áng sáng mặt trời chiếu đến sẽ phát sinh ra nhiệt. Đó là duyên thứ bảy để ánh sáng mặt trời nóng bức.",
        "“Tám, ở ngoài núi Điều phục có núi Kim cương luân, cao ba trăm do tuần, rộng ba trăm do-tuần, chu vi thì vô lượng, tạo thành bởi bảy báu, khi ánh sáng mặt trời chiếu đến sẽ phát ra nhiệt. Đó là duyên thứ tám để ánh sáng mặt trời nóng bức.",
        "“Lại nữa, bên trên một vạn do-tuần có cung điện Trời gọi là Tinh tú, tạo thành bởi lưu ly. Khi ánh sáng mặt trời chiếu vào nó, xúc chạm mà phát sinh ra nhiệt. Đó là duyên thứ chín để ánh sáng mặt trời nóng bức.",
        "“Lại nữa, ánh sáng cung điện mặt trời chiếu xuống đại địa, xúc chạm mà phát sinh ra nhiệt.",
        "“Đó là muời duyên thứ mười làm cho ánh sáng mặt trời nóng bức.”",
        "Bấy giờ, Thế Tôn nói bài tụng:",
        "Do mười nhân duyên này,  Mặt trời gọi Thiên quang;  Ánh sáng phát nóng bức:",
        "Được nói mặt trời Phật.",
        "Phật bảo Tỳ-kheo:",
        "“Tại sao cung điện mặt trời mùa đông thì lạnh để không thể ở gần được? Có ánh sáng mà sao lạnh? Có mười ba duyên, tuy có ánh sáng nhưng vẫn lạnh, Những gì là mười ba?",
        "“Một, vì giữa hai núi Tu-di và Khưđà-la có nước, rộng tám vạn bốn nghìn do-tuần, chu vi thì vô lượng. Nước này sinh ra rất nhiều loại hoa khác nhau như: hoa ưu-bát-la, hoa câu-vật-đầu, hoa bát-đầu-ma, hoa phân-đà-lợi, hoa tu-kiền-đề; khi ánh sáng mặt trời chiếu xuống, xúc chạm mà sinh ra lạnh. Đó là duyên thứ nhất để ánh sáng mặt trời lạnh.",
        "“Hai, khoảng cách giữa hai núi Khưđà-la và Y-sa-đà-la có nước, rộng bốn vạn hai nghìn do-tuần, dọc ngang bốn vạn hai nghìn do-tuần, chu vi thì vô lượng. Nước này sinh ra các loài hoa khác nhau. Khi ánh sáng chiếu đến, xúc chạm mà sinh ra lạnh. Đó là duyên thứ hai để ánh sáng mặt trời lạnh. “Ba, giữa hai núi Y-sa-đà-la và Thọđề-đà-la có nước, rộng hai vạn một nghìn do-tuần, chu vi thì vô lượng, sinh ra các loài hoa khác nhau. Khi ánh sáng mặt trời chiếu xuống, xúc chạm mà sinh ra lạnh. Đó là duyên thứ ba ánh sáng mặt trời lạnh.",
        "“Bốn, giữa hai núi Thiện kiến và núi",
        "Thọ-đề có nước, rộng hai ngàn do-tuần, chu vi thì vô lượng, nơi này có nước, sinh ra các loài hoa khác nhau; khi ánh sáng mặt trời chiếu xuống thì sinh ra lạnh, đó là duyên thứ tư để ánh sáng mặt trời lạnh.",
        "“Năm, giữa hai núi Thiện kiến và núi Mã tự có nước, rộng sáu nghìn do-tuần, sinh ra các loài hoa khác nhau; khi ánh sáng mặt trời chiếu xuống thì sinh ra lạnh, đó là duyên thứ năm để ánh sáng mặt trời lạnh.",
        "“Sáu, giữa hai núi Mã tự và núi Nidi-đà-la có nước, rộng một nghìn hai trăm do-tuần, chu vi thì vô lượng, sinh ra các loài hoa khác nhau; khi ánh sáng mặt trời chiếu xuống thì sinh ra lạnh, đó là duyên thứ sáu để ánh sáng mặt trời lạnh.",
        "“Bảy, giữa hai núi Ni-di-đà-la và núi Điều phục rộng sáu trăm do-tuần, chu vi thì vô lượng, sinh ra các loài hoa khác nhau; khi ánh sáng mặt trời chiếu xuống thì sinh ra lạnh, đó là duyên thứ bảy để sinh ra ánh sáng mặt trời lạnh.",
        "“Tám, giữa hai núi Điều phục và núi Kim cương luân có nước, rộng ba trăm do-tuần, chu vi thì vô lượng, sinh ra các loài hoa khác nhau; khi ánh sáng mặt trời chiếu xuống thì sinh ra lạnh, đó là duyên thứ tám để ánh sáng mặt trời lạnh.",
        "“Lại nữa, giữa núi Kim cang luân và đất Diêm-phù-đề có nước, khi ánh sáng mặt trời chiếu xuống một lần chạm nhau thì sinh ra lạnh, đó là duyên thứ chín để ánh sáng mặt trời lạnh.",
        "“Đất Diêm-phù-đề có sông ít, đất Câu-da-ni có nước nhiều. Khi ánh sáng mặt trời chiếu xuống, xúc chạm mà sinh ra lạnh. Đó là duyên thứ mười để ánh sáng mặt trời lạnh.",
        "“Sông ngòi của cõi Câu-da-ni thì ít, nước của cõi Phất-vu-đãi thì nhiều; khi ánh sáng mặt trời chiếu xuống, xúc chạm mà sinh ra lạnh. Đó là duyên thứ mười một để ánh sáng mặt trời lạnh. “Sông ngòi của Phất-vu-đãi thì ít, sông ngòi của Uất-đơn-viết thì nhiều; khi ánh sáng mặt trời chiếu xuống, xúc chạm nhau thì sinh ra lạnh, đó là duyên thứ mười hai để ánh sáng mặt trời lạnh.",
        "“Lại nữa, ánh sáng của cung điện mặt Trời chiếu xuống nước của biển cả, thì khi ánh sáng mặt trời chiếu, xúc chạm mà sinh ra lạnh, đó là duyên thứ mười ba để ánh sáng mặt trời lạnh.” Bấy giờ, Phật nói bài tụng:",
        "Do mười ba duyên này.",
        "Mặt trời gọi Thiên quang  Ánh sáng này lạnh trong:  Được nói Mặt Trời Phật.",
        "Phật bảo Tỳ-kheo:",
        "“Cung điện mặt Trăng, chất tròn khi đầy khi vơi, ánh sáng sút giảm, cho nên nguyệt cung được gọi là tổn",
        "Mặt trăng có hai nghĩa: một là trụ thường độ, hai gọi là cung điện. Do từ bốn phương xa mà nhìn, thấy là tròn. Lạnh ấm điều hòa, được tạo thành bởi bạc trời và lưu ly. Hai phần là thuần bạc trời ròng không pha tạp, trong suốt trong ngoài, ánh sánh chiếu xa; một phần bằng lưu ly ròng không pha tạp, trong suốt trong ngoài, ánh sáng chiếu xa. Cung điện mặt trăng, rộng bốn mươi chín do-tuần, tường cung điện cùng đất mỏng như tử bách. Tường cung điện có bảy lớp, với bảy lớp lan can, bảy lớp lưới, bảy lớp linh báu, bảy lớp hàng cây, trang sức chung quanh bằng bảy báu,… cho đến, vô số các loài chim ríu rít hòa vang.",
        "“Cung điện mặt trăng này được năm thứ gió giữ gìn: một là trì phong, hai là dưỡng phong, ba là thụ phong, bốn là chuyển phong, năm là điều phong. Chánh điện, nơi ngự của Nguyệt thiên tử, làm bằng lưu ly, cao mười sáu do tuần. Điện có bốn cửa, chung quanh là lan can. Tòa của Nguyệt thiên tử, rộng nửa do-tuần, được làm thành bởi bảy báu, trong sạch và mềm mại, giống như thiên y. Thiên tử mặt trăng trên thân phóng ra ánh sáng, chiếu soi điệân lưu ly; ánh sáng của điện lưu ly chiếu soi cung điện mặt trăng, và ánh sáng cung điện mặt trăng chiếu soi bốn cõi thiên hạ. Tuổi thọ của thiên tử mặt trăng là năm trăm năm, con cháu thừa kế nhau không hề khác. Cung điện này không bị hủy hoại trong vòng một kiếp. Lúc cung điện mặt trăng di chuyển, thiên tử của mặt trăng này không có ý niệm di chuyển, rằng: ‘Ta đi. Ta dừng.’ Mà chỉ luôn luôn hưởng thụ ngũ dục. Khi cung điện mặt trăng di chuyển, thì có vô số trăm nghìn các Đại thiên thần, thường ở trước dẫn đường, hoan hỷ không mệt mỏi, ưa thích nhanh nhẹn, vì vậy nên Nguyệt thiên tử được gọi là ‘nhanh nhẹn ’",
        "“Thân Nguyệt thiên tử phát ra nghìn tia sáng, năm trăm tia sáng chiếu xuống, và năm trăm tia sáng chiếu hai bên. Đó là do công đức của nghiệp đời trước nên có ánh sáng này, thế nên Nguyệt thiên tử còn gọi là Thiên quang . Thế nào là công đức nghiệp đời trước? Thế gian có một người phát tâm cúng dường Sa-môn, Bà-la-môn, cùng bố thí cho những người đói khát cùng cực, cho họ đồ ăn thức uống, y phục, thuốc thang, voi ngựa, xe cộ, phòng xá, đèn đuốc, tùy thời ban phát, tùy theo nhu cầu, mà không trái ý người, và cúng dường cho các vị Hiền Thánh trì giới. Do vô số pháp hỷ khác nhau ấy, thiện tâm quang minh. Như vị vua Quán đảnh dòng Sát lợi, khi mới đang vương vị, thiện tâm hoan hỷ, cũng lại như vậy. Vì nhân duyên này, nên thân hoại mạng chung làm Nguyệt thiên tử, cung điện mắt trăng có nghìn tia sáng, cho nên nói là nghiệp lành được nghìn tia sáng.",
        "“Lại nữa, do nghiệp gì được nghìn ánh sáng? Thế gian có người không sát sanh, không trộm cắp, không tà dâm, không hai lưỡi, không ác khẩu, không nói dối, không thêu dệt, không tham giữ, không sân nhuế, không tà kiến; do những nhân duyên này mà thiện tâm hoan hỷ. Giống như đầu ngã tư đường có hồ tắm lớn trong mát không nhơ, có người đi xa, mệt mỏi nóng khát, vào trong hồ nước này, tắm rửa mát mẻ, hoan hỷ khoái lạc; người thực hành mười điều lành, thiện tâm hoan hỷ, lại cũng như vậy. Người này sau khi thân hoại mạng chung, sẽ làm Nguyệt thiên tử, sống ở cung điện mặt trăng, có nghìn tia sáng. Do nhân duyên này cho nên gọi là nghìn ánh sáng nghiệp lành. “Lại nữa, do duyên gì được nghìn tia sáng? Thế gian có người không sát sanh, không trộm cắp, không tà dâm, không lừa dối, không uống rượu, vì những nhân duyên này, thiện tâm hoan hỷ; thân hoại mạng chung, làm Nguyệt thiên tử, sống ở cung điện mặt trăng, có nghìn tia sáng. Do những nhân duyên như vậy nên gọi là nghìn tia sáng nghiệp lành.",
        "“Trong sáu mươi niệm khoảnh gọi là một la-da, ba mươi la-da gọi là mahầu-đa, trăm ma-hầu đa gọi là ưu-bàma. Nếu cung điện mặt trời mỗi năm có sáu tháng đi về phía Nam, mỗi ngày di chuyển ba mươi dặm, cực Nam không vượt qua khỏi Diêm-phù-đề; thời gian ấy, cung điện mặt Trăng nửa năm đi về phía nam, không vượt qua khỏi Diêm-phù-đề. Nguyệt Bắc hành cũng như vậy.",
        "“Vì duyên gì mà cung điện mặt trăng khuyết giảm mỗi khi một ít? Có ba nhân duyên nên cung điện mặt trăng khuyết giảm mỗi khi một ít: Một, mặt trăng phát xuất từ phương góc, là duyên thứ nhất để mặt trăng tổn giảm. Lại nữa, trong cung điện mặt trăng có các đại thần đều mặc y phục màu xanh, theo thứ tự mà lên, trú xứ cũng trở thành xanh, cho nên mặt trăng bị tổn giảm; đó là duyên thứ hai để mặt trăng mỗi ngày mỗi giảm. Lại nữa, cung điện mặt trời có sáu mươi tia sáng, tia sáng này chiếu vào cung điện mặt trăng, ánh chiếu khiến cho không hiện, do đó nơi có ánh chiếu, nơi ấy của mặt trăng bị tổn giảm; đó là duyên thứ ba để ánh sáng mặt trăng tổn giảm.",
        "“Lại nữa, vì duyên gì mà ánh sáng cung điện mặt trăng đầy dần? Có ba nhân duyên khiến cho ánh sáng mặt trăng đầy dần. Những gì là ba? Một, mặt trăng hướng về phương vị chánh cho nên ánh sáng mặt trăng đầy. Hai, các thần cung điện mặt trăng hết thảy đều mặt y phục màu xanh, và Thiên tử mặt Trăng vào ngày rằm ngồi vào giữa, cùng nhau hưởng lạc, ánh sáng chiếu khắp, lấn át ánh sáng chư thiên, nên ánh sáng đầy khắp. Giống như bó đuốc lớn được đốt lên trong đám đèn đuốc, sẽ át hẳn ánh sáng các ngọn đèn. Thiên tử mặt trăng cũng lại như vậy. Vào ngày rằm, ở giữa chúng chư thiên, át hẳn tất cả các ánh sáng khác, chỉ có ánh sáng của ông độc chiếu, cũng như vậy. Đó là duyên thứ hai. Ba, Thiên tử mặt trời tuy đã có sáu mươi tia sáng chiếu soi cung điện mặt trăng, nhưng trong vào ngày rằm, thiên tử mặt trăng cũng có thể dùng ánh sáng chiếu nghịch lại, khiến cho nó không thể che khuất được. Đó là ba nhân duyên cho cung điện mặt trăng tròn đầy mà không bị tổn giảm.",
        "“Lại nữa vì duyên gì mà mặt trăng có bóng đen? Vì cái bóng cây Diêm phù in vào trong mặt trăng, nên mặt trăng có bóng.”",
        "Phật bảo Tỳ-kheo:",
        "“Tâm hãy như mặt trăng, trong mát không nóng bức, khi đến nhà đàn-việt, chuyên niệm không tán loạn. “Lại vì duyên gì mà có các sông ngòi? Vì mặt trời mặt trăng có độ nóng. Do độ nóng này mà có nung đốt. Do có nung đốt nên có mồ hôi. Do mồ hôi mà thành sông ngòi. Do đó thế gian có sông ngòi.",
        "“Vì nhân duyên gì mà thế gian có năm loại hạt giống? Có cuồng phong dữ từ thế giới chưa bị hủy diệt thổi hạt giống đến sanh ở quốc độ này. Một là hạt từ rễ; hai, hạt từ cọng; ba, hạt từ đốt; bốn, hạt từ ruột rỗng; năm, hạt từ hạt. Đó là năm loại hạt. Vì nhân duyên này mà thế gian có năm loại hạt giống xuất hiện.",
        "“Lúc ở Diêm-phù-đề đang là giữa trưa thì ở Phất-vu-đãi mặt trời lặn. Ởû Câu-da-ni mặt trời mọc, ở Uất-đơn-viết là nửa đêm. Câu-da-ni giữa trưa thì ở Diêm-phù-đề mặt trời lặn. Uất đơn viết mặt trời mọc, ở Phất vu đãi là nửa đêm; ở Uất đơn viết giữa trưa thì ở Câu da ni mặt trời lặn; ở Phất vu đãi mặt trời mọc, thì Diêm-phù-đề là nửa đêm. Nếu ở Phất vu đệ là giữa trưa, thì ở Uất đơn viết mặt trời lặn; ở Diêm-phù-đề mặt trời mọc, thì ở Câu da ni là nửa đêm. Phương Đông của Diêm-phù-đề, thì là phương Tây ở Phất-vu-đãi; phương Tây của Diêm-phù-đề là phương Đông của Câu-da-ni; phương Tây của Câu da ni là phương Đông của Uất-đơn-viết; phương Tây của Uất-đơn-viết là phương Đông của Phất-vu-đãi.",
        "“Diêm-phù-đề, sở dĩ được gọi là Diêm-phù vì ở dưới có núi vàng cao ba mươi do-tuần, do cây Diêm phù sanh ra nên được gọi là vàng Diêm-phù . Cây Diêm-phù có trái của nó như tai nấm, vị của nó như mật; cây có năm góc lớn, bốn mặt bốn góc, ở trên có một góc. Những trái ở bên góc phía Đông của nó được Càn-thát-bà ăn. Trái ở góc phía Nam của nó được người bảy nước ăn. Bảy nước là: một, nước Câu-lâu; hai, Câu-la-ba; ba, Tỳ-đề; bốn, Thiện-tỳ-đề; năm, Mạn-đà; sáu, Bà-la; bảy, Bà-lị. Trái ở góc phía Tây được hải trùng ăn. Trái ở góc phía Bắc được cầm thú ăn. Trái ở phía góc trên được Tinh tú thiên ăn.Phía Bắc của bảy nước lớn có bảy hòn núi đen lớn, một là Lõa thổ, hai là Bạch hạc, ba là Thủ cung, bốn là Tiên sơn, năm là Cao sơn, sáu là Thiền sơn, bảy là Thổ sơn. Trên mặt của bảy núi đen này có bảy vị Tiên nhơn Bà-la-môn. Trú xứ của bảy Tiên nhơn này, một là Thiện đế, hai là Thiện quang, ba là Thủ cung, bốn là Tiên nhơn, năm là Hộ cung, sáu là Già-na-na, bảy là Tăng ích.”",
        "Phật bảo Tỳ-kheo:",
        "“Khi kiếp sơ, chúng sanh sau khi nếm vị đất, rồi tồn tại một thời gian lâu dài. Những ai ăn nhiều, nhan sắc trở nên thô kịch, khô héo. Những ai ăn ít, nhan sắc tươi sáng, mịn màng. Từ đó về sau mới phân biệt nhan sắc tướng mạo của chúng sanh có hơn có kém, và sinh ra thị phi với nhau, nói rằng: ‘Ta hơn ngươi; ngươi không bằng ta.’ Do tâm của chúng phân biệt kia và ta, ôm lòng cạnh tranh, cho nên vị đất tiêu hết. Sau đó sinh ra một loại da đất, hình dáng giốâng như cái bánh mỏng; màu sắc, hương vị của nó rất là thanh khiết. Bấy giờ chúng sanh tụ tập lại một chỗ, tất cả đều ảo não buồn khóc, đấm ngực mà nói: ‘Ối chao là tai họa! Vị đất nay bỗng biến mất.’ Giống như hiện nay người được đầy ắp vị ngon, bảo là ngon lành, nhưng sau đó lại bị mất đi nên lấy làm buồn lo. Kia cũng như vậy buồn lo hối tiếc. Sau đó, chúng ăn lớp da đất, dần quen cái vị của nó. Những ai ăn nhiều thì nhan sắc trở thành thô kịch khô héo. Những ai ăn ít thì nhan sắc tươi sáng mịn màng. Từ đó mới phân biệt nhan sắc tướng mạo của chúng sanh có xấu có đẹp, và sinh chuyện thị phi với nhau, nói rằng: ‘Ta hơn ngươi. Ngươi không bằng ta.’ Do tâm chúng phân biệt kia và ta, ôm lòng cạnh tranh, nên nấm đất cạn tiêu hết.",
        "“Sau đó lại xuất hiện một loại da ngoài của đất, càng lúc càng dày thêm, màu của nó như thiên hoa, mềm mại của nó như thiên y, vị của nó như mật. Bấy giờ, các chúng sanh lại lấy nó cùng ăn, sống lâu ngày ở thế gian. Những ai càng ăn nhiều thì nhan sắc càng sút kém. Những ai ăn ít thì nhan sắc tươi sáng mịn màng. Từ đó phân biệt nhan sắc tướng mạo của chúng sanh có xấu có đẹp, và do thế mà sinh chuyện thị phi với nhau rằng: ‘Ta hơn ngươi. Ngươi không bằng ta.’ Vì tâm chúng phân biệt ta và người, sinh lòng cạnh tranh, nên lớp da ngoài của đất tiêu hết.",
        "“Sau đó, lại xuất hiện loại lúa tẻ mọc tự nhiên, không có vỏ trấu, không cần phải gia thêm chế biến mà chúng đã đầy đủ các thứ mỹ vị. Bấy giờ, chúng sanh tụ tập nhau lại nói: ‘Ối chao là tai họa! Nay màng đất bỗng nhiên biến mất.’ Giống như hiện tại người gặp họa gặp nạn thì than rằng: ‘Khổ thay!’ Bấy giờ chúng sanh ảo não, buồn than, cũng lại như vậy.",
        "“Sau đó, chúng sanh cùng nhau lấy lúa tẻ tự nhiên này ăn, và thân thể chúng, trở nên thô xấu, có hình dáng nam nữ, nhìn ngắm nhau, sinh ra dục tưởng; họ cùng nhau tìm nơi vắng làm hành vi bất tịnh, các chúng sanh khác thấy than rằng: ‘Ôi, việc làm này quấy! Tại sao chúng sanh cùng nhau sinh ra chuyện này?’ Người nam làm việc bất tịnh kia, khi bị người khác quở trách, tự hối hận mà nói rằng: ‘Tôi đã làm quấy.’Rồi nó gieo mình xuống đất. Người nữ kia thấy người nam này vì hối lỗi mà gieo mình xuống đất, không đứng lên, liền đưa thức ăn đến. Chúng sanh khác thấy vậy, hỏi người nữ rằng: ‘Ngươi đem thức ăn này để cho ai?’ Đáp: ‘Chúng sanh hối lỗi kia đọa lạc thành kẻ làm điều bất thiện, tôi đưa thức ăn cho nó.’ Nhân lời nói này, nên thế gian liền có danh từ ‘người chồng bất thiện’,và vì việc đưa cơm cho chồng nên được gọi là vợ",
        "“Sau đó, chúng sanh bèn làm chuyện dâm dật, pháp bất thiện tăng. Để tự che dấu, chúng tạo ra nhà cửa. Do vì nhân duyên này, bắt đầu có danh từ ‘nhà.’",
        "“Sau đó, sự dâm dật của chúng sanh càng ngày càng tăng, nhân đây đã trở thành chồng vợ. Có các chúng sanh khác, khi tuổi thọ hết, hành hết, phước hết, từ cõi trời Quang âm sau khi mạng chung lại sinh vào thế gian này, ở trong thai mẹ, nhân đây thế gian có danh từ ‘mang thai.’",
        "“Bấy giờ, trước tiên tạo thành Chiêm-bà, kế đến tạo thành Già-thi, Ba-la-nại, và tiếp theo là thành Vương xá. Lúc mặt trời mọc thì bắt đầu kiến tạo, tức thì lúc mặt trời mọc hoàn thành. Do nhân duyên này nên thế gian liền có tên thành, quách, quận, ấp, là chỗ nhà vua cai trị.",
        "“Bấy giờ, khi chúng sanh bắt đầu ăn lúa tẻ mọc tự nhiên, sáng sớm gặt thì chiều tối lại chín, chiều tối gặt thì sáng sớm lại chín. Sau khi được gặt, lúa sinh trở lại, hoàn toàn không có thân cuống lúa.",
        "“Rồi thì, có chúng sanh thầm nghĩ rằng: ‘Sao ta mỗi ngày mỗi gặt chi cho mệt nhọc? Nay hãy gom lấy đủ cho nhiều ngày.’ Nó bèn gặêt gộp lại, chứa số lương đủ cho nhiều ngày. Người khác sau đó gọi nó: ‘Nay chúng ta hãy cùng đi lấy lúa.’ Người này bèn trả lời: ‘Tôi đã chứa đủ sẵn rồi, không cần lấy thêm nữa. Anh muốn lấy, cứ tùy ý đi lấy một mình.’ Người kia bèn nghĩ thầm: ‘Gã này có thể lấy đủ lương cho hai ngày, sao ta không thể lấy đủ cho ba ngày?’ Người ấy bèn chứa dư ba ngày lương. Lại có những người khác gọi nó: ‘Hãy cùng đi lấy lương.’ Nó liền đáp: ‘Ta đã lấy dư ba ngày lương rồi. Các người muốn lấy, tùy ý đi mà lấy.’ Các người kia bèn nghĩ: ‘Người kia có thể lấy ba ngày lương, sao ta không thể lấy năm ngày lương?’ Rồi chúng lấy năm ngày lương. Bấy giờ, chúng sanh tranh nhau cất chứa lương dư, nên lúa tẻ ấy bèn sanh ra vỏ trấu; sau khi được gặt, không mọc trở lại nữa; chỉ còn trơ cọng khô mà thôi.",
        "“Bấy giờ chúng sanh tụ tập lại một chỗ, ảo não buồn khóc, đấm ngực than: ‘Ôi, đây là một tai họa!’ và tự thương trách rằng: ‘Chúng ta vốn đều do biến hóa mà sinh, ăn bằng niệm, tự thân phát ánh sáng, có thần túc bay trên không, an vui không ngại. Sau đó vị đất bắt đầu sinh ra, sắc vị đầy đủ. Khi ấy chúng ta nếm thử vị đất này, rồi tồn tại lâu trong đời này. Những ai ăn nhiều thì nhan sắc trở thành thô xấu.",
        "Những ai ăn nó ít thì nhan sắc tươi sáng, mịn màng; từ đó tâm chúng sanh có phân biệt ta và người, sinh tâm kiêu mạn, bảo rằng: ‘Sắc ta hơn. Sắc ngươi không bằng.’ Do kiêu mạn, tranh nhau sắc, nên vị đất tiêu diệt. Lại sanh ra lớp da đất, có đầy đủ sắc hương vị. Chúng ta lúc ấy cùng thu lấy để ăn, tồn tại lâu dài ở thế gian. Những ai ăn nhiều thì da sắc trở thành thô xấu. Những ai ăn ít đi thì da sắc tươi sáng mịn màng, từ đó có phân biệt ta và người, sinh tâm kiêu mạn bảo rằng: ‘Sắc ta hơn, sắc ngươi không bằng.’ Vì tranh nhau về sắc mà kiêu mạn nên lớp da đất biến mất, và xuất hiện lớp da ngoài của đất, càng lúc càng dày lên, đủ cả sắc, hương, mùi vị. Chúng ta khi ấy lại cùng nhau thu lấy ăn, tồn tại dài ở thế gian. Những ai ăn nhiều thì sắc da trở thành thô xấu. Những ai ăn ít thì sắc da tươi sáng mịn màng, từ đó có phân biệt ta và người, sinh tâm kiêu mạn bảo rằng: ‘Sắc ta hơn, sắc ngươi không bằng.’ Vì sắc tranh nhau mà kiêu mạn, nên lớp da ngoài của đất biến mất, để rồi sinh ra loại lúa tẻ mọc tự nhiên, đầy đủ sắc, hương, vị. Chúng ta lúc ấy lại cùng nhau thu lấy ăn, sớm mai thu hoạch buổi chiều lại chín, buổi chiều thu hoạch sáng mai lại chín, vì thu hoạch xong thì sinh trở lại nên không cần phải gom thu. Nhưng vì chúng ta lúc này tranh nhau tích lũy, nên lúa này sinh ra vỏ trấu, và sau khi thu gặt xong không sinh trở lại nữa, mà hiện tại chỉ còn có rễ và thân mà thôi. Nay chúng ta hãy cùng nhau phân phối ruộng nhà, phân chia bờ cõi.’",
        "“Rồi chúng phân chia ruộng đất, vạch bờ cõi khác nhau, phân biệt của người và của ta. Sau đó mọi người tự cất dấu lúa thóc của mình, trộm lấy lúa ruộng người khác. Các chúng sanh khác trông thấy, nên nói: ‘Việc ngươi làm là quấy! Việc ngươi làm là quấy! Tại sao cất dấu vật của chính mình, mà đi trộm tài vật của người?’ liền quở trách rằng: ‘Từ nay về sau không được tái phạm việc trộm cắp nữa!’ Nhưng những việc trộm cắp như vậy vẫn tái phạm không dứt, mọi người lại phải quở trách: ‘Việc ngươi làm sai quấy! Tại sao không chịu bỏ?’ Bèn lấy tay mà đánh, lôi đến giữa đám đông, báo cáo cùng mọi người rằng: ‘Người này tự cất dấu thóc lúa, đi trộm lúa ruộng của người.’ Người ăn trộm nói lại: ‘Người kia đã đánh tôi.’ Mọi người nghe xong, ấm ức rơi lệ, đấm ngực nói rằng: ‘Thế gian trở nên xấu ác, nên đã sinh ra pháp ác này chăng?’ Nhân đấây mà sinh ra ưu kết nhiệt não khổ báo; Rằng: ‘Đây là cội nguồn của của sinh, già, bệnh, chết; là nguyên nhân rơi vào đường ác. Do có ruộng nhà, bờ cõi riêng khác, nên sinh ra tranh dành kiện tụng, đưa đến oán thù, không ai có thể giải quyết. Nay chúng ta hãy lập lên một người chủ bình đẳng , để khéo léo giữ gìn nhơn dân, thưởng thiện phạt ác. Mọi người trong chúng ta đều cùng nhau giảm bớt phần của mình để cung cấp cho người chủ này.’",
        "“Lúc đó, trong chúng có một người hình thể vạm vỡ, dung mạo đoan chánh, rất có oai đức. Mọi người bảo rằng: ‘Nay, chúng tôi muốn tôn bạn lên làm chủ, để khéo léo giữ gìn nhơn dân, thưởng thiện phạt ác. Chúng tôi sẽ giảm bớt phần của mình mà cung cấp.’ Người này nghe xong, liền nhận làm chủ. Ai đáng thưởng thì thưởng; ai đáng phạt thì phạt. Từ đây mới bắt đầu có danh từ dân chủ. Dân chủ ban đầu có con tên là Trân Bảo .Trân Bảo có con tên là Hảo Vị; Hảo Vị có con tên là Tĩnh Trai; Tĩnh Trai có con tên là Đảnh Sanh; Đảnh Sanh có con tên là Thiện Hành; Thiện Hành có con tên là Trạch Hành; Trạch Hành có con tên là Diệu Vị; Diệu Vị có con tên là Vị Đế; Vị Đế có con tên là Thủy Tiên; Thủy Tiên có con tên là Bách Trí; Bách Trí có con tên là Thị Dục; Thị Dục có con tên là Thiện Dục; Thiện Dục có con tên là Đoạn Kết; Đoạn Kết có con tên là Đại Đoạn Kết; Đại Đoạn Kết có con tên là Bảo Tạng; Bảo Tạng có con tên là Đại Bảo Tạng; Đại Bảo Tạng có con tên là Thiện Kiến; Thiện Kiến có con tên là Đại Thiện Kiến; Đại Thiện Kiến có con tên là Vô Ưu; Vô Ưu có con tên là Châu Chử; Châu Chử có con tên là Thực Sanh; Thực Sanh có con tên là Sơn Nhạc; Sơn Nhạc có con tên là Thần Thiên; Thần Thiên có con tên là Khiển Lực; Khiển Lực có con tên là Lao Xa; Lao Xa có con tên là Thập Xa; Thập Xa có con tên là Bách Xa; Bách Xa có con tên là Lao Cung; Lao Cung có con tên là Bách Cung; Bách Cung có con tên là Dưỡng Mục; Dưỡng Mục có con tên là Thiện Tư.",
        "“Từ Thiện Tư trở về sau có mười họ, Chuyển luân Thánh vương nối tiếp nhau không dứt: Một tên là Già-nậâuthô, hai tên là Đa-la-bà, ba tên là Adiệp-ma, bốn tên là Trì-thí, năm tên là Già-lăng-già, sáu tên là Chiêm-bà, bảy tên là Câu-la-bà, tám tên là Bác-đồ-la, chín tên là Di-tư-la, mười tên là Thanh Ma.",
        "“Giòng Vua Già-nậâu-thô có năm vị Chuyển luân Thánh vương. Giòng vua Đa-la-bà có năm vị Chuyển luân Thánh vương. Giòng vua A-diếp-ma có bảy vị Chuyển luân Thánh vương. Giòng vua Trì-thí có bảy vị vua Chuyển luân Thánh vương. Giòng vua Già-lăng-già có chín vị vua Chuyển luân Thánh vương. Giòng vua Chiêm-bà có mười bốn vị Chuyển luân Thánh vương. Giòng vua Câu-la-bà có ba mươi mốt vị Chuyển luân Thánh vương. Giòng vua Bát-xà-la có ba mươi-hai vị Chuyển luân Thánh vương. Giòng vua Di-tư-la có tám vạn bốn nghìn vị Chuyển luân Thánh vương. Giòng vua Thanh Ma có một trăm lẻ một vị Chuyển luân Thánh vương. Và vị vua cuối cùng có tên là Đại Thiện Sanh Tùng.",
        "“Vua Thanh Ma của giòng thứ mười có vương tử tên là Ô-la-bà. Vua Ô-la-bà có vương tử tên là Cừ-la-bà. Vua Cừ-la-bà có vương tử tên là Nicầu-la. Vua Ni-cầu-la có vương tử tên là Sư Tử Giáp. Vua Sư tử Giáp có vương tử tên là Bạch Tịnh vương . Vua Bạch Tịnh vương có vương tử tên là Bồ-tát. Bồ-tát có con tên là Lahầu-la. Do bản duyên này mà có tên gọi Sát-lỵ",
        "“Bấy giờ, có một chúng sanh suy nghĩ như vầy: ‘Tất cả mọi sở hữu như gia đình, quyến thuộc, muôn vật ở thế gian đều là gai nhọn, ung nhọt, nay nên lìa bỏ, vào núi hành đạo, ở nơi vắng vẻ mà tư duy.’ Rồi thì, người liền lìa bỏ gai nhọn là gia đình, vào núi, ở nơi vắng vẻ, ngồi dưới gốc cây mà tư duy, hằng ngày ra khỏi núi, vào thôn xóm mà khất thực. Mọi người trong thôn thấy vậy, càng cung kính cúng dường. Mọi người đều cùng khen ngợi rằng: ‘Người này có thể lìa bỏ hệ lụy của gia đình để vào núi tìm đạo.’ Vì người này có thể xa lìa được pháp ác bất thiện, nên nhân đó mà gọi là Bà-la-môn. “Trong chúng Bà-la-môn có người không hành Thiền được, nên ra khỏi rừng núi, du hành trong nhơn gian, và tự nói: ‘Ta không thể tọa thiền.’ Nhân đó gọi là Vô Thiền Bà-la-môn. Rồi đi qua các thôn xóm, nó làm pháp bất thiện, thi hành pháp độc, nhân đó tương sinh, nên được gọi đó là độc.",
        "Do nhân duyên này mà có chủng tánh Bà-la-môn ở thế gian.",
        "“Trong chúng sanh kia, chúng học tập các thứ nghề để tự mưu sống, nhân đây nên có chủng tánh cư sĩ ở thế gian.",
        "“Trong chúng sanh kia, chúng học tập các kỹ nghệ để tự nuôi sống, nhân đây mới có chủng tánh thủ-đà-la ở thế gian.",
        "“Trước đó trong thế gian đã có giòng họ Thích này xuất hiện rồi, sau đó mới có giòng Sa-môn. Trong giòng Sát-lợi có người tự tư duy: ‘Thế gian ân ái là ô uế, bất tịnh, đáng gì mà tham đắm?’ Rồi người ấy lìa bỏ gia đình, cạo bỏ râu tóc, mặc pháp phục mà cầu đạo và nói: ‘Ta là Sa-môn! Ta là Sa-môn!’ “Trong chủng tánh Bà-la-môn, chủng tánh cư sĩ, chủng tánh thủ-đà-la, có người suy nghĩ: ‘Thế gian ân ái là ô uế, bất tịnh, đáng gì mà tham đắm?’ Rồi người ấy lìa bỏ gia đình, cạo bỏ râu tóc, mặc pháp phục mà cầu đạo và nói: ‘Ta là Sa-môn! Ta là Sa-môn!",
        "“Nếu trong chúng Sát-lợi, có người thân hành bất thiện, khẩu hành bất thiện, ý hành bất thiện; sau khi hành bất thiện rồi, thân hoại mạng chung nhất định sẽ phải thọ khổ. Hoặc có Bà-la-môn, cư sĩ, thủ-đà-la thân hành bất thiện, khẩu hành bất thiện, ý hành bất thiện; sau khi hành bất thiện rồi, thân hoại mạng chung nhất định sẽ phải thọ khổ.",
        "“Chủng tánh Sát-lợi thân hành thiện, khẩu hành thiện, ý hành thiện, khi thân hoại mạng chung nhất định sẽ thọ lạc. Bà-la-môn, cư sĩ, thủ-đà-la thân hành thiện, khẩu hành thiện, ý hành thiện, khi thân hoại mạng chung nhất định sẽ được thọ lạc.",
        "“Thân của người sát lợi thân có hai loại hành, miệng và ý cũng có hai loại hành. Sau khi thân, miệng, và ý đã hành hai loại ấy rồi, thân hoại mạng chung nhất định sẽ thọ báo hoặc khổ hoặc lạc. Bà-la-môn, cư sĩ, thủ-đà-la, thân, miệng, ý có hai loại hành. Sau khi thân, miệng, và ý đã hành hai loại này rồi, thân hoại mạng chung chắc chắn sẽ thọ báo hoặc khổ hoặc vui.",
        "“Trong chúng Sát-lợi, như có người cạo bỏ râu tóc, mặc ba pháp y, xuất gia cầu đạo. Vị ấy tu tập bảy giác ý. Với tín tâm kiên cố vị ấyï xuất gia hành đạo, tu phạm hạnh vô thượng, ngay trong đời này, tự thân tác chứng: ‘Sự sanh của ta đã dứt, phạm hạnh đã vững, những gì cần làm đã làm xong, tự biết không còn tái sanh đời sau nữa.’  “Ở trong chúng Bà-la-môn, cư sĩ, thủ-đà-la, có người cạo bỏ râu tóc, mặc ba pháp y, xuất gia cầu đạo. Vị ấy tu tập bảy giác ý. Vị ấy do lòng tin kiên cố mà xuất gia hành đạo, tu phạm hạnh vô thượng, ở ngay trong đời này mà tự thân tác chứng: ‘Sự sanh của ta đã dứt, phạm hạnh đã vững , những gì cần làm đã làm xong, tự biết không còn tái sanh đời sau nữa.’",
        "“Trong bốn chủng tánh này, đều có thể thành tựu minh và hành, chứng đắc A-la-hán, là đệ nhất tối thượng.”",
        "Bấy giờ, Phạm thiên liền nói kệ:",
        "Thọ sanh, Sát-lợi nhất,",
        "Hay tập các chủng tánh.",
        "Minh-hành thành đầy đủ,",
        "Là nhất trong Trời-Người.”",
        "Phật bảo các Tỳ-kheo:",
        "“Phạm thiên kia nói bài kệ này rất hay, chứ không phải không hay; là khéo lãnh thọ, chứ không phải không khéo lãnh thọ, được Ta ấn chứng. Vì sao? Vì Ta nay, là Như Lai, Chí chân, là Đẳng chánh giác, cũng nói như bài kệ này.",
        "“Sát lợi sanh là nhất,",
        "Hay tập các chủng tánh,",
        "Minh-hành thành đầy đủ,",
        "Là nhất trong Trời-Người.”",
        "Bấy giờ, các Tỳ-kheo sau khi nghe những điều Phật dạy, hoan hỷ thực hành.",
        "Trường A Hàm hoàn tất.",
        "Quy mạng Nhất thiết trí.",
        "Tất cả chúng an vui. Chúng sanh trú vô vi,  Tôi cũng ở trong đó.",
        "Hết"
    ]
}