{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "10. KINH THẬP THƯỢNG",
        "Số Phẩm": "PHẦN 2",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Tôi nghe như vầy:",
        "Một thời, Phật du hành nước Ương già, cùng chúng đại Tỳ-kheo một nghìn hai trăm năm mươi người , đến thành Chiêm-bà , nghĩ đêm bên bờ hồ Già già . Vào ngày mười lăm trăng tròn, Thế Tôn ngồi ở khoảng đất trống, với đại chúng vây quanh, thuyết pháp cho đến hết đêm. Rồi ngài bảo Xá-lợi-phất:",
        "“Nay các Tỳ-kheo bốn phương tập hợp về đây, thảy đều tinh cần, dẹp bỏ sự ngủ nghỉ, muốn nghe thuyết pháp. Nhưng Ta đau lưng, muốn nghỉ ngơi một chút. Thầy nay hãy thuyết pháp cho các Tỳ-kheo.”",
        "Sau khi Xá-lợi-phất vâng lời Phật dạy, Thế Tôn bèn gấp tư tăng-già-lê, nằm nghiêng về hông phải như sư tử chồng hai chân lên nhau mà nằm. Bấy giờ, trưởng lão Xá-lợi-phất nói với các Tỳ-kheo:",
        "“Nay tôi nói pháp, khoảng đầu, khoảng giữa, khoảng cuối thảy đều chân chánh, có đầy đủ nghĩa và vị, phạm hạnh thanh tịnh. Các thầy hãy lắng nghe, hãy suy ngẫm kỹ. Tôi sẽ giảng thuyết.”",
        "Các Tỳ-kheo vâng lời lắng nghe. Xá lợi-phất nói:",
        "“Có pháp thập thượng , trừ các kết phược , dẫn đến Niết-bàn , dứt sạch biên tế của khổ, lại có thể đầy đủ năm trăm năm mươi pháp. Nay tôi sẽ phân biệt. Các thầy hãy lắng nghe.",
        "“Này các Tỳ-kheo, có một thành pháp, một tu pháp, một giác pháp, một diệt pháp, một thối pháp, một tăng pháp, một nan giải pháp, một sanh pháp, một tri pháp, một chứng pháp. “Thế nào là một thành pháp? Đó là: đối với các pháp thiệân mà không buông lung.",
        "“Thế nào là một tu pháp? Đó là: thường tự niệm thân.",
        "“Thế nào là một giác pháp? Đó là: xúc hữu lậu",
        "“Thế nào là một diệt pháp? Đó là: ngã mạn.",
        "“Thế nào là một thối pháp? Đó là: bất ác lộ quán.",
        "“Thế nào là một tăng pháp? Đó là: ác lộ quán.",
        "“Thế nào là một nan giải pháp? Đó là: vô gián định. “Thế nào là một sanh pháp? Đó là: hữu lậu giải thoát.",
        "“Thế nào là một tri pháp? Đó là: hết thảy chúng sanh đều do thức ăn mà tồn tại.",
        "“Thế nào là một chứng pháp? Đó là: vô ngại tâm giải thoát .",
        "“Lại nữa, có hai thành pháp, hai tu pháp, hai giác pháp, hai diệt pháp, hai thối pháp, hai tăng pháp, hai nan giải pháp, hai sanh pháp, hai tri pháp, hai chứ ùng pháp.",
        "“Thế nào là hai thành pháp? Biết tàm và biết quí.",
        "“Thế nào là hai tu pháp? Chỉ và quán. “Thế nào là hai giác pháp? Danh và sắc.",
        "“Thế nào là hai diệt pháp? Vô minh và ái.",
        "“Thế nào là hai thối pháp? Hủy giới và phá kiến",
        "“Thế nào là hai tăng pháp? Có giới và có kiến.",
        "“Thế nào là hai nan giải pháp? Có nhân, có duyên, khiến chúng sanh sanh cáu bẩn. Có nhân, có duyên khiến chúng sanh đắc tịnh.",
        "“Thế nào là hai sanh pháp? Tận trí và vô sanh trí.",
        "“Thế nào là hai tri pháp? Thị xứ và phi xứ.",
        "“Thế nào là hai chứng pháp? Minh và giải thoát.",
        "“Lại nữa, có ba thành pháp, ba tu pháp, ba giác pháp, ba diệt pháp, ba thốùi pháp, ba tăng pháp, ba-nan giải pháp, ba sanh pháp, ba tri pháp, ba chứng pháp.",
        "“Thế nào là ba thành pháp? 1. Thân cận thiện hữu 2. Tai nghe pháp âm 3. Thành tựu pháp và tùy pháp.",
        "“Thế nào là ba tu pháp? Đó là ba tam-muội: không tam-muội, vô tướng tam-muội, vô tác tam-muội.",
        "“Thế nào là ba giác pháp? Đó là ba thọ: khổ thọ, lạc thọ, phi khổ phi lạc thọ.",
        "“Thế nào là ba diệt pháp? Đó là ba ái: dục ái, hữu ái, vô hữu ái.",
        "“Thế nào là ba thối pháp? Đó là ba bất thiện căn: tham bất thiện căn, nhuế bất thiện căn, si bất thiện căn.",
        "“Thế nào là ba tăng pháp? Đó là ba thiện căn: vô tham thiện căn, vô nhuế thiện căn, vô si thiện căn.",
        "“Thế nào là ba nan giải pháp? Đó là ba điều khó hiểu: khó hiểu về các bậc Hiền Thánh, khó hiểu về nghe Pháp, khó hiểu về Như Lai.",
        "“Thế nào là ba sanh pháp? Đó là ba tướng: tức chỉ tướng, tinh tấn tướng, xả ly tướng",
        "“Thế nào là ba tri pháp? Đó là ba xuất yếu giới:",
        "1. Thoát ly dục lên sắc giới,",
        "2. Thoát ly sắc giới lên vô sắc giới,",
        "3. Xả ly hết thảy các pháp hữu vi, đó được gọi là diệt tận.",
        "“Thế nào là ba chứng pháp? Đó là ba minh: túc mạng trí, thiên nhãn trí và lậu tận trí.",
        "“Các Tỳ-kheo, đó là ba mươi pháp như thật, không hư dối, Như Lai đã biết, rồi thuyết pháp một cách xác thực.",
        "Lại nữa, có bốn thành pháp, bốn tu pháp, bốn giác pháp, bốn diệt pháp, bốn thối pháp, bốn tăng pháp, bốn nan giải pháp, bốn sanh pháp, bốn tri pháp, bốn chứng pháp.",
        "“Thế nào là bốn thành pháp? Đó là luân pháp :",
        "1. Sống ở giữa nước.",
        "2. Gần thiện hữu.",
        "3. Tự cẩn thận",
        "4. Có gốc rễ thiện đã được trồng từ đời trước.",
        "“Thế nào là bốn tu pháp? Đó là bốn niệm xứ:",
        "1. Tỳ-kheo quán thân trên nội thân, tinh cần không biếng nhác, ức niệm không quên, trừ tham ưu ở đời",
        "Quán thân trên ngoại thân, tinh cần không biếng nhác, ức niệm không quên, trừ tham ưu ở đời. Quán thân trên nội ngoại thân, tinh cần không biếng nhác, ức niệm không quên, trừ tham ưu ở đời;",
        "2. Quán thọ;",
        "3. Quán ý;",
        "4. Quán pháp cũng như vậy.",
        "“Thế nào là bốn giác pháp? Đó là bốn thức ăn: thức ăn bằng vo nắm, thức ăn bằng cảm xúc, thức ăn bằng tư niệm, thức ăn do thức.",
        "“Thế nào là bốn diệt pháp? Đó là bốn thủ : dục thủ, ngã ngữ thủ, giới cấm thủ, và kiến thủ.",
        "“Thế nào là bốn thối pháp? Đó là bốn ách : dục là ách, hữu là ách, kiến là ách, vô minh là ách.",
        "“Thế nào là bốn tăng pháp? Đó là bốn vô ách: không có ách là dục, không có ách là hữu, không có ách là kiến, không có ách là vô minh.",
        "“Thế nào là bốn nan giải pháp? Đó là bốn thánh đế: khổ đế, tập đế, diệt đế,",
        "đạo đế.",
        "“Thế nào là bốn sanh pháp: đó là bốn trí: pháp trí, vị tri trí, đẳng trí, tha tâm trí",
        "“Thế nào là bốn tri pháp? Đó là bốn biện tài: pháp biện, nghĩa biện, từ biện, vô ngại biện.",
        "“Thế nào là bốn chứng pháp? Đó là bốn Sa-môn quả: Tu-đà-hoàn quả, Tưđà-hàm quả, A-na-hàm quả, A-la-hán quả.",
        "“Các Tỳ-kheo, đó là bốn mươi pháp, như thật, không hư dối, Như Lai đã biết, rồi thuyết pháp một cách xác thực.",
        "“Lại nữa, có năm thành pháp, năm tu pháp, năm giác pháp, năm diệt pháp, năm thối pháp, năm tăng pháp, năm nan giải pháp, năm sanh pháp, năm tri pháp, năm chứng pháp.",
        "“Thế nào là năm thành pháp? Đó là năm diệt tận chi",
        "1. Tin Phật Như Lai, Chí chân, mười hiệu thành tựu",
        "2. Không bệnh, thân thường an ổn",
        "3. Chất trực, không dua xiểm, hướng thẳng đến con đường dẫn đến Niết-bàn của Như Lai",
        "4. Chuyên tâm không tán loạn, đọc tụng cũng không quên lãng",
        "5. Khéo léo quán sát sự sinh diệt của pháp, bằng thực hành của Hiền Thánh mà diệt tận gốc rễ khổ.",
        "“Thế nào là năm tu pháp? Đó là năm căn : tín căn, tinh tấn căn, niệm căn, định căn, và tuệ căn.",
        "“Thế nào là năm giác pháp? Đó là năm thọ ấm:  sắc thọ ấm, thọ, tưởng, hành, thức thọ ấm.",
        "“Thế nào là năm diệt pháp? Đó là năm cái: tham dục cái, sân nhuế cái, thụy miên cái, trạo hối cái, và nghi cái.",
        "“Thế nào là năm thối pháp? Đó là năm tâm ngại kết",
        "1. Tỳ-kheo nghi Phật. Nghi Phật rồi thì không thân cận. Không thân cận rồi thì không cung kính. Đó là tâm ngại kết thứ nhất.",
        "2-4. Lại nữa, Tỳ-kheo, đối với Pháp, đối với Chúng, đối với giới, có lọt, có rỉ, có hành vi không chân chánh, có hành vi ô nhiễm, không thân cận giới, cũng không cung kính. Đó là bốn tâm ngại kết.",
        "5. Lại nữa, Tỳ-kheo đối với người đồng phạm hạnh sanh tâm ác hại, tâm không hỷ lạc, mắng chửi bằng những lời thô lỗ. Đó là tâm ngại kết thứ năm.",
        "“Thế nào là năm tăng pháp? Đó là năm gốc rễ của hỷ: 1. Vui vẻ, 2. Niệm, 3. Khinh an, 4. Lạc, 5. Định",
        "“Thế nào là năm nan giải pháp? Đó là năm giải thoát xứ , nếu Tỳ-kheo tinh cần không biếng nhác, ưa chỗ nhàn tĩnh, chuyên niệm nhất tâm, chưa giải thì được giải, chưa diệt tận thì được diệt tận, chưa an thì được an.",
        "Những gì là năm? Nếu Tỳ-kheo nghe Phật thuyết pháp hoặc nghe đồng phạm hạnh thuyết, hoặc nghe sư trưởng thuyết, tư duy, quán sát, phân biệt pháp nghĩa, tâm được hoan hỷ. Tâm được hoan hỷ rồi thì được pháp ái, được pháp ái rồi thì thân tâm an ổn. Thân tâm an ổn rồi thì đắc thiền định. Đắc thiền định rồi thì đắc như thật trí. Đó là giải thoát xứ thứ nhất. Ở đây, Tỳ-kheo nghe pháp hoan hỷ, thọ trì đọc tụng cũng hoan hỷ, thuyết giảng cho người khác cũng hoan hỷ, tư duy phân biệt cũng lại hoan hỷ, đối với pháp mà đắc định cũng giống như vậy.",
        "“Thế nào là năm sanh pháp?",
        "“Đó là năm trí định của Hiền Thánh:",
        "1. Tu tam-muội là, nay an lạc về sau cũng an lạc, sanh nội ngoại trí",
        "2. Là Hiền Thánh vô ái , sanh nội ngoại trí.",
        "3. Là định mà chư Phật và các Hiền Thánh tu hành, sanh nội ngoại trí.",
        "4. Là êm dịu, tịch diệt tướng, độc nhất không gì sánh ngang, sanh nội ngoại trí.",
        "5. Đối với tam-muội nhứt tâm nhập, nhứt tâm khởi, sanh nội ngoại trí.",
        "“Thế nào là năm tri pháp? Đó là năm xuất yếu giới:",
        "1. Tỳ-kheo đối với dục không lạc, không niệm tưởng, cũng không thân cận, mà chỉ niệm tưởng sự xuất yếu, hoan lạc nơi sự viễn ly, thân cận không biếng nhác, tâm vị ấy nhu nhuyến, xuất yếu, ly dục. Lậu khởi do bởi dục cũng bị diệt tận mà đắc giải thoát. Đó là dục xuất yếu.",
        "2. Sân nhuế xuất yếu.",
        "3. Tật đố xuất yếu.",
        "4. Sắc xuất yếu.",
        "5. Thân kiến xuất yếu cũng giống như vậy.",
        "“Thế nào là năm chứng pháp? Đó là năm tụ vô học : tụ vô học giới, tụ vô học định, tụ vô học tuệ, tụ vô học giải thoát, tụ vô học giải thoát tri kiến.",
        "“Các Tỳ-kheo, đó là năm mươi pháp, như thật, không hư dối. Như Lai đã biết, rồi thuyết pháp một cách xác thực.",
        "“Lại nữa, có sáu thành pháp, sáu tu pháp, sáu giác pháp, sáu diệt pháp, sáu thối pháp, sáu tăng pháp, sáu nan giải pháp, sáu sanh pháp, sáu tri pháp, sáu chứng pháp.",
        "“Thế nào là sáu thành pháp? Đó là sáu trọng pháp : nếu có Tỳ-kheo tu sáu pháp tôn trọng, đáng kính đáng trọng, hòa hợp với chúng không có tranh tụng, độc hành không hỗn tạp. Những gì là sáu?",
        "1. Ở đây, Tỳ-kheo thân thường hành từ , kính đồng phạm hạnh, sống với tâm nhân ái. Đó gọi là trọng pháp, đáng kính, đáng trọng, hòa hợp với chúng, không có tranh tụng, độc hành không hỗn tạp",
        "2-4. Lại nữa, Tỳ-kheo khẩu hành từ, ý hành từ; được vật lợi dưỡng đúng pháp và những thức ăn ở trong bát cũng đều đem chia cho người khác dùng chung, không phân biệt đây kia.",
        "5. Lại nữa, Tỳ-kheo, đối với giới mà bậc Thánh hành trì, không phạm, không hủy, không nhiễm ô, được bậc trí khen ngợi, khéo thọ trì đầy đủ, thành tựu định ý.",
        "6. Lại nữa, Tỳ-kheo chánh kiến về các phạm hạnh để thành tựu sự xuất yếu của Hiền Thánh, để chân chánh diệt tận khổ, đó gọi là trọng pháp, đáng kính đáng trọng, hòa hợp với chúng, không có tranh tụng, độc hành không tạp.",
        "“Thế nào là sáu tu pháp? Đó là sáu tu niệm: niệm Phật, niệm Pháp, niệm Tăng, niệm giới, niệm thí, niệm thiên.",
        "“Thế nào là sáu giác pháp? Đó là sáu nội nhập: nhãn nhập, nhĩ nhập, tỷ nhập, thiệt nhập, thân nhập, ý nhập.",
        "“Thế nào là sáu diệt pháp? Đó là sáu ái: sắc ái, thanh ái, hương ái, vị ái, xúc ái, pháp ái.",
        "“Thế nào là sáu thối pháp? Đó là sáu pháp bất kính: không kính Phật, không kính Pháp, không kính Tăng, không kính giới, không kính định, không kính cha mẹ.",
        "“Thế nào là sáu tăng pháp? Đó là sáu pháp kính: kính Phật, kính Pháp, kính Tăng, kính giới, kính định, kính cha mẹ.",
        "“Thế nào sáu nan giải pháp? Đó là sáu vô thượng: kiến vô thượng, văn vô thượng, lợi dưỡng vô thượng, giới vô thượng, cung kính vô thượng, niệm vô thượng.",
        "“Thế nào là sáu sanh pháp? Đó là sáu đẳng pháp : ở đây, Tỳ-kheo, mắt thấy sắc, không ưu, không hỷ, an trú xả, chuyên niệm. Tai nghe tiếng, mũi ngửi hương, lưỡi nếm vị, thân xúc chạm, ý tưởng pháp, không ưu, không hỷ, an trú xả, chuyên niệm.",
        "“Thế nào là sáu tri pháp? Đó là sáu xuất yếu giới. Nếu có Tỳ-kheo nói như vầy: ‘Tôi tu từ tâm, lại còn sanh sân nhuế’, thì các Tỳ-kheo khác nói:",
        "‘Ngươi đừng nói như thế. Chớ hủy báng Như Lai. Như Lai không nói như thế, rằng muốn khiến tu từ giải thoát mà lại sanh sân nhuế, không có trường hợp đó. Phật nói, trừ sân nhuế rồi sau đó mới đắc từ’. Nếu có Tỳ-kheo nói: ‘Tôi thực hành bi giải thoát lại sanh tâm tật đố. Hành hỷ giải thoát, sanh tâm ưu não. Hành xả giải thoát, sanh tâm yêu ghét. Hành vô ngã hành sanh tâm hồ nghi. Hành vô tưởng hành , sanh các loạn tưởng’, thì cũng giống như vậy.",
        "“Thế nào là sáu chứng pháp? Đó là sáu thần thông:",
        "1.Thần túc thông,",
        "2.Thiên nhĩ thông,",
        "3.Tri tha tâm thông,",
        "4.Túc mạng thông,",
        "5.Thiên nhãn thông.",
        "6.Lậu tận thông.",
        "“Các Tỳ-kheo, đó là sáu mươi pháp, như thật không hư dối. Như Lai đã biết, rồi thuyết pháp một cách xác thực.",
        "“Lại nữa, có bảy thành pháp, bảy tu pháp, bảy giác pháp, bảy diệt pháp, bảy thối pháp, bảy tăng pháp, bảy nan giải pháp, bảy sanh pháp, bảy tri pháp, bảy chứng pháp.",
        "“Thế nào là bảy thành pháp? Đó là bảy tài sản: tín là tài sản, giới là tài sản, tàm là tài sản, quí là tài sản, đa văn là tài sản, huệ thí là tài sản.",
        "“Thế nào là bảy tu pháp? Đó là bảy giác ýù: ở đây, Tỳ-kheo tu niệm giác ýù, y vô dục y tịch diệt, y viễn ly. Tu pháp, tu tinh tấn, tu hỷ, tu ỷ, tu định, tu xả, y vô dục, y tịch diệt, y viễn ly.",
        "“Thế nào là bảy giác pháp? Đó là bảy trú xứ của thức: nếu có chúng sanh với nhiều tâm khác nhau, nhiều tưởng khác nhau, đó là trời và người vậy. Đó là thức trú thứ nhất. Lại có chúng sanh, với nhiều thân khác nhau nhưng một tưởng, đó là trời Phạm Quang âm lúc mới sanh đầu tiên. Đó là thức trú thứ hai. Lại có chúng sanh với một thân nhưng nhiều tưởng khác nhau, đó là trời Quang âm. Đó là thức trú thứ ba. Lại có chúng sanh với một thân và một tưởng giống nhau, đó là trời Biến tịnh. Đó là thức trú thứ tư. Lại có chúng sanh trú hư không xứ. Đó là thức trú thứ năm. Lại có chúng sanh trú ở thức xứ. Đó là thức trú thứ sáu. Hoặc trú bất dụng xứ. Đó là thức trú thứ bảy.",
        "“Thế nào là bảy diệt pháp? Đó là sáu sử : sai sử bởi dục ái, sai sử bởi hữu ái, sai sử bởi kiến, sai sử bởi mạn, sai sử bởi sân nhuế, sai sử bởi vô minh, sai sử bởi nghi.",
        "“Thế nào là bảy thối pháp? Đó là bảy phi pháp: ở đây, Tỳ-kheo không có tín, không có tàm, không có quí, ít học, biếng nhác, hay quên, vô trí.",
        "“Thế nào là bảy tăng pháp? Đó là bảy chánh pháp: ở đây Tỳ-kheo có tín, có tàm, có quí, đa văn, không biếng nhác, nhớ dai, có trí.",
        "“Thế nào là bảy nan giải pháp? Đó là bảy chánh thiện pháp: ở đây, Tỳ-kheo ưa nghĩa, ưa pháp, ưa biết thời, ưa biết đủ, ưa tự nhiếp, ưa tập chúng, ưa phân biệt người.",
        "“Thế nào là bảy sanh pháp? Đó là bảy tưởng: tưởng về sự bất tịnh của thân, tưởng về sự bất tịnh của thức ăn, tưởng về sự hết thảy thế gian không đáng ưa thích, tưởng về sự chết, tưởng về vô thường, tưởng vô thường là khổ, tưởng khổ là vô ngã.",
        "“Thế nào là bảy tri pháp? Đó là bảy sự tinh cần: tinh cần nơi giới, tinh cần diệt tham dục, tinh cần phá tà kiến, tinh cần nơi đa văn, tinh cần nơi tinh tấn, tinh cần nơi chánh niệm, tinh cần nơi thiền định.",
        "“Thế nào là bảy chứng pháp? Đó là bảy năng lực diệt tận lậu hoặc : ở đây, Tỳ-kheo dứt tận lậu đối với hết thảy sự tập khởi của khổ, sự diệt trừ, vị ngọt, sự tai hại, và sự xuất ly mà biết như thật, thấy như thật. Quán sát dục như hầm lửa, và cũng như đao kiếm, biết dục, thấy dục, không tham nơi dục, tâm không trụ nơi dục. Tỳ-kheo lậu tận, quán sát thuận và nghịch, sau khi đã như thật giác tri, như thật thấy; tham, tật, ác bất thiện pháp của thế gian, không rò rỉ, không sinh khởi. Tu tứ niệm xứ, tu tập nhiều lần, thực hành nhiều lần. Tu năm căn, năm lực, bảy giác ýù, tám Hiền Thánh đạo, tu tập nhiều lần.",
        "“Các Tỳ-kheo, đó là bảy mươi pháp như thật không hư dối. Như Lai đã biết, rồi thuyết pháp một cách xác thực.",
        "“Lại nữa, có tám thành pháp, tám tu pháp, tám giác pháp, tám diệt pháp, tám thối pháp, tám tăng pháp, tám nan giải pháp, tám sanh pháp, tám tri pháp, tám chứng pháp.",
        "“Thế nào là tám thành pháp? Đó lá tám nhân duyên khiến cho chưa sở đắc phạm hạnh nhưng có thể sở đắc trí , và nếu đã sở đắc phạm hạnh thì trí tăng trưởng. Những gì là tám? Ở đây, Tỳ kheo sống nương tựa Thế Tôn, hoặc nương tựa sư trưởng, hoặc nương tựa người phạm hạnh có trí tuệ, sanh tâm tàm quý, có ái, có kính. Đó là nhân duyên thứ nhất, chưa chứng đắc phạm hạnh nhưng chứng đắc trí; đã chứng đắc phạm hạnh thì trí tăng gia. Lại nữa, sống nương tựa Thế Tôn, tùy thời mà thưa hỏi: ‘Pháp này có ý nghĩa gì? Dẫn đến đâu?’ Khi ấy các tôn trưởng liền mở bày cho nghĩa lý thậm thâm. Đó là nhân duyên thứ hai. Sau khi nghe pháp thân tâm an lạc, an tĩnh. Đó là nhân duyên thứ ba. Sau khi đã được an lạc, an tĩnh, sẽ không luận bàn những tạp luận làm chướng ngại đạo. Vị ấy đến giữa đại chúng hoặc tự mình thuyết pháp, hoặc thỉnh người khác thuyết, mà vẫn không bỏ sự im lặng của Hiền Thánh. Đó là nhân duyên thứ tư. Đa văn, quảng bác, ghi nhớ không quên các pháp thâm áo, hay khéo ở khoảng đầu, khoảng giữa và khoảng cuối, có nghĩa có vị, chân thật, đầy đủ phạm hạnh. Sau khi nghe thì ghi nhớ trong lòng, kiến giải không lay động.Đó là nhân duyên thứ năm. Tu tập tinh cần, diệt ác tăng thiện, gắng sức thực hành không bỏ pháp ấy. Đó là nhân duyên thứ sáu. Bằng trí tuệ mà nhận thức pháp sanh diệt, chỗ thú hướng của Hiền Thánh, tận cùng biên tế của khổ. Đó là nhân duyên thứ bảy. Quán tướng sanh và tướng diệt của năm thọ ấm: Đây là sắc, đây là sự tập khởi của sắc, đây là sự diệt tận của sắc. Đây là thọ tưởng, hành, thức. Đây là sự tập khởi của thọ, tưởng, hành, thức, sự diệt tận của thọ, tưởng, hành, thức. Đó là nhân duyên thứ tám, khiến cho chưa sở đắc phạm hạnh mà sở đắc trí, nếu đã sở đắc phạm hạnh thì trí tuệ tăng trưởng.",
        "“Thế nào là tám tu pháp? Đó là tám con đường của Hiền Thánh: chánh kiến, chánh chí, chánh ngữ, chánh nghiệp, chánh mạng, chánh phương tiện, chánh niệm, chánh định.",
        "“Thế nào là tám giác pháp? Đó là tám pháp ở đời: lợi, suy, vinh, nhục, khen, chê, khổ, lạc.",
        "“Thế nào là tám diệt pháp? Đó là tám tà: tà kiến, tà tư, tà ngữ, tà nghiệp, tà mạng, tà phương tiện, tà niệm, tà định.",
        "“Thế nào là tám thối pháp? Đó là tám pháp giải đãi. Tám pháp giải đãi là những gì? Tỳ-kheo lười biếng, khất thực nhưng không được thực, bèn suy nghĩ: ‘Hôm nay ta khất thực dưới xóm nhưng không được thực, thân thể mệt mỏi không đủ sức tọa thiền kinh hành. Ta nên nghỉ ngơi.’ Tỳ-kheo lười biếng suy nghĩ như vậy và nằm nghỉ, không chịu siêng năng để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng. Đó là sự giải đãi thứ nhất.",
        "“Tỳ-kheo lười biếng nhận được thức ăn đầy đủ, lại suy nghĩ: ‘Sáng nay ta vào xóm khất thực, nhận được thức ăn và ăn quá no, thân thể nặng nề không thể tọa thiền kinh hành. Ta nên ngủ nghỉ.’ Tỳ-kheo lười biếng liền ngủ nghỉ, không chịu siêng năng để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng. Đó là sự giải đãi thứ hai.",
        "“Tỳ-kheo lười biếng, giả sử có làm chút công việc, bèn suy nghĩ: ‘Ngày nay ta làm việc, thân thể mệt mỏi không thể tọa thiền kinh hành. Ta nên ngủ nghỉ.’ Tỳ-kheo lười biếng liền ngủ nghỉ, không chịu siêng năng để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng. Đó là sự giải đãi thứ ba.",
        "“Tỳ-kheo lười biếng, giả sử có chút việc sẽ phải làm, bèn suy nghĩ: ‘Ngày mai ta sẽ làm việc, thân thể sẽ mệt mỏi, vậy hôm nay không thể tọa thiền kinh hành. Ta nên nghỉ ngơi trước.’ Tỳ-kheo lười biếng liền ngủ nghỉ. Đó là sự giải đãi thứ tư.",
        "“Tỳ-kheo lười biếng, giả sử có đi lại chút ít bèn suy nghĩ: ‘Sáng nay ta đi lại, thân thể mệt mỏi, không thể tọa thiền kinh hành. Ta nên ngủ nghỉ.’ Tỳ kheo lười biếng liền ngủ nghỉ. Đó là sự giải đãi thứ năm.",
        "“Tỳ-kheo lười biếng, giả sử sẽ phải đi lại chút ít, bèn suy nghĩ: ‘Ngày mai ta sẽ phải đi lại, thân thể sẽ mệt mỏi, vậy hôm nay không thể tọa thiền kinh hành. Ta nên nghỉ ngơi trước.’ Tỳ-kheo lười biếng liền ngủ nghỉ, không chịu siêng năng để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng. Đó là sự giải đãi thứ sáu.",
        "“Tỳ-kheo lười biếng, giả sử gặp chút bịnh hoạn, bèn suy nghĩ: ‘Nay ta bịnh nặng, mệt nhọc gầy yếu, không thể tọa thiền kinh hành. Ta nên ngủ nghỉ.’ Tỳ kheo lười biếng liền ngủ nghỉ, không chịu siêng năng để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng. Đó là sự giải đãi thứ bảy.",
        "“Tỳ-kheo lười biếng, khi bịnh đã bớt, bèn suy nghĩ: ‘Ta khỏi bịnh chưa lâu, thân thể gầy yếu, không thể tọa thiền kinh hành. Ta nên ngủ nghỉ.’ Tỳ-kheo lười biếng liền ngủ nghỉ, không chịu siêng năng để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng. Đó là sự giải đãi thứ tám.",
        "“Thế nào là tám tăng pháp? Đó là tám sự không biếng nhác. Tỳ-kheo vào xóm khất thực nhưng không được thức ăn, bèn suy nghĩ: ‘Ta thân thể nhẹ nhàng, ít buồn ngủ, vậy ta hãy tinh tấn tọa thiền, kinh hành, để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng.’ Rồi Tỳ-kheo ấy liền siêng năng. Đó là sự tinh tấn thứ nhất.",
        "“Tỳ-kheo khất thực được đủ, bèn suy nghĩ: ‘Nay ta vào xóm khất thực được no đủ, khí lực sung túc, ta hãy tinh tấn tọa thiền, kinh hành, để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng.’ Rồi Tỳ-kheo ấy liền siêng năng. Đó là sự tinh tấn thứ hai.",
        "“Tỳ-kheo siêng năng giả sử có chút công việc phải làm, bèn suy nghĩ: ‘Ta vừa làm công việc mà bỏ phế sự hành đạo. Nay ta hãy tinh tấn tọa thiền, kinh hành, để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng.’ Rồi Tỳ-kheo ấy liền siêng năng. Đó là sự tinh tấn thứ ba.",
        "“Tỳ-kheo siêng năng giả sử có công việc sẽ phải làm, bèn suy nghĩ: ‘Ngày mai ta sẽ làm công việc mà bỏ phế sự hành đạo. Nay ta hãy tinh tấn tọa thiền, kinh hành, để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng.’ Rồi Tỳ-kheo ấy liền siêng năng. Đó là sự tinh tấn thứ tư.",
        "“Tỳ-kheo siêng năng giả sử có chút đi lại, bèn suy nghĩ: ‘Ta sáng nay đi lại mà bỏ phế sự hành đạo. Nay ta hãy tinh tấn tọa thiền, kinh hành, để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng.’ Rồi Tỳ-kheo ấy liền siêng năng. Đó là sự tinh tấn thứ năm.",
        "“Tỳ-kheo siêng năng giả sử sẽ phải đi lại, bèn suy nghĩ: ‘Ngày mai ta sẽ phải đi lại mà bỏ phế sự hành đạo. Nay ta hãy tinh tấn tọa thiền, kinh hành, để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng.’ Rồi Tỳ-kheo ấy liền siêng năng. Đó là sự tinh tấn thứ sáu.",
        "“Tỳ-kheo siêng năng giả sử bị bịnh hoạn, bèn suy nghĩ: ‘Ta nay bịnh nặng, có thể mạng chung. Nay ta hãy tọa thiền kinh hành, để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng.’ Rồi Tỳ-kheo ấy liền siêng năng. Đó là sự tinh tấn thứ bảy.",
        "“Tỳ-kheo siêng năng khi bịnh có chút thuyên giảm bèn suy nghĩ: ‘Ta bịnh mới khỏi, biết đâu nó tăng trở lại mà phế bỏ sự hành đạo. Nay ta hãy tinh tấn tọa thiền, kinh hành, để sở đắc những điều chưa sở đắc, thu hoạch những điều chưa thu hoạch, chứng những điều chưa chứng.’ Rồi Tỳ-kheo ấy liền siêng năng. Đó là sự tinh tấn thứ tám.",
        "“Thế nào là tám nan giải pháp? Đó là tám sự không thuận lợi, cản trở sự tu tập phạm hạnh . Những gì là tám? Như Lai, Chí chân xuất hiện ở đời, nói pháp vi diệu, tịch diệt, vô vi, hướng về đạo giác ngộ, mà có người sanh vào địa ngục. Đó là trường hợp không thuận lợi, không thể tu tập phạm hạnh. Như Lai, Chí chân xuất hiện ở đời, nói pháp vi diệu, tịch diệt, vô vi, hướng về đạo giác ngộ, mà có người sanh vào súc sanh ngạ quỷ, cõi trời trường thọ, biên địa vô thức, chỗ không có Phật pháp. Đó là trường hợp không thuận lợi, không thể tu tập phạm hạnh. Như Lai, Chí chân xuất hiện ở đời, nói pháp vi diệu, tịch diệt, vô vi, hướng về đạo giác ngộ, hoặc có người sanh ở trung ương, nhưng có tà kiến, mang tâm điên đảo, thành tựu ác hành chắc chắn vào địa ngục. Đó là trường hợp không thuận lợi, không thể tu tập phạm hạnh. Như Lai, Chí chân xuất hiện ở đời, nói pháp vi diệu, tịch diệt, vô vi, hướng về đạo giác ngộ, hoặc có chúng sanh sanh ở trung ương nhưng mù, điếc, câm, ngọng, không thể nghe pháp, tu hành phạm hạnh. Đó là trường hợp không thuận lợi, không thể tu tập phạm hạnh. Như Lai, Chí chân xuất hiện ở đời, nói pháp vi diệu, tịch diệt, vô vi, hướng về đạo giác ngộ, hoặc có chúng sanh sanh ở trung ương, các căn đầy đủ để lãnh thọ Thánh giáo nhưng không gặp Phật, không được tu hành phạm hạnh. Đó là tám pháp không thuận lợi.",
        "“Thế nào là tám sanh pháp? Đó là tám sự tỉnh giác của bậc đại nhân.Đạo phải là ít dục; nhiều dục không phải là đạo. Đạo phải là tri túc; không biết nhàm đủ không phải là đạo. Đạo cần phải nhàn tĩnh; ưa đám đông không phải là đạo. Đạo cần phải tự giữ; cười giỡn không phải là đạo. Đạo cần phải tinh tấn; biếng nhác không phải là đạo. Đạo cần phải chuyên niệm; hay quên lãng không phải là đạo. Đạo cần phải định ý; loạn ý không phải là đạo. Đạo cần phải có trí tuệ; ngu si không phải là đạo.",
        "“Thế nào là tám tri pháp? Đó là tám trừ nhập :",
        "1. Bên trong có sắc tưởng, quán ngoại sắc ít, hoặc đẹp hoặc xấu, thường quán thường niệm. Đó là trừ nhập thứ nhất.",
        "2. Bên trong có sắc tưởng, quán ngoại sắc vô lượng, hoặc đẹp hoặc xấu, thường quán thường niệm. Đó là trừ nhập thứ hai.",
        "3. Bên trong không có sắc tưởng, quán ngoại sắc ít, hoặc xấu hoặc đẹp, thường quán thường niệm. Đó là trừ nhập thứ ba.",
        "4. Bên trong không có sắùc tưởng, quán ngoại sắc vô lượng, hoặc đẹp hoặc xấu, thường quán thường niệm. Đó là trừ nhập thứ tư.",
        "5. Bên trong không sắc tưởng, quán ngoại sắc xanh, màu xanh, ánh sáng xanh, cái nhìn xanh . Ví như màu xanh của sen xanh. Cũng như vải ba-la-nại màu xanh, thuần nhất. Màu xanh, ánh sáng xanh, cái nhìn xanh cũng được tưởng như vậy, thường quán thường niệm. Đó là trừ nhập thứ năm.",
        "6. Bên trong không sắc tưởng, quán ngoại sắc vàng; màu vàng, ánh sáng vàng, cái nhìn vàng. Ví như màu vàng của hoa vàng; vải ba-la-nại vàng. Màu vàng, ánh sáng vàng, cái nhìn vàng cũng được tưởng như vậy, thường quán, thường niệm. Đó là trừ nhập thứ sáu.",
        "7. Bên trong không sắc tưởng quán ngoại sắc đỏ. Màu đỏ, ánh sáng đỏ, cái nhìn đỏ. Ví như ba màu đỏ, vải ba-lanại đỏ, thuần nhất màu đỏ, ánh sáng đỏ, cái nhìn đỏ, cũng được tưởng như vậy thường quán, thường niệm. Đó là trừ nhập thứ bảy.",
        "8. Bên trong không sắc tưởng quán ngoại sắc trắng. Màu trắng, ánh sáng trắng, cái nhìn trắng. Cũng như màu trắng của hoa trắng, vải ba-la-nại trắng, thuần nhất. Cũng tưởng như vậy, màu trắng, ánh sáng trắng, cái nhìn trắng, thường quán, thường niệm. Đó là trừ nhập thứ tám.",
        "“Thế nào là tám chứng pháp? Đó là tám giải thoát. Bên trong có sắc tưởng, quán sắc: giải thoát thứ nhất. Bên trong có sắc tưởng, quán ngoại sắc: giải thoát thứ hai. Tịnh giải thoát: giải thoát thứ ba. Vượt sắc tưởng, diệt sân nhuế tưởng, an trú không xứ: giải thoát thứ tư . Vượt qua không xứ, an trú thức xứ: giải thoát thứ năm. Vượt qua thức xứ, an trú bất dụng xứ: giải thoát thứ sáu. Vượt qua bất dụng xứ, an trú hữu tưởng vô tưởng xứ: giải thoát thứ bảy. Vượt hữu tưởng vô tưởng xứ, an trú tưởng tri diệt: giải thoát thứ tám.",
        "“Các Tỳ-kheo, đó là tám mươi pháp như thật không hư dối. Như Lai đã biết, rồi thuyết pháp một cách xác thực. “Lại nữa, có chín thành pháp, chín tu pháp, chín giác pháp, chín diệt pháp, chín thối pháp, chín tăng pháp, chín nan giải pháp, chín sanh pháp, chín tri pháp, chín chứng pháp.",
        "“Thế nào là chín thành pháp? Đó là chín tịnh diệt chi : giới tịnh diệt chi, tâm tịnh diệt chi, kiến tịnh diệt chi, độ nghi tịnh diệt chi, phân biệt tịnh diệt chi, đạo tịnh diệt chi, trừ tịnh diệt chi, vô dục tịnh diệt chi, giải thoát tịnh diệt",
        "chi.",
        "“Thế nào là chín tu pháp? Đó là chín gốc rễ của hỷ: 1. Hỷ, 2. Ái, 3. Duyệt, 4.",
        "Lạc, 5. Định, 6. Như thật tri, 7. Trừ xả, 8. Vô dục, 9. Giải thoát.",
        "“Thế nào chín giác pháp? Đó là chín nơi cư trú của chúng sanh.",
        "1. Hoặc có chúng sanh có nhiều thân khác nhau, với nhiều tưởng khác nhau, tức là chư thiên và loài người. Đó là nơi cư trú thứ nhất của chúng sanh.",
        "2. Lại có chúng sanh có nhiều thân khác nhau, nhưng với một tưởng giống nhau, tức là trời Phạm Quang âm lúc mới sanh.",
        "Đó là nơi cư trú thứ hai của chúng sinh.",
        "3. Lại có chúng sanh với một thân giống nhau, nhưng với nhiều tưởng khác nhau, tức là trời Quang âm. Đó là nơi cư trú thứ ba của chúng sanh.",
        "4. Lại có chúng sanh với một thân một tưởng giống nhau, tức là trời Biến tịnh.",
        "Đó là nơi cư trú thứ tư của chúng sanh.",
        "5. Lại có chúng sanh không có tưởng và không có giác tri, tức là trời Vô tưởng . Đó là nơi cư trú thứ năm của chúng sanh.",
        "6. Lại có chúng sanh an trú hư không xứ. Đó là nơi cư trú thứ sáu của chúng sanh. 7. Lại có chúng sanh an trú thức xứ. Đó là an trú thứ bảy của chúng sanh.",
        "8. Lại có chúng sanh an trú vô sở hữu xứ. Đó là nơi cư trú thứ tám của chúng sanh. 9. Lại có chúng sanh an trú phi tưởng phi phi tưởng xứ. Đó là nơi cư trú thứ chín của chúng sanh.",
        "“Thế nào là chín diệt pháp? Đó là chín gốc rễ của ái. Nhân ái có tìm cầu. Nhân tìm cầu có lợi. Nhân lợi có dụng. Nhân dụng có dục. Nhân dục có dính trước. Nhân dính trước có tật đố. Nhân tật đố có bảo thủ. Nhân bảo thủ có hộ.",
        "“Thế nào là chín thối pháp? Đó là chín não pháp. Có người đã não hại ta. Nó đang não hại ta. Nó sẽ não hại ta. Nó đã xâm hại cái ta thương yêu. Nó đang xâm hại cái ta thương yêu. Nó sẽ xâm hại cái ta thương yêu. Nó đã yêu kính cái ta ghét. Nó đang yêu kính cái ta ghét. Nó sẽ yêu kính cái ta ghét.",
        "“Thế nào là chín tăng pháp? Đó là chín vô não. Người kia đã xâm hại ta; nghĩ vậy chẳng có ích gì: đã không sanh não, đang không sanh não, sẽ không sanh não. Nó xâm não cái ta yêu thương; nghĩ như vậy chẳng có ích gì: đã không sanh não, đang không sanh não, sẽ không sanh não. Nó yêu thương cái ta ghét; nghĩ như vậy chẳng có ích gì: đã không sanh não, đang không sanh não, sẽ không sanh não.",
        "“Thế nào là chín nan giải pháp? Đó là chín phạm hạnh. Nếu Tỳ-kheo có tín nhưng không trì giới, thì phạm hạnh không đầy đủ. Tỳ-kheo có tín và có giới thì phạm hạnh đầy đủ. Nếu Tỳ kheo có tín, có giới, nhưng không có đa văn, thì phạm hạnh không đầy đủ. Tỳ-kheo có tín, có giới, có đa văn thì phạm hạnh đầy đủ. Nếu Tỳ-kheo có tín, có giới, có đa văn, nhưng không thể thuyết pháp, thì phạm hạnh không đầy đủ. Tỳ-kheo có tín, có giới, có đa văn, có thể thuyết pháp, thì phạm hạnh đầy đủ. Nếu Tỳ-kheo có tín, có giới, có đa văn, có thể thuyết pháp, nhưng không thể nuôi chúng, thì phạm hạnh không đầy đủ. Tỳ-kheo có tín, có giới, có đa văn, có thể thuyết pháp, có thể nuôi chúng, thì phạm hạnh đầy đủ. Nếu Tỳ-kheo có tín, có giới, có đa văn, có thể thuyết pháp, có thể nuôi chúng, nhưng giữa đại chúng không thể quảng diễn pháp ngôn, thì phạm hạnh không đầy đủ. Tỳ-kheo có tín, có giới, có đa văn, có thể thuyết pháp, có thể nuôi chúng, có thể quảng diễn pháp ngôn giữa đại chúng thì phạm hạnh đầy đủ. Nếu Tỳ-kheo có tín, có giới, có đa văn, có thể thuyết pháp, có thể nuôi chúng, giữa đại chúng có thể quảng diễn pháp ngôn, nhưng không chứng đắc tứ thiền, thì phạm hạnh không đầy đủ. Tỳ-kheo có tín, có giới, có đa văn, có thể thuyết pháp, có thể nuôi chúng, có thể quảng diễn pháp ngôn giữa đại chúng, lại đắc tứ thiền, thì phạm hạnh đầy đủ. Nếu Tỳ-kheo có tín, có giới, có đa văn, có thể thuyết pháp, có thể nuôi chúng, giữa đại chúng có thể quảng diễn pháp ngôn, lại chứng đắc tứ thiền, nhưng đối với tám giải thoát không thể thuận nghịch du hành, thì phạm hạnh không đầy đủ. Tỳ-kheo có tín, có giới, có đa văn, có thể thuyết pháp, có thể nuôi chúng, có thể quảng diễn pháp ngôn giữa đại chúng, lại đắc tứ thiền, đối với tám giải thoát có thể thuận nghịch du hành, thì phạm hạnh đầy đủ. Nếu Tỳ kheo có tín, có giới, có đa văn, có thể thuyết pháp, có thể nuôi chúng, giữa đại chúng có thể quảng diễn pháp ngôn, lại chứng đắc tứ thiền, đối với tám giải thoát có thể thuận nghịch du hành, nhưng không thể diệt tận các lậu, thành vô lậu tâm giải thoát, trí tuệ giải thoát, ngay trong hiện tại mà tự thân tác chứng, sanh tử đã dứt, phạm hạnh đã vững, điều cần làm đã làm xong, không còn tái sanh nữa, thì phạm hạnh không đầy đủ. Tỳ-kheo có tín, có giới, có đa văn, có thể thuyết pháp, có thể nuôi chúng, có thể quảng diễn pháp ngôn giữa đại chúng, lại đắc tứ thiền, đối với tám giải thoát có thể thuận nghịch du hành, có thể diệt tận các lậu, thành vô lậu tâm giải thoát, trí tuệ giải thoát, ngay trong hiện tại mà tự thân tác chứng, sanh tử đã dứt, phạm hạnh đã vững, điều cần làm đã làm xong, không còn tái sanh nữa, thì phạm hạnh đầy đủ.",
        "“Thế nào là chín sanh pháp? Đó là chín tưởng. Tưởng về sự bất tịnh, tưởng về sự bất tịnh của thức ăn, tưởng về hết thảy thế gian không đáng ưa thích, tưởng về sự chết, tưởng về vô thường, tưởng vô thường là khổ, tưởng khổ là vô ngã, tưởng về sự diệt tận, tưởng về vô dục.",
        "“Thế nào là chín tri pháp? Đó là chín dị pháp. Sanh quả dị nhân quả dị, sanh xúc dị nhân xúc dị, sanh thọ dị nhân thọ dị, sanh tưởng dị nhân tưởng dị, sanh tập dị nhân tập dị, sanh dục dị nhân dục dị, sanh lợi dị nhân lợi dị, sanh cầu dị nhân cầu dị, sanh phiền não dị nhân phiền não dị.",
        "“Thế nào là chín chứng pháp? Đó là chín tận Nếu nhập sơ thiền, thì gai nhọn là âm thanh bị diệt trừ. Nhập đệ nhị thiền, thì gai nhọn là giác và quán bị diệt trừ. Nhập đệ tam thiền, thì gai nhọn là hỷ bị diệt trừ. Nhập đệ tứ thiền, thì gai nhọn là hơi thở ra vào bị diệt trừ. Nhập không xứ thì gai nhọn là sắc tưởng bị diệt trừ. Nhập thúc xứ thì gai nhọn là không tưởng bị diệt trừ. Nhập bất dụng xứ thì gai nhọn là thức tưởng bị diệt trừ. Nhập hữu tưởng vô tưởng xứ thì gai nhọn là bất dụng tưởng bị diệt trừ. Nhập diệt tận định thì gai nhọn là tưởng và thọ bị diệt trừ.",
        "“Các Tỳ-kheo, đó là chín mươi pháp như thật không hư dối. Như Lai đã biết, rồi thuyết pháp một cách xác thực.",
        "“Lại nữa, có mười thành pháp, mười tu pháp, mười giác pháp, mười diệt pháp, mười thối pháp, mười tăng pháp, mười nan giải pháp, mười sanh pháp, mười tri pháp, mười chứng pháp.",
        "“Thế nào là mười thành pháp? Đó là mười cứu pháp.",
        "1. Tỳ-kheo đầy đủ hai trăm năm mươi giới, đầy đủ oai nghi, thấy lỗi nhỏ nhặt sanh tâm lo sợ lớn, chân chánh học giới , tâm không nghiêng lệch.",
        "2. Có được thiện tri thức.",
        "3. Ngôn ngữ trung chánh, nhẫn nhịn được nhiều điều",
        "4. Ưa cầu thiện pháp, phân bố không tiếc lẫn.",
        "5. Các đồng phạm hạnh có việc phải làm liền đến giúp đỡ không lấy làm mệt nhọc, làm được những việc khó làm và cũng dạy người khác làm.",
        "6. Nghe nhiều; nghe xong thì ghi nhớ không hề quên",
        "7. Tinh tấn, diệt trừ bất thiện pháp, tăng trưởng thiện pháp.",
        "8. Thường tự chuyên niệm, không có tưởng khác, nhớ những hành vi thiện từ trước như thấy trước mắt.",
        "9. Trí tuệ thành tựu, quán sự sanh diệt của các pháp, bằng pháp luật Hiền Thánh mà đoạn trừ gốc khổ.",
        "10. Vui với sự nhàn cư, chuyên niệm tư duy, ở trung gian thiền, không có đùa giỡn.",
        "“Thế nào là mười tu pháp? Đó là mười chánh hành. Chánh kiến, chánh tư duy, chánh ngữ, chánh nghiệp, chánh mạng, chánh phương tiện, chánh niệm, chánh định, chánh giải thoát, chánh tri.",
        "“Thế nào là mười giác pháp? Đó là mười sắc nhập.Nhãn, nhĩ, tỉ, thiệt, thân nhập, sắc, thanh, hương, vị, xúc nhập.",
        "“Thế nào là mười diệt pháp? Đó là mười tà hạnh. Tà kiến, tà tư duy, tà ngữ, tà nghiệp, tà mạng, tà phương tiện, tà niệm, tà định, tà giải thoát, tà trí.",
        "“Thế nào là mười thối pháp. Đó là mười bất thiện hành tích.Thân có sát, đạo, dâm, khẩu có hai lưỡi, ác khẩu, nói dối, nói thêu dệt, ý có tham lam, tật đố, tà kiến.",
        "“Thế nào là mười tăng pháp? Đó là mười thiện hành. Thân không sát, đạo, dâm; khẩu không hai lưỡi, ác khẩu, nói dối, nói thêu dệt; ý không tham lam, tật đố, tà kiến.",
        "“Thế nào là mười nan giải pháp? Đó là mười Hiền Thánh cư",
        "1. Tỳ-kheo trừ diệt năm chi",
        "2. thành tựu sáu chi",
        "3. xả một chi",
        "4. y trên bốn",
        "5. diệt dị đế",
        "6. thắng diệu cầu.",
        "7. không trược tưởng",
        "8. thân hành đã lập",
        "9. tâm giải thoát.",
        "10. tuệ giải thoát.",
        "“Thế nào là mười sanh pháp? Đó là mười trường hợp khen ngợi. Nếu Tỳ kheo tự mình đã có được tín tâm rồi lại nói cho người khác, và cũng khen ngợi những người có được tín tâm. Tự mình đã trì giới rồi lại nói cho người khác, và cũng khen ngợi những người trì giới. Tự mình thiểu dục rồi lại nói cho người khác, và cũng khen ngợi những người thiểu dục. Tự mình tri túc rồi lại nói cho người khác và cũng khen ngợi những người tri túc. Tự mình ưa nhàn tĩnh rồi lại nói cho người khác, và cũng khen ngợi những người ưa nhàn tĩnh. Tự mình đa văn rồi lại nói cho người khác và cũng khen ngợi những người đa văn. Tự mình tinh tấn rồi lại nói cho người khác, và cũng khen ngợi những người tinh tấn. Tự mình chuyên niệm rồi lại nói cho người khác, và cũng khen ngợi những người chuyên niệm. Tự mình đắc thiền định rồi lại nói cho người khác, và cũng khen ngợi những người đắc thiền định. Tự mình đắc trí tuệ rồi lại nói cho người khác, và cũng khen ngợi những người đắc trí tuệ.",
        "“Thế nào là mười tri pháp? Đó là mười diệt pháp . Người chánh kiến có thể diệt trừ tà kiến. Và cũng diệt trừ sạch những gì là vô số ác duyên tà kiến mà khởi lên. Và cũng thành tựu những gì là vô số thiện nhân chánh kiến mà sanh khởi. Chánh tư duy, chánh ngữ, chánh nghiệp, chánh mạng, chánh phương tiện, chánh niệm, chánh định, chánh giải thoát, chánh trí. Người có chánh trí có thể diệt trừ tà trí, và vô số ác nhân tà trí sanh khởi cũng hoàn toàn bị diệt tận. Và vô số thiện pháp, nhân chánh trí sanh khởi, thảy đều được thành tựu.",
        "“Thế nào là mười vô học pháp? Vô học chánh kiến, chánh tư duy, chánh ngữ, chánh nghiệp, chánh mạng, chánh phương tiện, chánh niệm, chánh định, chánh giải thoát, chánh trí.",
        "“Các Tỳ-kheo, đó là trăm pháp như thật không hư dối. Như Lai đã biết, rồi thuyết pháp một cách xác thực.”",
        "Bấy giờ, Xá-lợi-phất được Phật ấn khả. Các Tỳ-kheo sau khi nghe những điều Xá-lợi-phất thuyết, hoan hỷ phụng hành."
    ]
}