{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "30. KINH THẾ KÝ - PHẨM 03 : CHUYỂN LUÂN THÁNH VƯƠNG",
        "Số Phẩm": "PHẦN 3",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Phật nói với các Tỳ-kheo:",
        "“Thế gian có Chuyển luân Thánh vương, thành tựu bảy báu, có bốn thần đức.",
        "“Những gì là bảy báu mà Chuyển luân Thánh vương thành tựu ? .Một, báu bánh xe vàng; hai, báu voi trắng; ba, báu ngựa xanh; bốn, báu thần châu; năm, báu ngọc nữ; sáu, báu cư sĩ; bảy, báu chủ binh.",
        "“Chuyển luân Thánh vương thành tựu báu bánh xe vàng như thế nào?  Nếu Chuyển luân Thánh vương hiện trong cõi đất Diêm-phù-đề; khi ấy, vua Quán đảnh thuộc dòng Sát-lợi, vào ngày rằm trăng tròn, tắm gội bằng nước thơm, rồi lên điện cao, cùng với thể nữ hưởng thụ hoan lạc. Bảo vật là bánh xe trời bằng vàng bỗng nhiên xuất hiện trước mặt. Bánh xe có nghìn căm, với màu sắc sáng chói, được làm bằng vàng trời, do thợ trời chế tạo, không phải người đời làm được. Đường kính bánh xe là bốn trượng. Khi nhìn thấy bánh xe, Chuyển luân Thánh vương thầm nghĩ: Ta từng nghe từ các bậc tiên túc, kỳ cựu nói rằng: ‘Nếu vua Sátlợi quán đảnh, vào ngày rằm lúc trăng đầy, tắm gội bằng nước thơm, lên ngồi trên Pháp điện, với thể nữ vây quanh. Bánh xe vàng tự nhiên xuất hiện trước mặt. Bánh xe có nghìn căm, với màu sắc sáng chói, được làm bằng vàng trời, do thợ trời chế tạo, không phải người đời làm được. Đường kính bánh xe là bốn trượng. Bấy giờ được gọi là Chuyển luân Thánh vương.’ Nay bánh xe này xuất hiện, há không phải là điều ấy chăng? Ta nay hãy thử bảo vật là bánh xe này.",
        "“Rồi Chuyển luân vương bèn triệu tập bốn binh chủng, hướng về bảo vật bánh xe vàng, bày vai phải, quỳ gối phải xuống đất, lấy tay phải sờ bánh xe vàng mà nói rằng: ‘Ngươi hãy nhắm hướng Đông, đúng như pháp mà chuyển, chớ có trái qui tắc thông thường’. Bánh xe liền chuyển về phương Đông. Khi ấy Chuyển luân vương liền dẫn bốn binh chủng đi theo sau. Phía trước bảo vật bánh xe vàng có bốn vị thần dẫn đường. Bánh xe ngừng chỗ nào, vua đình giá chỗ đó. Bấy giờ các Tiểu Quốc vương thấy Đại vương đến, lấy bát vàng đựng đầy thóc bạc; bát bạc đựng đầy thóc vàng; đi đến chỗ Đại vương, cúi đầu bạch rằng: ‘Lành thay, Đại vương! Nay, ở phương Đông này, đất đai phong phú, vui tươi, có nhiều trân bảo, nhân dân đông đúc, tâm chí nhân ái, hòa thuận, từ hiếu, trung thuận. Cúi nguyện Thánh vương hãy ở đây mà trị chính. Chúng tôi sẽ gần gũi hầu hạ, cung cấp những thứ cần dùng.’ Khi ấy, Chuyển luân vương nói với các Tiểu vương: ‘Thôi, thôi! Này các hiền, các người như vậy là đã cúng dường ta rồi. Nhưng hãy theo Chánh pháp mà cai trị giáo hóa, chớ để thiên lệch; không để quốc nội có hành vi phi pháp. Tự mình không sát sanh; khuyên bảo người khác không sát sanh, trộm cướp, tà dâm, hai lưỡi, ác khẩu, nói dối, thêu dệt, tham lam, tật đố, tà kiến. Đó gọi là sự cai trị của ta vậy.’",
        "“Các Tiểu vương sau khi nghe lời dạy, liền đi theo Đại vương, tuần hành các nước. Cho đến tận cùng bờ biển phía Đông.",
        "“Sao đó, lần lượt đi về phương nam, phương Tây, phương Bắc. Bất cứ chỗ nào mà bánh xe lăn đến, các Quốc vương ở đó đều dâng hiến quốc thổ; cũng như các Tiểu vương ở phương Đông vậy.",
        "“Tất cả đất đai có trong Diêm-phù-đề này, màu mỡ, phong phú, sản xuất nhiều trân bảo, những nơi có rừng, có nước trong sạch, bánh xe đều lăn khắp; ấn định biên giới, vẽ bản đồ , Đông Tây mười hai do-tuần, Nam Bắc mười do-tuần. Vào ban đêm, các thần ở trong đó xây dựng thành quách. Thành có bảy lớp, với bảy lớp lan can , bảy lớp lưới, bảy lớp hàng cây, những trang hoàng chung quanh, đều được làm bằng bảy báu… cho đến, vô số các loài chim cùng họa nhau mà hót. Thành được xây xong, bánh xe vàng lại xuất hiện trong thành, qui định địa giới Đông Tây bốn do-tuần, Nam Bắc hai do-tuần. Vào ban đêm, các thần ở trong đó xây dựng cung điện. Tường cung có bảy lớp, được làm bằng bảy báu,… cho đến vô số các loài chim cùng họa nhau mà hót, như đã kể trên.",
        "“Cung điện được dựng xong, khi ấy bảo vật bánh xe vàng trụ giữa hư không, ngay phía trước cung điện, hoàn toàn không chuyển động. Chuyển luân vương phấn khởi nói: ‘Nay bảo vật bánh xe vàng này thật sự là điềm lành cho ta. Ta nay thật sự là Chuyển luân Thánh vương.’",
        "“Đó là sự thành tựu bánh xe vàng.",
        "“Voi trắng được thành tựu như thế nào? Chuyển luân Thánh vương, vào buổi sáng sớm, ngồi trên chánh điện. Tự nhiên voi trắng bỗng xuất hiện trước mặt. Lông của nó thuần trắng, bảy chỗ bằng phẳng , có khả năng phi hành. Đầu của có nhiều màu; sáu ngà thon dài được cẩn bằng vàng ròng. Thấy thế vua liền nghĩ thầm: ‘Con voi này khôn. Nếu khéo huấn luyện, có thể cỡi.’ Bèn cho huấn luyện thử; đầy đủ các kỹ năng. Khi ấy, Chuyển luân vương muốn thử voi, bèn cỡi lên nó, vào buổi sáng sớm, xuất thành, đi quanh khắp bốn biển. Cho đến giờ ăn trưa thì trở về. Chuyển luân vương phấn khởi nói: ‘Bảo vật voi trắng này thật sự là một điềm lành cho ta. Ta nay thật sự là Chuyển luân Thánh vương.’ “Đó là sự thành tựu báu voi.",
        "“Thế nào là sự thành tựu ngựa xanh của Chuyển luân vương? Khi ấy, Chuyển luân Thánh vương, vào buổi sáng sớm, ngồi tại chánh điện, Tự nhiên bảo vật là ngựa bỗng xuất hiện trước mặt. Màu nó xanh thẩm, bờm và đuôi đỏ.Thấy thế, vua liền nghĩ thầm: ‘Con ngựa này khôn. Nếu khéo huấn luyện, có thể cỡi.’ Bèn cho huấn luyện thử; đầy đủ các kỹ năng. Khi ấy, Chuyển luân vương muốn thử ngựa, bèn cỡi lên nó, vào buổi sáng sớm, xuất thành, đi quanh khắp bốn biển. Cho đến giờ ăn trưa thì trở về. Chuyển luân vương phấn khởi nói: ‘Bảo vật ngựa xanh này thật sự là một điềm lành cho ta. Ta nay thật sự là Chuyển luân Thánh vương.’",
        "“Đó là sự thành tựu ngựa xanh.",
        "“Báu thần châu được thành tựu như thế nào? Chuyểân luân Thánh vương, vào buổi sáng sớm, ngồi trên chánh điện. Tự nhiên thần châu bỗng xuất hiện trước mặt. Màu chất trong suốt, không có tỳ vết. Sau khi thấy, vua tự nghĩ: ‘Châu này thật tuyệt vời. Nếu có ánh sáng, có thể rọi cung nội.’ Rồi Chuyển luân Thánh vương muốn thử hạt châu này, bèn triệu tập bốn binh chủng. Đặt bảo châu trên cây phướn cao. Trong lúc đêm tối, cầm cây phướn xuất thành. Ánh sáng của hạt châu này rọi đến một do-tuần. Những người ở trong thành đều thức dậy làm việc, cho rằng bây giờ là ban ngày. Chuyển luân vương khi ấy phấn khởi nói: ‘Nay thần châu này thật sự là điềm lành cho ta.",
        "Ta nay thật sự là Chuyển luân Thánh vương’.",
        "“Đó là sự thành tựu báu thần châu.",
        "“Báu ngọc nữ được thành tựu như thế nào? Khi ấy, báu ngọc nữ bỗng nhiên xuất hiện, nhan sắc thung dung, diện mạo đoan chánh; không dài, không vắn; không thô, không nhỏ; không trắng, không đen; không cương, không nhu; mùa đông thì thân ấm, mùa hè thì thân mát. Từ các lỗ chân lông khắp mình phát ra mùi hương chiênđàn; miệng phát ra mùi hương của hoa ưu-bát-la; nói năng dịu dàng; cử động khoan thai; đứng dậy trước (vua) nhưng ngồi xuống sau (vua), không mất nghi tắc. Chuyển luân Thánh vương sau khi thấy, tâm không mê đắm, không chút mơ tưởng, huống hồ gần gũi. Chuyển luân vương sau khi thấy, phấn khởi mà nói: ‘Báu ngọc nữ này thật sự là điềm lành cho ta. Ta nay thật sự là Chuyển luân Thánh vương.’ “Đó là sự thành tựu báu ngọc nữ.",
        "“Báu cư sĩ được thành tựu như thế nào? Khi ấy, người đàn ông cư sĩ bỗng nhiên tự xuất hiện; kho báu tự nhiên, tài sản vô lượng. Cư sĩ do phước báu đời trước có cặp mắt có thể nhìn thấu suốt các hầm mỏ dưới lòng đất; biết rõ hết thảy có chủ hay vô chủ. Kho nào có chủ, ông có thể giữ gìn hộ. Kho nào vô chủ, ông lấy lên cho vua tiêu dùng. Rồi thì, báu cư sĩ đi đến tâu vua: ‘Đại vương, cần cung cấp thứ gì, xin đừng lo lắng. Tôi tự mình có thể giải quyết.’",
        "“Khi ấy, Chuyển luân Thánh vương muốn thử báu cư sĩ, bèn ra lệnh sửa soạn thuyền để du ngoạn thủy, bảo cư sĩ rằng: ‘Ta cần bảo vật vàng, ngươi hãy đưa nhanh đến cho.’ Báu cư sĩ tâu rằng: ‘Đại vương đợi một chút; cần phải lên bờ đã.’ Vua lại hối thúc: ‘Ta nay đang cần dùng. Ngươi hãy mang đến liền cho ta.’ Khi báu cư sĩ bị vua ra nghiêm lệnh, bèn quỳ mọp trên thuyền, dùng tay mặt thọc xuống nước. Khi ông rút tay lên thì một cái bình báu từ trong nước cũng lên theo. Giống như con sâu leo cây. Báu cư sĩ kia cũng vậy. Khi rút bàn tay lên khỏi nước thì bình báu cũng lên theo, để đầy cả thuyền. Rồi ông tâu vua: ‘Vừa rồi vua cần bảo vật để dùng. Mà cần bao nhiêu?’ Chuyển luân Thánh vương khi ấy nói với cư sĩ: ‘Thôi, thôi! Ta không cần dùng gì. Vừa rồi, ta chỉ muốn thử mà thôi. Ngươi nay như thế là đã cúng dường ta rồi.’ Cư sĩ nghe vua nói như vậy, liền đem bảo vật trả lại trong nước. Khi ấy, Chuyển luân Thánh vương phấn khởi nói rằng: ‘Báu cư sĩ này thật sự là điềm lành của ta. Ta nay thật sự là Chuyển luân Thánh vương.’ “Đó là sự thành tựu báu cư sĩ.",
        "“Báu chủ binh được thành tựu như thế nào? Khi ấy, báu chủ binh bỗng nhiên xuất hiện, đủ trí mưu, hùng mãnh, sách lược sáng suốt, quyết đoán; đi ngay đến chỗ vua, tâu rằng: ‘Đại vương, cần chinh phạt chỗ nào, xin đừng lo. Tôi có thể đảm trách.’ Rồi Chuyển luân Thánh vương muốn thử báu chủ binh, bèn tập hợp bốn binh chủng, bảo rằng: ‘Ngươi nay hãy điều binh. Chưa tập họp thì tập họp lại. Đã tập họp thì giải tán. Chưa nghiêm, hãy làm cho nghiêm. Đã nghiêm, hãy cởi mở. Chưa đi, hãy khiến đi. Đã đi, hãy khiến dừng.’ Báu chủ binh nghe vua nói xong, bèn điều động bốn binh chủng, Chưa tập họp thì tập họp lại. Đã tập họp thì giải tán. Chưa nghiêm, làm cho nghiêm. Đã nghiêm, thì cởi mở. Chưa đi, thì khiến đi. Đã đi, thì khiến dừng. Khi ấy Chuyển luân Thánh vương phấn khởi nói rằng: ‘Báu chủ binh này thật sự là điềm lành của ta. Ta nay thật sự là Chuyển luân Thánh vương.’",
        "“Đó là sự thành tựu báu chủ binh.",
        "“Thế nào là bốn thần đức ?. Một là không ai bì kịp về tuổi thọ, không yểu số. Hai, không ai bì kịp về thân thể cường tráng, không bịnh hoạn. Ba, không ai bì kịp về nhan mạo đoan chánh. Bốn, không ai bì kịp về sự giàu có, kho tàng châu báu đầy dẫy.",
        "“Đó là Chuyển luân Thánh vương thành tựu bảy báu và bốn thần đức.",
        "“Vào một lúc, rất lâu về sau, Chuyển luân Thánh vương ra lệnh ngự giá xuất du ở hậu viên, bèn bảo người đánh xe: ‘Ngươi hãy đánh xe đi cho khéo. Ta muốn quan sát rõ nhân dân trong quốc thổ có an lạc, không tai họa gì chăng.’",
        "“Bấy giờ nhân dân trong nước đứng dọc các con đường, nói với người đánh xe rằng: ‘Ông cho xe đi chậm lại. Chúng tôi muốn nhìn ngắm rõ uy nhan của Thánh vương.’",
        "“Chuyển luân Thánh vương thương yêu chăm sóc nhân dân như cha yêu con. Quốc dân mến mộ vua cũng như con trông lên cha. Có những gì trân quý đều đem cống vua, tâu rằng: ‘Xin nguyện hạ cố thọ nhận, tùy ý sử dụng.’ Khi ấy vua trả lời: ‘Thôi đủ rồi, các người! Ta tự mình có đủ tài bảo. Các người hãy tự thọ dụng của mình.’",
        "“Khi Chuyển luân Thánh vương cai trị Diêm-phù-đề này, cõi đất ấy bằng phẳng, không có gai gốc, hầm hố, gò nỗng; cũng không có muỗi mòng, ruồi nhặng, ong, bò cạp, rắn rết, sâu độc, đá cát, sạn sỏi; tất cả lặn mất. Vàng, bạc, báu ngọc hiện lên mặt đất. Bốn mùa điều hòa, không nóng, không lạnh. Đất ấy mềm mại, không có bụi bẩn. Như đất được bôi dầu, sạch sẽ, trơn láng, không có bụi bẩn. Khi Chuyển luân Thánh vương cai trị ở đời, cõi đất cũng như vậy. Từ đất tuôn ra các dòng suối, trong sạch, không bao giờ cạn, sanh loại cỏ mềm mại, mùa đông vẫn xanh tươi. Cây cối sầm uất, hoa trái xum xuê. Đất sanh cỏ mềm, màu như đuôi lông công, mùi hương hoa bà-sư, mềm mại như lụa trời. Khi đạp chân xuống đất; đất lõm xuống bốn tấc. Khi dở chân lên, đất trở lại như cũ, không có chỗ khuyết rỗng. Có loại lúa tẻ mọc tự nhiên, có không có vỏ trấu, đủ các mùi vị. Bấy giờ có cây hương, hoa trái xum xuê. Khi trái chín, trái tự nhiên nứt, tỏa ra mùi hương tự nhiên; hương thơm sực nức. Lại có cây vải, hoa trái xum xuê. Khi trái chín, vỏ nó tự nứt ra, cho ra các loại vải khác nhau. Lại có cây trang sức, hoa trái xum xuê. Khi trái chín, vỏ nó tự nứt ra, cho ra các đồ trang sức khác nhau. Lại có cây tràng hoa, hoa trái xum xuê. Khi trái chín, vỏ nó tự nứt ra, cho ra các loại tràng hoa khác nhau. Lại có cây dụng cụ, hoa trái xum xuê. Khi trái chín, vỏ nó tự nứt ra, cho ra các thứ dụng cụ khác nhau. Lại có cây nhạc cụ, hoa trái xum xuê. Khi trái chín, vỏ nó tự nứt ra, cho ra các loại nhạc cụ khác nhau.",
        "“Khi Chuyển luân Thánh vương cai trị ở đời, long vương A-nậu-đạt, vào lúc giữa đêm và cuối đêm, nổi lên đám mây lớn dày đặc, giăng bủa khắp cả thế giới, trút xuống cơn mưa lớn. Như trong khoảng thời gian vắt sữa bò; mưa xuống thứ nước có tám vị, thấm ướt khắp nơi. Đất không đọng nước, cũng không bùn sình, thấm nhuần, đẫm ướt, sanh trưởng các loại cỏ cây. Cũng như thợ hớt tóc, rưới nước tràng hoa, khiến hoa tươi thắm, không để héo úa. Những cơn mưa phải thời thấm nhuần cũng như vậy.",
        "“Lại nữa, bấy giờ vào lúc giữa đêm và cuối đêm, bầu trời trong sáng, tịnh không chút mây, từ biển nổi cơn gió mát, trong sạch mát dịu, chạm đến thân thể khiến sanh khoan khoái.",
        "“Khi Thánh vương cai trị, trong cõi Diêm-phù-đề này ngũ cốc dồi dào, nhân dân đông đúc, tài bảo phong phú, không thiếu thốn thứ gì.",
        "“Đương thời, Chuyển luân Thánh vương trị nước bằng Chánh pháp, không có dua vạy, tu mười hành vi thiện. Lúc bấy giờ, nhân dân cũng tu chánh kiến, đủ mười hành vi thiện.",
        "“Một thời gian lâu, rất lâu về sau, vua nhuốm bịnh nặng mà mạng chung. Cũng như một người do sung sướng mà ăn hơi nhiều, thân thể có hơi không thích hợp, cho nên mạng chung, sanh lên cõi trời. Khi ấy, báu ngọc nữ, báu cư sĩ, báu chủ binh, cùng nhân dân trong nước tấu các kỹ nhạc, làm lễ táng thân vua. Rồi báu ngọc nữ, báu cư sĩ, báu chủ binh và sĩ dân trong nước, tắm gội thân thể vua bằng nước thơm, quấn quanh bằng năm trăm tấm lụa kiếp-bối; theo thứ lớp mà quấn. Rồi khiêng thi thể vua đặt vào quan tài bằng vàng, rưới lên dầu thơm, bọc bên ngoài cỗ quách bằng sắt; rồi lại dùng một cỗ quách bằng gỗ bao ngoài bằng lớp vải. Chất các củi thơm, phủ lên nhiều lớp vải. Sau đó thì hỏa táng.Ở ngã tư đường dựng tháp bảy báu, dọc ngang một do-tuần, xen kẽ nhiều màu sắc được tạo thành bởi bảy báu. Ở bốn mặt tháp, mỗi mặt có một cửa, bao quanh bằng lan can được làm bằng bảy báu. Khoảng đất trống chung quanh bốn mặt tháp dọc ngang năm do-tuần. Có bảy lớp tường bao quanh vườn, với bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây. Tường bằng vàng, cửa bằng bạc; tường bằng bạc, cửa bằng vàng. Tường lưu ly, cửa thủy tinh; tường thủy tinh, cửa lưu ly. Tường xích châu, cửa mã não; tường mã não, cửa xích châu. Tường xa cừ, cửa bằng các loại báu.",
        "“Về lan can, thanh ngang bằng vàng, thanh đứng bằng bạc; thanh đứng bằng bạc, thanh ngang bằng vàng. Thanh ngang thủy tinh, thanh đứng lưu ly; thanh đứng lưu ly, thanh ngang thủy tinh. Thanh ngang xích châu, thanh đứng mã não; thanh ngang mã não, thanh đứng xích châu. Thanh ngang bằng xa cừ, thanh đứng bằng các thứ báu khác.",
        "“Dưới lớp lưới bằng vàng treo linh bằng bạc, lưới bạc treo linh vàng. Dưới lưới lưu ly treo linh thủy tinh, dưới lưới thủy tinh treo linh lưu ly. Dưới lưới xích châu treo linh mã não, dưới lưới mã não treo linh xích châu. Dưới lưới xa cừ treo linh bằng các thứ báu khác.",
        "“Cây bằng vàng thì lá, hoa, trái bằng bạc. Cây bạc thì lá, hoa, trái vàng. Cây lưu ly, hoa lá thủy tinh; cây thủy tinh, hoa lá lưu ly. Cây xích châu, hoa lá mã não; cây mã não, hoa lá xích châu. Cây xa cừ, hoa lá bằng các thứ báu khác.",
        "“Bốn vách tường của vườn lại có bốn cửa, bao quanh bằêng lan can. Trên tường đều có lầu các, đài báu. Bốn mặt tường có các vườn cây, suối, hồ tắm, sinh nhiều loại hoa khác nhau; cây cối sầm uất, hoa trái xum xuê, các loại hương thơm sực nức. Nhiều giống chim lạ ca hót điệu buồn. Khi tháp được dựng xong, báu ngọc nữ, báu cư sĩ, báu điển binh, và sĩ dân cả nước đều đến cúng dường tháp này. Họ bố thí cho những người nghèo khốn, cần ăn thì cho ăn; cần mặc thì cho mặc. Voi, ngựa, xe cộ, các thứ cần dùng đều được chu cấp, tùy ý mà cho.",
        "“Công đức oai thần của Chuyển luân Thánh vương, sự tích là như vậy.”"
    ]
}