{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "30. KINH THẾ KÝ - PHẨM 04 : ĐỊA NGỤC",
        "Số Phẩm": "PHẦN 3",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Phật bảo các Tỳ-kheo:",
        "“Bên ngoài của bốn châu thiên hạ này, có tám nghìn thiên hạ bao quanh. Lại có biển lớn bao quanh tám nghìn thiên hạ. Kế đó có núi Đại Kim cang bao bọc biển lớn. Bên ngoài núi Đại Kim cang này lại có núi Đại Kim cang thứ hai. Giữa hai núi này là một cảnh giới mờ mịt, tối tăm; mặt trời, mặt trăng, các vị thần, trời dù có uy lực cũng không thể dùng ánh sáng soi chiếu đến đó được.",
        "“Ở nơi này có tám địa ngục lớn , mỗi địa ngục lớn có mười sáu địa ngục nhỏ. Địa ngục lớn thứ nhất gọi là Tưởng. Thứ hai là địa ngục Hắc thằng. Thứ ba là địa ngục Đôi áp . Thứ tư là địa ngục Khiếu hoán . Thứ năm là địa ngục Đại khiếu hoán . Thứ sáu là địa ngục Thiêu chích . Thứ bảy là địa ngục Đại thiêu chích . Thứ tám là địa ngục Vô gián",
        "“Trong địa ngục Tưởng có mười sáu ngục nhỏ , mỗi địa ngục nhỏ ngang dọc năm trăm do-tuần. Ngục nhỏ thứ nhất là Hắc sa, hai là Phất thỉ, ba là Ngũ bách đinh, bốn là Cơ, năm là Khát, sáu là một Đồng phủ, bảy là Đa đồng phủ, tám là Thạch ma, chín là Nùng huyết, mười là Lượng hỏa, mười một là Hôi hà, mười hai là Thiết hoàn, mười ba là Cân phủ mười bốn là Sài lang, mười lăm là Kiếm thọ, mười sáu là Hàn băng.",
        "“Vì sao gọi là địa ngục Tưởng? Vì chúng sanh ở trong đó, trên tay của chúng mọc móng sắt; móng này vừa dài vừa bén. Chúng thù hận nhau, luôn có ý tưởng độc hại, dùng móng tay cào cấu lẫn nhau, chạm tay vào chỗ nào là chỗ đó thịt rớt xuống, tưởng là đã chết; có cơn gió lạnh thổi đến, da thịt sinh ra trở lại, giây lát chúng sống lại, đứng dậy, tự mình có ý tưởng rằng: ‘Ta nay đã sống lại.’ Chúng sanh khác nói: ‘Ta có ý tưởng ngươi đang sống.’ Vì sự tưởng này cho nên gọi là địa ngục Tưởng",
        "“Lại nữa, chúng sanh ở trong địa ngục Tưởng này, lúc nào cũng nghĩ đến sự độc hại, phá hại lẫn nhau. Tay họ cầm một loại đao kiếm tự nhiên, vừa nhọn vừa bén, đâm chém lẫn nhau, lóc da xẻ thịt, bằm nát thân thể rớt xuống đất, và họ tưởng mình đã chết, nhưng bỗng một cơn gió lạnh thổi đến, da thịt sanh ra lại, làm cho họ sống lại đứng dậy, tự nghĩ và nói: ‘Ta nay đã sống lại.’ Chúng sanh khác nói: ‘Ta cũng nghĩ là ngươi đã sống lại.’ Vì lý do đó nên gọi là địa ngục Tưởng.",
        "“Lại nữa, những chúng sanh ở trong địa ngục Tưởng đó, lúc nào cũng ôm trong lòng ý tưởng độc hại; chúng quấy phá lẫn nhau. Tay chúng cầm một loại đao kiếm tự nhiên , vừa nhọn vừa bén, đâm chém lẫn nhau, lóc da xẻ thịt, thân thể rã rời dưới đất, tưởng là đã chết, nhưng một cơn gió lạnh thổi đến, da thịt sanh ra lại, giây lát sống lại, đứng dậy, tự có ý tưởng rằng: ‘Ta nay đã sống lại.’ Chúng sanh khác nói: ‘Ta có ý tưởng ngươi đang sống.’ Vì lý do đó nên gọi là địa ngục Tưởng.",
        "“Lại nữa, địa ngục Tưởng là nơi mà những chúng sanh lúc nào cũng ôm lòng độc hại, quấy phá lẫn nhau. Tay chúng cầm một loại đao kiếm, vừa nhọn vừa bén, đâm chém lẫn nhau, lóc da xẻ thịt, và tưởng là đã chết, nhưng bỗng một cơn gió lạnh thổi đến, da thịt sanh ra lại, giây lát sống lại đứng dậy, tự có ý tưởng rằng: ‘Ta nay đã sống lại.’ Chúng sanh khác nói: ‘Ta có ý tưởng ngươi đang sống.’ Vì lý do đó nên gọi là địa ngục Tưởng.",
        "“Lại nữa, địa ngục Tưởng là nơi mà những chúng sanh lúc nào cũng ôm ý tưởng độc hại, quấy phá lẫn nhau. Tay chúng cầm một loại dao bóng dầu , vừa nhọn vừa bén, đâm chém lẫn nhau, lóc da xẻ thịt, tưởng là đã chết, nhưng bỗng một cơn gió lạnh thổi đến, da thịt sanh ra lại, giây lát sống lại, đứng dậy, tự có ý tưởng rằng: ‘Ta nay đã sống lại.’ Chúng sanh khác nói: ‘Ta có ý tưởng ngươi đang sống.’ Vì lý do đó nên gọi là địa ngục Tưởng.",
        "“Lại nữa, địa ngục Tưởng là nơi mà những chúng sanh lúc nào cũng ôm ý tưởng độc hại, quấy phá lẫn nhau. Tay chúng cầm một loại dao nhỏ, vừa nhọn vừa bén, đâm chém lẫn nhau, lóc da xẻ thịt, tưởng là đã chết, nhưng bỗng một cơn gió lạnh thổi đến, da thịt sanh ra lại, giây lát sống lại, đứng dậy, tự mình có ý tưởng rằng: ‘Ta nay đã sống lại.’ Chúng sanh khác nói: ‘Ta có ý tưởng ngươi đang sống.’ Vì lý do đó nên gọi là địa ngục Tưởng.",
        "“Những chúng sanh ở trong đó, sau khi chịu khổ lâu, ra khỏi địa ngục Tưởng, hoảng hốt chạy càn để tự cứu mình. Nhưng vì tội quá khứ lôi kéo, nên bất ngờ lại đến địa ngục Hắc sa. Bấy giờ, có một cơn gió nóng dữ dội bốc lên, thổi cát đen nóng dính vào thân nó, khiến toàn thân đều đen, giống như đám mây đen. Cát nóng đốt da, hết thịt, vào tận xương. Sau đó, trong thân tội nhơn có một ngọn lửa đen bộc phát, đốt cháy quanh thân rồi vào bên trong, chịu các khổ não, bị thiêu nướng, cháy nám. Vì nhân duyên tội, nên chịu khổ báo này. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian, chịu khổ khá lâu ở trong đó, nó ra khỏi địa ngục Hắc sa, hoảng hốt chạy càn, để tự cứu mình. Nhưng vì tội quá khứ lôi kéo, nên bất ngờ lại đến địa ngục Phất thỉ. Trong địa ngục này có những hòn sắt là phân sôi tự nhiên đầy dẫy trước mặt, đuổi bức tội nhơn phải ôm hòn sắt nóng, đốt cháy thân và tay, đến đầu và mặt tội nhơn; không đâu là không bị đốt cháy; lại khiến cho tội nhơn bốc hòn sắt bỏ vào miệng, đốt cháy cả môi, lưỡi, từ yết hầu đến bụng, từ trên đến dưới đều bị cháy tiêu hết. Có một loài trùng mỏ sắt ăn da thịt, tận cả xương tủy, đau đớn nhức nhối, lo sợ vô cùng. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian, chịu khổ lâu ở trong địa ngục Phất thỉ, tội nhơn ra khỏi địa ngục này, hoảng hốt chạy càn, để tự cứu mình, không ngờ lại đến địa ngục Thiết đinh . Sau khi đã vào đó, ngục tốt đánh tội nhân cho té xuống, nằm mọp trên sắt nóng, căng thẳng thân thể nó ra, dùng đinh đóng tay, đóng chân, đóng vào tim. Toàn thân bị đóng hết thảy năm trăm cái đinh. Nó đau đớn nhức nhối, kêu la rên xiết. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian, chịu khổ lâu, tội nhơn ra khỏi địa ngục Thiết đinh, hoảng hốt chạy càn, để tự cứu mình, không ngờ lại đến địa ngục Đói. Ngục tốt đến hỏi: ‘Các người đến đây muốn điều gì?’ Tội nhơn đáp: ‘Tôi đói quá.’ Tức thì ngục tốt bắt tội nhơn quăng lên bàn sắt nóng, căng thân thể ra, dùng móc câu cạy miệng cho mở ra, rồi lấy hòn sắt nóng bỏ vào trong miệng, đốt cháy môi lưỡi, từ cổ cho đến bụng, chạy tuốt xuống dưới, không chỗ nào không đốt cháy, đau rát nhức nhối, khóc la rên xiết. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian, chịu khổ lâu, tội nhơn ra khỏi địa ngục Đói, hoảng hốt chạy càn, để tự cứu mình, không ngờ lại đến địa ngục Khát. Ngục tốt liền hỏi: ‘Các ngươi đến đây, muốn cầu điều gì?’ Tội nhơn đáp: ‘Tôi khát quá.’ Ngục tốt liền bắt tội nhơn quăng lên bàn sắt nóng, căng thân thể ra rồi dùng móc câu cạy miệng tội nhơn ra, lấy nước đồng sôi rót vào trong miệng đốt cháy môi, lưỡi, từ cổ cho đến bụng, suốt từ trên xuống dưới, không chỗ nào không đốt cháy, đau rát nhức nhối, khóc la rên xiết. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian, chịu khổ lâu, tội nhơn ra khỏi địa ngục Khát, hoảng hốt chạy càn, để tự cứu mình, không ngờ lại đến địa ngục một Đồng phúc . Ngục tốt trợn mắt giận dữ, nắm chân tội nhơn ném vào trong vạc đồng, theo nước sôi sùng sục, trồi lên hụp xuống, từ đáy đến miệng, rồi từ miệng cho đến đáy, hoặc ở giữa vạc, cả thân thể bị nấu nhừ. Cũng như nấu đậu, hạt đậu tùy theo nước sôi, trào lên lộn xuống, các hạt đậu cả trong ngoài đều được nấu nhừ. Tội nhơn trồi lên sụp xuống trong vạc dầu sôi cũng như vậy. Kêu gào bi thảm, hàng vạn độc hại cùng đến; nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian, chịu khổ lâu, tội nhơn ra khỏi địa ngục một Đồng phúc, hoảng hốt chạy càn, để tự cứu mình, nhưng bị tội đời trước lôi kéo, bất ngờ lại rơi vào địa ngục Đa đồng phúc. Địa ngục này ngang dọc năm trăm do-tuần. Ngục tốt trợn mắt giận dữ, nắm chân tội nhơn ném vào trong vạc đồng, theo nước sôi sùng sục, trồi lên hụp xuống, từ đáy đến miệng, rồi từ miệng cho đến đáy, hoặc ở giữa vạc, cả thân thể bị nấu nhừ. Cũng như nấu đậu, hạt đậu tùy theo nước sôi, trào lên lộn xuống, các hạt đậu cả trong ngoài đều được nấu nhừ. Tội nhơn trồi lên sụp xuống trong vạc dầu sôi cũng như vậy, tùy theo nước sôi mà trồi lên sụp xuống, từ miệng vạc cho đến đáy vạc, rồi từ đáy cho đến miệng, hoặc tay chân nổi lên, hoặc lưng bụng nổi lên, hoặc đầu mặt nổi lên. Ngục tốt dùng lưỡi câu móc để trong vạc đồng khác. Nó kêu khóc thảm thiết, đau đớn nhức nhối. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian, chịu khổ lâu, tội nhơn ra khỏi địa ngục Đa đồng phúc, hoảng hốt chạy càn, để tự cứu mình, nhưng bị tội đời trước lôi kéo, không ngờ lại rơi vào địa ngục Thạch ma. Địa ngục này ngang dọc năm trăm do-tuần. Ngục tốt thịnh nộ, bắt tội nhơn quăng lên tảng đá nóng, căng tay chân ra, dùng đá tảng nóng lớn đè trên thân tội nhơn, mài tới mài lui làm cho xương nát vụn, máu mủ chảy ra, đau đớn nhức nhối, khóc la thảm thiết. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian, chịu khổ lâu, tội nhơn ra khỏi địa ngục Thạch ma, hoảng hốt chạy càn, để tự cứu mình, nhưng bị tội đời trước lôi kéo, không ngờ lại rơi vào địa ngục Nùng huyết. Địa ngục này ngang dọc năm trăm do tuần. Trong địa ngục này tự nhiên có máu mủ nóng sôi sục trào vọt. Tội nhơn ở trong đó chạy Đông, chạy Tây, bị máu mủ sôi nóng luộc chín toàn thân, đầu, mặt, tay, chân, tất cả đều nát nhừ. Tội nhơn còn phải ăn máu mủ nóng, miệng, môi đều bị bỏng, từ cổ cho đến bụng, suốt trên xuống dưới không chỗ nào không nát nhừ, đau đớn nhức nhối, không thể chịu nổi. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian, chịu khổ lâu, tội nhơn ra khỏi địa ngục Nùng huyết, hoảng hốt chạy càn, để tự cứu mình, nhưng bị tội đời trước lôi kéo, không ngờ lại rơi vào địa ngục Lượng hỏa. Địa ngục này ngang dọc năm trăm do tuần. Trong địa ngục này có một đống lửa lớn, tự nhiên xuất hiện trước mặt, lửa cháy hừng hực. Ngục tốt hung dữ, bắt tội nhơn tay cầm cái đấu bằng sắt, để đong đống lửa ấy. Khi họ đong lửa, thì lửa đốt cháy tay chân và cả toàn thân, họ đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian, chịu khổ lâu, tội nhơn ra khỏi địa ngục Lượng hỏa, hoảng hốt chạy càn, để tự cứu mình, nhưng bị tội đời trước lôi kéo, không ngờ lại rơi vào địa ngục Hôi hà. Địa ngục này ngang dọc năm trăm do-tuần, sâu năm trăm do-tuần. Tro sôi sùng sục, độc khí xông lên phừng phực, các dòng xoáy vỗ nhau, âm vang thật đáng sợ, từ đáy lên bên trên có gai sắt dọc ngang với mũi nhọn dài tám tấc. Bên bờ sông lại có một loại dao kiếm dài, có cả ngục tốt, sài lang. Hai bên bờ sông mọc những đao kiếm dài, nhánh, lá, hoa, trái đều là đao kiếm, vừa nhọn vừa bén, cỡ tám tấc, đứng bên là những ngục tốt, sài lang. Trên bờ sông có rừng mà cây là gươm với cành, lá, hoa, trái đều là đao kiếm, mũi nhọn tám tấc. Tội nhơn vào trong sông, tùy theo lượn sóng lên xuống, mà trồi lên hụp xuống. Toàn thân đều bị gai sắt đâm thủng từ trong ra ngoài, da thịt nát bét, máu mủ dầm dề, đau đớn muôn chiều, kêu la thảm thiết. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục Hôi hà, lên được trên bờ, nhưng ở trên bờ lại có nhiều gươm dáo sắc bén đâm thủng toàn thân, tay chân bị thương tổn. Bấy giờ quỷ sứ hỏi tội nhơn: ‘Các ngươi đến đây muốn cầu điều chi? Tội nhơn đáp: ‘Chúng tôi đói quá.’ Ngục tốt liền bắt tội nhơn quăng lên sắt nóng, căng thân thể ra rồi dùng móc câu cạy miệng tội nhơn ra, lấy nước đồng sôi rót vào, cháy bỏng môi, lưỡi, từ cổ đến bụng, suốt trên xuống dưới, không chỗ nào không rục. Lại có loài lang sói răng nanh vừa dài vừa bén đến cắn tội nhơn, ăn thịt khi tội nhơn đang sống. Rồi thì, tội nhơn bị sông tro đun nấu, bị gai nhọn đâm thủng, bị rót nước đồng sôi vào miệng, và bị sài lang ăn thịt xong, thì lại leo lên rừng kiếm; khi leo lên rừng kiếm thì bị đao kiếm chỉa xuống; khi tuột xuống rừng kiếm thì bị đao kiếm chỉa lên, khi tay nắm thì cụt tay, chân dẫm lên thì cụt chân; mũi nhọn đâm thủng toàn thân từ trong ra ngoài, da thịt rơi xuống, máu mủ đầm đìa, chỉ còn xương trắng, gân cốt liên kết với nhau. Bấy giờ, trên cây kiếm có một loại quạ mỏ sắt đến mổ nát đầu và xương để ăn não của tội nhơn. Nó đau đớn nhức nhối kêu la thảm thiết. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được, lại bị trở lại địa ngục Hôi hà. Tội nhơn này theo lượn sóng lên xuống, mà trồi lên sụp xuống, gươm dáo đâm thủng toàn thân trong ngoài, da thịt tan nát, máu mủ đầm đìa, chỉ còn xương trắng trôi nổi bên ngoài. Bấy giờ, có một cơn gió lạnh thổi đến làm cho da thịt phục hồi, giây lát nó đứng dậy đi, hoảng hốt chạy càn, để tự cứu mình, nhưng vì tội quá khứ lôi kéo, tội nhơn lại không ngờ sa vào địa ngục Thiết hoàn. Địa ngục này ngang dọc năm trăm do-tuần. Khi tội nhơn vào đây, thì tự nhiên có những hòn sắt nóng hiện ra trước mặt. Ngục quỷ cưỡng bức tội nhân nắm bắt, tay chân rã rời, toàn thân lửa đốt, đau đớn kêu la thảm, muôn vàn khổ độc dồn đến chết. Nhưng vì tội chưa hết, nên khiến cho tội nhơn không chết được.",
        "“Sau một thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục Thiết hoàn, hoảng hốt chạy càn, để tự cứu mình; nhưng vì bị tội quá khứ lôi kéo, tội nhơn bất ngờ lại sa vào địa ngục Cân phủ. Địa ngục này ngang dọc năm trăm do-tuần. Khi tội nhơn vào địa ngục này, ngục tốt hung dữä, bắt tội nhơn để trên bàn sắt nóng, dùng búa rìu bằng sắt nóng chặt thân thể, tay, chân, cắt tai, xẻo mũi, làm cho đau đớn nhức nhối, kêu la thảm thiết; nhưng vì tội chưa hết, nên họ không chết được.",
        "“Sau một thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục Cân phủ, hoảng hốt chạy càn, để tự cứu mình; nhưng vì bị tội quá khứ lôi kéo, tội nhơn không ngờ lại sa vào địa ngục Sài lang. Địa ngục này ngang dọc năm trăm do-tuần. Khi tội nhơn vào địa ngục này, thì có bầy lang sói tranh nhau cắn xé tội nhơn, làm cho da thịt nhầy nhụa, xương gãy, thịt rơi, máu chảy đầm đìa, làm đau đớn muôn vàn, kêu la thảm thiết; nhưng vì tội cũ chưa hết, nên họ không chết được.",
        "“Sau một thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục Sài lang, hoảng hốt chạy càn, mong cầu cứu hộ; nhưng vì bị tội quá khứ lôi kéo, tội nhơn bất ngờ lại sa vào địa ngục Kiếm thọ. Địa ngục này ngang dọc năm trăm do-tuần. Khi tội nhơn vào địa ngục này, thì có một cơn gió mãnh liệt, thổi lá cây bằng gươm dao rớt trên thân thể tội nhơn, hễ chạm vào tay thì cụt tay, dính vào chân thì cụt chân, thân thể, đầu mặt không đâu là không bị thương hoại. Có một loại quạ mỏ sắt, đứng trên đầu mổ đôi mắt tội nhơn, làm cho đau đớn muôn vàn, kêu la thảm thiết; nhưng vì tội cũ chưa hết, nên không chết được.",
        "“Sau một thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục Kiếm thọ, hoảng hốt chạy càn, mong cầu cứu hộ; nhưng vì bị tội quá khứ lôi kéo, tội nhơn bất ngờ lại sa vào địa ngục Hàn băng. Địa ngục này ngang dọc năm trăm do-tuần. Khi tội nhơn vào địa ngục này, thì có một cơn gió lạnh buốt, thổi đến làm cho thân thể bị lạnh cóng, máu huyết đông đặc, da thịt nứt nẻ, rớt ra từng mảnh, làm họ đau đớn vô cùng, kêu la thảm thiết. Sau đó thì mạng chung.” Phật bảo các Tỳ-kheo:",
        "“Địa ngục lớn Hắc thằng có mười sáu địa ngục nhỏ bao bọc chung quanh, mỗi địa ngục ngang dọc năm trăm do tuần. Vì sao gọi là địa ngục Hắc thằng? Vì ở đó các ngục tốt bắt tội nhơn quăng lên bàn sắt nóng, căng thân hình ra rồi dùng sợi dây sắt kéo ra cho thẳng, rồi dùng búa bằng sắt nóng xẻ theo đường sợi dây, xẻ tội nhơn kia thành trăm nghìn đoạn. Giống như thợ mộc dùng dây kẻ vào cây rồi dùng búa bén theo đường mực mà bổ ra thành trăm nghìn đoạn, thì cách hành hạ tội nhơn ở đây cũng như vậy, đau đớn vô cùng, không thể diễn tả hết được. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì thế nên gọi là địa ngục Hắc thằng.",
        "“Lại nữa, ngục tốt ở địa ngục Hắc thằng bắt tội nhơn quăng lên bàn sắt nóng, căng thân hình ra, dùng dây sắt nóng kéo ra cho thẳng, dùng cưa để cưa tội nhơn. Giống như người thợ mộc dùng dây mực kẻ trên thân cây, rồi dùng cưa để cưa cây, thì cách hành hạ tội nhơn ở đây cũng như vậy, đau đớn vô cùng, không thể diễn tả hết được. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì thế gọi là địa ngục Hắc thằng.",
        "“Lại nữa, ngục tốt ở địa ngục Hắc thằng bắt tội nhơn quăng lên bàn sắt nóng, căng thân thể ra, dùng dây sắt nóng để trên thân tội nhơn, làm cho da thịt bị thiêu đốt, tiêu xương chảy tủy đau đớn vô cùng, không thể diễn tả hết được. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì thế gọi là địa ngục Hắc thằng.",
        "“Lại nữa, ngục tốt ở địa ngục Hắc thằng dùng vô số dây sắt nóng treo ngang, rồi bắt tội nhơn đi giữa những sợi dây này, lúc đó lại có cơn gió lốc nổi lên, thổi những sợi dây sắt nóng quấn vào thân, đốt cháy da thịt, tiêu xương chảy tủy đau đớn vô cùng, không thể diễn tả hết được. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì thế gọi là địa ngục Hắc thằng.",
        "“Lại nữa, ngục tốt ở trong địa ngục Hắc thằng buộc tội nhơn mặc áo bằng dây sắt nóng, đốt cháy da thịt, tiêu xương chảy tủy đau đớn vô cùng, không thể diễn tả hết được. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì thế gọi là địa ngục Hắc thằng.",
        "“Sau thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục Hắc thằng, hoảng hốt chạy càn, mong cầu cứu hộ; nhưng vì bị tội quá khứ lôi kéo, tội nhơn bất ngờ lại sa vào địa ngục Hắc sa… cho đến địa ngục Hàn băng. Sau đó thì tội nhơn mạng chung.”",
        "Phật bảo các Tỳ-kheo:",
        "“Địa ngục lớn Đôi áp có mười sáu địa ngục nhỏ bao bọc chung quanh; mỗi ngục nhỏ ngang dọc năm trăm do tuần. Vì sao gọi là địa ngục Đôi áp? Vì trong ngục đó có núi đá lớn, từng cặp đối nhau. Khi tội nhơn vào giữa thì hai hòn núi tự nhiên khép lại, ép thân thể tội nhơn, xương thịt nát vụn, xong rồi trở lại vị trí cũ, giống như hai thanh củi cọ vào nhau, khi cọ xong dang ra, thì cách trị tội nhơn của địa ngục này cũng như vậy, đau đớn vô cùng, không thể diễn tả hết được. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đôi áp.",
        "“Lại nữa, ở địa ngục Đôi áp, có voi sắt lớn, toàn thân bốc lửa, vừa kêu rống, vừa chạy đến dày xéo thân thể tội nhơn, dẫm đi dẫm lại, làm cho thân thể bị nghiền nát, máu mủ tuôn chảy, đau đớn muôn vàn, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đôi áp.",
        "“Lại nữa, các ngục tốt ở địa ngục Đôi áp, bắt tội nhơn đặt lên bàn đá mài, rồi lấy đá mài mà mài, làm cho xương thịt vụn nát, máu mủ chảy dầm dề, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đôi áp.",
        "“Lại nữa, các ngục tốt ở địa ngục Đá ép, bắt tội nhơn nằm trên tảng đá lớn, rồi lấy một tảng đá khác đè lên, làm cho xương thịt vụn nát, máu mủ chảy đầm đìa, đau đớn nhức nhối, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đôi áp.",
        "“Lại nữa, các ngục tốt ở địa ngục Đôi áp, bắt tội nhơn nằm trong các cối sắt, rồi dùng chày sắt để giã tội nhơn, từ đầu đến chân, làm cho xương thịt vụn nát, máu mủ chảy đầm đìa, đau đớn nhức nhối, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đôi áp.",
        "“Sau thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục Đôi áp, hoảng hốt chạy càn, mong cầu cứu hộ; nhưng vì bị tội quá khứ lôi kéo, tội nhơn bất ngờ lại sa vào địa ngục Hắc sa… cho đến địa ngục Hàn băng, rồi sau đó thì tội nhơn mạng chung.”",
        "Phật bảo các Tỳ-kheo:",
        "“Địa ngục lớn Khiếu hoán có mười sáu địa ngục nhỏ bao quanh; mỗi ngục nhỏ ngang dọc năm trăm do-tuần. Vì sao gọi là địa ngục Khiếu hoán? Vì các ngục tốt trong ngục này bắt tội nhơn bỏ vào trong vạc lớn, với nước nóng sôi sục, nấu nhừ tội nhơn, khiến chúng kêu la gào thét, đau đớn nhức nhối, muôn vàn độc hại. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Khiếu hoán.",
        "“Lại nữa, ngục tốt ở địa ngục Khiếu hoán bắt tội nhơn bỏ vào trong vò sắt lớn, dùng nước nóng sôi sục, nấu nhừ tội nhơn, khiến chúngï đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Khiếu hoán.",
        "“Lại nữa, ngục tốt ở địa ngục Khiếu hoán bắt tội nhơn bỏ vào trong nồi sắt lớn, dùng nước nóng sôi sục, nấu nhừ tội nhơn, khiến họ đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì thế nên gọi là địa ngục Khiếu hoán.",
        "“Lại nữa, ngục tốt ở địa ngục Khiếu hoán bắt tội nhơn ném vào trong nồi nhỏ, dùng nước nóng sôi sục, nấu nhừ tội nhơn, khiến chúng đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Khiếu hoán.",
        "“Lại nữa, ngục tốt ở địa ngục Khiếu hoán bắt tội nhơn bỏ lên trên cái nồi hầm, hầm đi hầm lại, khiến cho kêu gào, la thét, đau đớn vô cùng. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Khiếu hoán.",
        "“Sau thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục này, hoảng hốt chạy càn, mong cầu cứu hộ; nhưng vì bị tội quá khứ lôi kéo, tội nhơn không ngờ lại sa vào địa ngục Hắc sa … cho đến địa ngục Hàn băng, và sau đó thì tội nhơn mạng chung.”",
        "Phật bảo các Tỳ-kheo:",
        "“Địa ngục Đại khiếu hoán lớn có mười sáu địa ngục nhỏ bao quanh; mỗi ngục nhỏ ngang dọc năm trăm do-tuần. Vì sao gọi là địa ngục Đại khiếu hoán?",
        "Vì các ngục tốt trong ngục này bắt tội nhơn bỏ vào trong nồi sắt lớn, dùng nước nóng sôi sục, nấu nhừ tội nhơn, khiến chúng kêu la gào thét, khóc lóc thảm thiết, đau đớn vô cùng. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đại khiếu hoán.",
        "“Lại nữa, ngục tốt ở địa ngục Đại khiếu hoán bắt tội nhơn bỏ vào trong vò sắt lớn, dùng nước sôi sùng sục, nấu nhừ tội nhơn, khiến họ đau đớn vô cùng. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đại khiếu hoán",
        "“Lại nữa, ngục tốt ở địa ngục Đại khiếu hoán bắt tội nhơn bỏ vào trong vạc sắt, dùng nước sôi sùng sục, nấu nhừ tội nhơn, khiến chúng đau đớn vô cùng. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đại khiếu hoán.",
        "“Lại nữa, ngục tốt ở địa ngục Đại khiếu hoán bắt tội nhơn bỏ vào trong nồi nhỏ, dùng nước sôi sùng sục, nấu nhừ tội nhơn, khiến chúng đau đớn vô cùng. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đại khiếu hoán. “Lại nữa, ngục tốt ở địa ngục Đại khiếu hoán, bắt tội nhơn ném lên trên chảo lớn, rồi trở qua trở lại tội nhơn, khiến kêu la gào thét, kêu la lớn, đau đớn vô cùng. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đại khiếu hoán.",
        "“Sau thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục này, hoảng hốt chạy càn, mong cầu cứu hộ; nhưng vì bị tội quá khứ lôi kéo, tội nhơn bất ngờ lại sa vào địa ngục Hắc sa… cho đến địa ngục Hàn băng, rồi sau đó thì tội nhơn mạng chung.”",
        "Phật bảo các Tỳ-kheo:",
        "“Địa ngục lớn Thiêu chích, có mười sáu địa ngục nhỏ bao bọc chung quanh. Vì sao gọi là địa ngục lớn Thiêu chích? Vì các ngục tốt trong địa ngục đó bắt tội nhơn vào trong thành sắt. Thành này bốc cháy, cả trong lẫn ngoài đều đỏ rực, thiêu nướng tội nhơn, da thịt tiêu tan, đau đớn vô cùng kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy gọi là địa ngục Thiêu chích.",
        "“Lại nữa, ngục tốt ở địa ngục này, bắt tội nhơn bỏ vào trong nhà sắt, rồi cho nhà này bốc cháy, trong ngoài đều đỏ rực, thiêu nướng tội nhơn, da thịt tiêu tan, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Thiêu chích.",
        "“Lại nữa, ngục tốt ở địa ngục này, bắt tội nhơn bỏ vào trên lầu sắt, rồi cho lầu bốc cháy, trong ngoài đỏ rực, thiêu nướng tội nhơn, da thịt tiêu tan, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Thiêu chích.",
        "“Lại nữa, ngục tốt ở địa ngục này, bắt tội nhơn bỏ vào trong lò gốm sắt lớn, rồi cho lò này cháy, trong ngoài đỏ rực, thiêu nướng tội nhơn, da thịt tiêu tan, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Thiêu chích.",
        "“Lại nữa, ngục tốt ở địa ngục này, bắt tội nhơn bỏ vào trong nồi hầm lớn, rồi cho nồi này bốc cháy, trong ngoài đều đỏ rực, thiêu nướng tội nhơn, da thịt tiêu tan, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Thiêu chích.",
        "“Sau thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục này, hoảng hốt chạy càn, mong cầu cứu hộ; nhưng vì bị tội quá khứ lôi kéo, tội nhơn bất ngờ lại sa vào địa ngục Hắc sa… cho đến địa ngục Hàn băng, và sau đó thì tội nhơn mạng chung.”",
        "Phật bảo các Tỳ-kheo:",
        "“Địa ngục Đại thiêu chích có mười sáu địa ngục nhỏ bao bọc chung quanh; mỗi ngục nhỏ ngang dọc năm trăm do tuần. Vì sao gọi là địa ngục Đại thiêu chích? Vì các ngục tốt trong địa ngục này, bắt tội nhơn vào trong thành sắt, rồi cho thành này bốc cháy, cả trong lẫn ngoài đều đỏ rực, thiêu nướng tội nhơn, thiêu nướng nhiều lần, da thịt tiêu tan, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đại thiêu chích.",
        "“Lại nữa, ngục tốt ở địa ngục này, bắt tội nhơn bỏ vào trong nhà sắt, rồi cho nhà này bốc cháy, trong ngoài đều đỏ rực, thiêu nướng tội nhơn, thiêu nướng nhiều lần, da thịt tiêu tan, khiến họ đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Thiêu nướng lớn.",
        "“Lại nữa, ngục tốt ở địa ngục này, bắt tội nhơn bỏ vào trên lầu sắt, rồi cho lầu bốc cháy, trong ngoài đỏ rực, thiêu nướng tội nhơn, thiêu nướng nhiều lần, da thịt tiêu tan, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đại thiêu chích.",
        "“Lại nữa, ngục tốt ở địa ngục này, bắt tội nhơn bỏ vào trong lò gốm sắt lớn, rồi cho lò này bốc cháy, trong ngoài đều đỏ rực, thiêu nướng tội nhơn, thiêu nướng nhiều lần, da thịt tiêu tan, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đại thiêu chích.",
        "“Lại nữa, ở địa ngục này, thiêu nướng nhiều lần, tự nhiên có hầm lửa lớn, lửa cháy phừng phừng, hai bên bờ hầm có núi lửa lớn. Các ngục tốt ở đây bắt tội nhơn ghim vào trên chỉa sắt, rồi dựng đứng trong lửa đỏ, làm cho thân thể bị thiêu nướng, thiêu nướng nhiều lần, da thịt tiêu tan, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Đại thiêu chích.",
        "“Sau thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục này, hoảng hốt chạy càn, mong cầu cứu hộ; nhưng vì bị tội quá khứ lôi kéo, tội nhơn bất ngờ lại sa vào địa ngục Hắc sa… cho đến địa ngục Hàn băng, và sau đó thì tội nhơn mạng chung.”",
        "Phật bảo các Tỳ-kheo:",
        "“Địa ngục lớn Vô gián, có mười sáu địa ngục nhỏ bao bọc chung quanh, mỗi địa ngục ngang dọc năm trăm do tuần. Vì sao gọi là địa ngục lớn Vô gián? Vì các ngục tốt trong địa ngục này, bắt tội nhơn lột da từ đầu đến chân, rồi dùng da ấy cột thân tội nhơn vào bánh xe lửa, rồi cho xe lửa chạy đi chạy lại trên nền sắt nóng, làm cho thân thể nát tan, da thịt rời ra từng mảnh, khiến đau đớn vô cùng kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Vô gián.",
        "“Lại nữa, ở địa ngục này, có thành sắt lớn , bốn mặt thành lửa cháy dữ dội, ngọn lửa từ Đông lan sang Tây, ngọn lửa từ Tây lan sang Đông, ngọn lửa từ Nam lan đến Bắc, ngọn lửa từ Bắc lan đến Nam, ngọn lửa từ trên lan xuống dưới, ngọn lửa từ dưới lan lên trên, lửa cháy vòng quanh, không có một chỗ nào trống. Tội nhơn ở trong đây cứ chạy Đông chạy Tây, toàn thân bị thiêu nướng, da thịt cháy nám, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Vô gián.",
        "“Lại nữa, ở địa ngục Vô gián này có thành bằng sắt, lửa cháy hừng hực, tội nhơn bị lửa đốt thân, da thịt tiêu tan, đau đớn vô cùng, kêu la thảm thiết. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Vô gián.",
        "“Lại nữa, tội nhơn ở địa ngục Vô gián này, sau thời gian chịu khổ lâu, thì cửa mở, và tội nhơn liền chạy về hướng cửa mở, trong khi chạy thì các bộ phận của thân đều bốc lửa, cũng như chàng lực sĩ tay cầm bó đuốc lớn bằng cỏ, chạy ngược gió, lửa ấy cháy phừng phực, thì khi tội nhơn chạy lửa cũng bộc phát như vậy. Khi chạy đến gần cửa, thì tự nhiên cửa khép lại. Tội nhơn bò càng, nằm phục trên nền sắt nóng, toàn thân bị thiêu nướng, da thịt tiêu tan, đau đớn vô cùng, như muôn thứ độc cùng kéo đến một lúc. Nhưng vì tội cũ chưa hết, nên tội nhơn không thể chết được. Vì vậy nên gọi là địa ngục Vô gián.",
        "“Lại nữa, tội nhơn ở địa ngục Vô gián này, những gì mà mắt thấy, chỉ thấy toàn là màu ác; những gì tai nghe, toàn là âm thinh ác; những gì mũi ngửi, toàn là mùi thối ác; những gì thân xúc chạm, toàn là những sự đau đớn; những gì ý nhớ, chỉ nghĩ điều ác. Lại nữa, tội nhơn ở nơi đây, trong khoảnh khắc búng tay, không có một giây phút nào là không khổ. Vì vậy nên gọi là địa ngục Vô gián.",
        "“Sau thời gian chịu khổ lâu, tội nhơn ra khỏi địa ngục này, hoảng hốt chạy càn, mong cầu cứu hộ; nhưng vì bị tội quá khứ lôi kéo, tội nhơn bất ngờ lại sa vào địa ngục Hắc sa… cho đến địa ngục Hàn băng lạnh, và sau đó thì tội nhơn mạng chung.”",
        "Bấy giờ đức Thế Tôn liền nói bài kệ:",
        "Thân làm nghiệp bất thiện,",
        "Miệng, ý cũng bất thiện,",
        "Đều vào địa ngục Tưởng,  Sợ hãi, lông dựng đứng.",
        "Ý ác đối cha mẹ,",
        "Phật, và hàng Thinh văn,  Thì vào ngục Hắc thằng,  Khổ đau không thể tả.",
        "Chỉ tạo ba nghiệp ác,",
        "Không tu ba hạnh lành,  Thì vào ngục Đôi áp,  Khổ đau nào tả được.",
        "Ôm lòng sân độc hại,",
        "Sát sanh máu nhơ tay,  Tạo linh tinh hạnh ác,  Vào địa ngục Khiếu hoán.",
        "Thường tạo những tà kiến,",
        "Bị lưới ái phủ kín;  Tạo hạnh thấp hèn này,  Vào ngục Đại khiếu hoán.",
        "Thường làm việc thiêu nướng,",
        "Thiêu nướng các chúng sanh;  Sẽ vào ngục Thiêu chích,  Bị thiêu nướng luôn luôn. Từ bỏ nghiệp thiện quả,",
        "Quả thiện, đạo thanh tịnh;  Làm các hạnh tệ ác,  Vào ngục Đại thiêu chích. Tạo tác tội cực nặng,",
        "Tất sinh nghiệp đường ác;",
        "Vào địa ngục Vô gián,  Chịu tội không thể tả.",
        "Ngục Tưởng và Hắc thằng,",
        "Đôi áp, hai Khiếu hoán;  Thiêu chích Đại thiêu chích,  Vô gián là thứ tám.",
        "Tám địa ngục lớn này,",
        "Hoàn toàn rực màu lửa;  Tai họa do ác xưa,",
        "Có mười sáu ngục nhỏ.",
        "Phật bảo Tỳ-kheo:",
        "“Giữa hai ngọn núi Đại kim cương kia có cơn gió lớn trỗi lên, tên là Tăng-khư . Nếu như ngọn gió này thổi đến bốn châu thiên hạ, và tám mươi nghìn thiên hạ khác, thì gió sẽ thổi đại địa này và các danh sơn cùng chúa Tu-di bay khỏi mặt đất từ mười dặm cho đến trăm dặm, tung lên bay liệng giữa trời; tất cả thảy đều vỡ vụn. Giống như tráng sĩ tay nắm một nắm trấu nhẹ tung lên giữa hư không. Dưới ngọn gió lớn kia, giả sử thổi vào thiên hạ này, cũng giống như vậy. Vì có hai ngọn núi Đại kim cương ngăn chận ngọn gió ấy, nên gió không đến được. Này Tỳ-kheo, nên biết, hai ngọn núi Đại kim cương này có rất nhiều lợi ích, và cũng do nghiệp báo của chúng sanh chiêu cảm nên.",
        "“Lại nữa, gió ở khoảng giữa hai núi này nóng hừng hực; nếu như gió này thổi đến bốn châu thiên hạ, thì những chúng sanh trong đó, và những núi non, biển cả, sông ngòi, cây cối, rừng rậm đều sẽ bị cháy khô. Cũng như giữa cơn nắng mùa hè, cắt một nắm cỏ non để ngay dưới mặt trời, cỏ liền khô héo, thì ngọn gió kia cũng như vậy; nếu ngọn gió đó thổi đến thế giới này, thì sức nóng đó sẽ tiêu rụi tất cả. Vì có hai ngọn núi Kim cương này ngăn chận được ngọn gió đó, nên không thể đến đây được. Các Tỳ-kheo, nên biết, ngọn núi Kim cương này có rất nhiều lợi ích, và cũng do nghiệp báo của chúng sanh chiêu cảm nên vậy.",
        "“Lại nữa, gió giữa hai núi này hôi thối, bất tịnh, tanh tưởi nồng nặc; nếu như ngọn gió này thổi đến bốn châu thiên hạ này, thì sẽ xông lên làm cho chúng sanh bị mù lòa. Nhưng vì có hai núi Đại kim cương này ngăn chận nên ngọn gió ấy không thể đến được. Tỳ kheo, nên biết, núi Kim cương này có rất nhiều lợi ích, và cũng do nghiệp báo của chúng sanh chiêu cảm nên vậy.",
        "“Lại nữa, giữa hai núi này lại có mười địa ngục: một là Hậu vân, hai là Vô vân, ba là Ha ha, bốn là Nại hà, năm là Dương minh, sáu là Tu-càn-đề, bảy là Ưu-bát-la, tám là Câu-vật-đầu, chín là Phân-đà-lợi, mười là Bát-đầuma. Vì sao gọi là địa ngục Hậu vân. Vì tội nhơn trong ngục này tự nhiên sinh ra thân thể như đám mây dày, cho nên gọi là Hậu vân. Vì sao gọi là Vô vân? Vì chúng sanh chịu tội trong ngục này, tự nhiên thân thể sinh ra như một cục thịt nên gọi là Vô vân . Vì sao gọi là Ha ha? Vì chúng sanh chịu tội trong ngục này, thường thì thân thể đau đớn, rồi rên la ‘ối ối!’, nên gọi là Ha ha. Vì sao gọi là Nại hà? Vì chúng sanh chịu tội trong ngục này, thường thân thể đau khổ vô cùng, không có nơi nương tựa, nên thốt lên ‘Sao bây giờ!’, nên gọi là Nại hà! Vì sao gọi là Dương minh? Vì chúng sanh chịu tội trong ngục này, thường thân thể, đau đớn vô cùng, muốn thốt lên lời nhưng lưỡi không cử động được, chỉ giống như Dê kêu, nên gọi là Dương minh. Vì sao gọi là Tu-càn-đề . Vì trong ngục này chỉ toàn là màu đen, cũng như màu hoa Tu-càn-đề, nên gọi là Tu-càn-đề. Vì sao gọi là Ưu-bát-la? Vì trong ngục này chỉ toàn là màu xanh, như màu hoa ưu-bát-la, nên gọi là ưu-bát-la. Vì sao gọi là Câu-vật-đầu? Vì trong ngục này toàn là màu hồng, như màu hoa câuvật-đầu, nên gọi là câu-vật-đầu. Vì sao gọi là Phân-đà-lợi? Vì trong ngục này toàn là màu trắng, như màu hoa phânđà-lợi, nên gọi là phân-đà-lợi. Vì sao gọi là Bát-đầu-ma? Vì trong ngục này toàn là màu đỏ, cũng như màu hoa bátđầu-ma, nên gọi là bát-đầu-ma.” Phật bảo các Tỳ-kheo:",
        "“Thí dụ như có một cái thùng có sáu mươi bốn hộc, mỗi hộc đựng đầy hạt mè, và có một người cứ một trăm năm lấy đi một hột, như vậy cho đến hết. Thời gian này vẫn chưa bằng thời gian chịu tội trong địa ngục Hậu vân. Chúng sanh hai mươi tuổi ở địa ngục Hậu vân bằng một tuổi ở địa ngục Vô vân; chúng sanh hai mươi tuổi ở địa ngục Vô vân bằng chúng sanh một tuổi ở địa ngục Ha ha; chúng sanh hai mươi tuổi ở địa ngục Ha ha, bằng chúng sanh một tuổi ở địa ngục Nại hà; chúng sanh hai mươi tuổi ở địa ngục Nại hà, bằng chúng sanh một tuổi ở địa ngục Dương minh; chúng sanh hai mươi tuổi ở địa ngục Dương minh bằng một tuổi ở ngục Tu-càn-đề; chúng sanh hai mươi tuổi ở địa ngục Tu-càn-đề, bằng một tuổi ở địa ngục Ưu-bát-la; chúng sanh hai mươi tuổi ở địa ngục Ưu-bát-la, bằng một tuổi ở địa ngục Câu-vật-đầu; chúng sanh hai mươi tuổi ở địa ngục Câu-vật-đầu, bằng một tuổi ở địa ngục Phân-đà-lợi; chúng sanh hai mươi tuổi ở địa ngục Phân-đà-lợi, bằng một tuổi ở địa ngục Bát-đầu-ma; chúng sanh hai mươi tuổi ở địa ngục Bát-đầu-ma, thì gọi là một trung kiếp; hai mươi trung kiếp thì gọi là một đại kiếp.",
        "“Trong địa ngục Bát-đầu-ma lửa cháy hừng hực, dù tội nhơn chỉ còn cách ngọn lửa khoảng trăm do-tuần cũng đã bị lửa thiêu nướng; nếu cách tội nhơn sáu mươi do-tuần, thì hai tai bị điếc, không còn nghe gì cả; nếu cách năm mươi do-tuần, thì đôi mắt bị mù lòa, không còn thấy gì cả. Tỳ-kheo Cù-ba-lê dùng tâm độc ác, hủy báng tôn giả Xá-lợi-phất và Mục-kiền-liên, nên sau khi mạng chung phải đọa vào địa ngục Bát-đầu-ma này.”",
        "Bấy giờ, vị Phạm vương liền nói bài kệ:",
        "Phàm con người ở đời,",
        "Búa rìu từ cửa miệng;",
        "Sở dĩ giết chết mình,",
        "Là do lời nói độc.",
        "Người đáng chê thì khen,",
        "Người đáng khen thì chê;",
        "Miệng làm theo nghiệp ác.",
        "Thân phải chịu tội ấy.",
        "Mánh lới cướp của cải,",
        "Tội ấy cũng còn nhẹ;",
        "Nếu hủy báng Thánh hiền,",
        "Thì tội ấy rất nặng.",
        "Vô vân, tuổi trăm nghìn,",
        "Hậu vân, tuổi bốn mốt;",
        "Hủy Thánh mắc tội này,",
        "Do tâm, miệng làm ác.",
        "Đức Phật bảo các Tỳ-kheo:",
        "“Vị Phạm thiên đã nói bài kệ như vậy, đó là lời nói chơn chánh, được đức Phật ấn khả. Vì sao? Vì nay Ta là đấng Như Lai, Chí Chơn, Đẳng chánh giác, cũng nói ý nghĩa như vậy.",
        "Phàm con người ở đời,",
        "Búa rìu từ cửa miệng;",
        "Sở dĩ giết chết mình,",
        "Là do lời nói độc.",
        "Người đáng chê thì khen,",
        "Người đáng khen thì chê;",
        "Miệng làm theo nghiệp ác.",
        "Thân phải chịu tội ấy.",
        "Mánh lới cướp của cải,",
        "Tội ấy cũng còn nhẹ;",
        "Nếu hủy báng Thánh hiền,",
        "Thì tội ấy rất nặng.",
        "Vô vân, tuổi trăm nghìn,",
        "Hậu vân, tuổi bốn mốt;",
        "Hủy Thánh mắc tội này,  Do tâm, miệng làm ác Đức Phật bảo các Tỳ-kheo:  “Về phía Nam cõi Diêm-phù-đề, trong núi Đại kim cương có cung điện của vua Diêm-la, chỗ vua cai trị ngang dọc sáu nghìn do-tuần. Thành này có bảy lớp, với bảy lớp lan can, bảy lớp lưới, bảy lớp hàng cây, và vô số các loài chim cùng nhau ca hót líu lo, cũng lại như vậy. Tại chỗ vua Diêm-la cai trị, ngày đêm ba thời đều có vạc đồng lớn, tự nhiên xuất hiện trước mặt. Nếu vạc đồng đã xuất hiện ở trong cung thì nhà vua cảm thấy sợ hãi, liền bỏ ra ngoài cung; nếu vạc đồng xuất hiện ngoài cung thì vua cảm thấy sợ hãi, liền bỏ vào trong cung. Có ngục tốt to lớn bắt vua Diêm-la nằm trên bàn sắt nóng, dùng móc sắt cạy miệng cho mở ra rồi rót nước đồng sôi vào, làm cháy bỏng môi, lưỡi từ cổ đến bụng, thông suốt xuống dưới, không chỗ nào không chín nhừ. Sau khi chịu tội xong, nhà vua cùng thể nữ vui đùa. Các vị đại thần ở đây lại cũng cùng hưởng phúc báo như vậy.”",
        "Đức Phật bảo các Tỳ-kheo:",
        "“Có ba vị sứ giả. Những gì là ba? Một là già, hai là bệnh, ba là chết. Nếu có chúng sanh nào thân làm ác, miệng nói lời ác, ý nghĩ điều ác, thì sau khi qua đời bị đọa vào địa ngục. Lúc này, ngục tốt dẫn tội nhơn đến chỗ vua Diêm-la. Đến nơi rồi, thưa rằng: ‘Đây là người Thiên sứ cho đòi. Vậy xin Đại vương hỏi cung hắn.’ Vua Diêm-la hỏi người bị tội: ‘Ngươi không thấy sứ giả thứ nhất sao?’ Người bị tội đáp: ‘Tôi không thấy.’ Vua Diêm-la nói tiếp: ‘Khi nhà ngươi còn ở trong loài người, có thấy người nào già nua, đầu bạc, răng rụng, mắt lờ, da thịt nhăn nheo, lưng còm chống gậy, rên rỉ mà đi, hay thân thể run rẩy, vì khí lực hao mòn; ngươi có thấy người này không?’ Người bị tội đáp: ‘Có thấy.’ Vua Diêm-la nói tiếp: ‘Tại sao ngươi không tự nghĩ rằng mình cũng sẽ như vậy?’ Người kia đáp: ‘Vì lúc đó tôi buông lung, không tự hay biết được.’ Vua Diêm-la nói: ‘Ngươi buông lung không tu tập thân, miệng và ý, bỏ ác mà làm lành. Nay Ta sẽ cho ngươi biết cái khổ của sự buông lung.’ Vua lại nói tiếp: ‘Nay ngươi phải chịu tội, không phải là lỗi của cha mẹ, không phải là lỗi của anh em, cũng không phải là lỗi của Thiên đế, cũng không phải là lỗi của tổ tiên, cũng không phải là lỗi của hàng tri thức, đầy tớ, sứ giả; cũng không phải là lỗi của Sa-môn, Bà-la-môn. Chính ngươi làm ác, nên chính ngươi phải chịu tội’.",
        "“Bấy giờ, vua Diêm-la cho hỏi tội nhơn về vị Thiên sứ thứ nhất xong, lại hỏi về Thiên sứ thứ hai: ‘Thế nào, nhà ngươi có thấy vị Thiên sứ thứ hai không?’ Đáp rằng: ‘Không thấy.’ Vua lại hỏi: ‘Khi nhà ngươi còn ở trong loài người, ngươi có thấy kẻ bị bệnh tật, khốn đốn, nằm lăn lóc trên giường, thân thể lăn lộn trên phẫn dãi hôi thối, không thể đứng dậy được; cần phải có người đút cơm cho; đau nhức từng lóng xương, nước mắt chảy, rên rỉ, không thể nói năng được; ngươi có thấy người như thế chăng?’ Tội nhơn đáp: ‘Có thấy.’ Vua Diêm-la nói tiếp: ‘Tại sao nhà ngươi không tự nghĩ: rồi đây ta cũng sẽ bị tai hoạn như vậy?’ Tội nhơn đáp: ‘Vì khi ấy buông lung tôi không tự hay biết được.’ Vua Diêm-la nói tiếp: ‘Vì chính ngươi buông lung, nên không thể tu tập thân, miệng và ý, không bỏ việc ác mà làm điều lành. Nay ta sẽ cho ngươi biết thế nào là cái khổ của sự buông lung.’ Vua lại nói: ‘Nay ngươi phải chịu tội, không phải là lỗi của cha mẹ, không phải là lỗi của anh em, cũng không phải là lỗi của Thiên đế, cũng không phải là lỗi của tổ tiên, cũng không phải là lỗi của hàng tri thức, đầy tớ, sứ giả, cũng không phải là lỗi của Sa-môn, Bà-la-môn.Chính ngươi làm ác, nên chính ngươi phải chịu tội.’",
        "“Khi vua Diêm-la hỏi người bị tội về Thiên sứ thứ hai xong, bấy giờ lại hỏi về Thiên sứ thứ ba: ‘Thế nào, nhà ngươi không thấy vị Thiên sứ thứ ba chứ?’ Đáp: ‘Không thấy.’ Vua Diêm-la hỏi tiếp: ‘Khi còn làm người, ngươi có thấy người chết, thân hư hoại, mạng chung, các giác quan đều bị diệt hẳn, thân thể ngay đơ cũng như cây khô, vứt bỏ ngoài gò mả để cho cầm thú ăn thịt, hoặc để trong quan tài, hoặc dùng lửa thiêu đốt chăng?’ Tội nhơn đáp: ‘Có thấy.’ Vua Diêm-la nói tiếp: ‘Tại sao nhà ngươi không tự nghĩ: rồi đây ta cũng sẽ bị chết như người đó không khác gì?’ Người bị tội đáp: ‘Vì khi ấy buông lung tôi không tự hay biết được.’ Vua Diêm-la nói tiếp: ‘Vì chính ngươi buông lung, nên không thể tu tập thân, miệng và ý, không cải đổi việc ác mà thực hành điều thiện. Nay ta sẽ cho ngươi biết thế nào là cái khổ của sự buông lung.’ Vua lại nói: ‘Nay ngươi phải chịu tội, không phải là lỗi của cha mẹ, không phải là lỗi của anh em, cũng không phải là lỗi của Thiên đế, cũng không phải là lỗi của tổ tiên, cũng không phải là lỗi của hàng tri thức, đầy tớ, sứ giả, cũng không phải là lỗi của Sa-môn, Bà-la-môn. Chính ngươi làm ác, nên chính ngươi phải chịu tội.’ Bấy giờ, vua Diêm-la hỏi về Thiên sứ thứ ba xong, bèn giao lại cho ngục tốt. Khi đó ngục tốt liền dẫn đến địa ngục lớn. Địa ngục lớn này ngang dọc một trăm do-tuần, sâu một trăm do-tuần.”",
        "Bấy giờ đức Thế Tôn liền nói bài kệ:",
        "Bốn hướng có bốn cửa,",
        "Ngõ ngách đều như nhau;",
        "Dùng sắt làm tường ngục,",
        "Trên che võng lưới sắt;",
        "Dùng sắt làm nền ngục,",
        "Tự nhiên lửa bốc cháy;",
        "Ngang dọc trăm do-tuần,",
        "Đứng yên không lay động.",
        "Lửa đen phừng phực cháy,",
        "Dữ dội khó mà nhìn;",
        "Có mười sáu ngục nhỏ,",
        "Lửa cháy do ác hạnh.",
        "Đức Phật bảo các Tỳ-kheo:",
        "“Khi ấy vua Diêm-la tự nghĩ: ‘Chúng sanh ở thế gian, vì mê lầm không ý thức, nên thân làm ác, miệng nói lời ác, ý nghĩ điều ác. Do đó sau khi lâm chung, ít có ai không chịu khổ này. Nếu như những chúng sanh ở thế gian, sửa đổi điều ác, sửa thân, miệng, ý để thực hành theo điều lành, thì sau khi lâm chung sẽ được an vui như hàng chư thiên vậy. Sau khi ta lâm chung được sinh vào trong cõi người, nếu gặp được đức Như Lai, thì sẽ ở trong Chánh pháp, cạo bỏ râu tóc, mặc ba pháp y, xuất gia tu đạo, đem lòng tin trong sạch để tu hành Phạm hạnh thanh tịnh. Những điều cần làm đã làm xong, đã đoạn trừ sanh tử, tự mình tác chứng ngay trong hiện tại, không còn tái sinh’.”",
        "Bấy giờ, đức Thế Tôn đọc bài kệ:",
        "Tuy là thấy Thiên sứ,",
        "Nhưng vẫn còn buông lung;",
        "Người ấy thường âu lo,",
        "Sanh vào nơi ti tiện.",
        "Nếu người có trí tuệ,",
        "Khi gặp thấy Thiên sứ,",
        "Gần gũi pháp hiền Thánh,",
        "Mà không còn buông lung.",
        "Thấy thụ sinh mà sợ,",
        "Do sanh, già, bệnh, chết.",
        "Không thụ sinh, giải thoát,",
        "Hết sanh, già, bệnh, chết.",
        "Người đó được an ổn.",
        "Hiện tại chứng vô vi,",
        "Đã vượt qua lo sợ,",
        "Chắc chắn nhập Niết-bàn."
    ]
}