{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "06. KINH CHUYỂN LUÂN VƯƠNG TU HÀNH",
        "Số Phẩm": "PHẦN 2",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Tôi nghe như vầy:",
        "Một thời, Phật ở tại Ma-la-hê-sưu , du hành nhân gian, cùng với một nghìn hai trăm năm mươi Tỳ-kheo, dần dần đi đến nước Ma-lâu",
        "Bấy giờ Thế Tôn nói với các Tỳ kheo:",
        "“Này các Tỳ-kheo, các ngươi hãy tự thắp sáng. Thắp sáng trong Chánh pháp, chớ đừng thắp sáng ở nơi khác. Hãy tự mình nương tựa nơi mình, nương tựa nơi Chánh pháp, chớ đừng nương tựa vào một nơi nào khác .  “Này các Tỳ-kheo, thế nào là hãy tự thắp sáng; thắp sáng trong Chánh pháp, chớ đừng thắp sáng ở nơi khác; hãy tự mình nương tựa nơi mình, nương tựa nơi Chánh pháp, chớ đừng nương tựa vào một nơi nào khác?",
        "“Ở đây, Tỳ-kheo quán thân trên nội thân, tinh cần không biếng nhác, ức niệm không quên, trừ bỏ tham ưu ở đời. Quán thân trên ngoại thân, quán thân trên nội ngoại thân, tinh cần không biếng nhác, ức niệm không quên, trừ bỏ tham ưu ở đời. Quán thọ, quán ý, quán pháp cũng vậy. Đó là Tỳ kheo hãy tự thắp sáng; thắp sáng trong Chánh pháp, chớ đừng thắp sáng ở nơi khác; hãy tự mình nương tựa nơi mình, nương tựa nơi Chánh pháp, chớ đừng nương tựa vào một nơi nào khác. Thực hành như thế sẽ không bị ma nhiễu hại, công đức ngày một thêm. Tại vì sao?",
        "“Vào thời quá khứ xa xưa, có vị vua tên là Kiên Cố Niệm , là vua Quán đảnh dòng Sát-lỵ , làm Chuyển luân Thánh vương, thống lãnh cả bốn châu thiên hạ. Bấy giờ nhà Vua là vị tự tại , cai trị bằng chánh pháp, là người tối thắng trong loài người. Vua có đủ bảy thứ báu: bánh xe vàng báu, voi trắng báu, ngựa xanh báu, thần châu báu, ngọc nữ báu, cư sĩ báu, chủ binh báu. Và có một nghìn người con hùng dũng, đủ sức dẹp địch. Vua không cần dùng binh mà thiên hạ tự thái bình.",
        "“Vua Kiên Cố Niệm trị vì đã lâu ngày, một hôm bánh xe vàng báu ở không trung bỗng tự nhiên rời khỏi chỗ cũ. Người coi bánh xe gấp đến tâu vua: ‘Tâu Đại vương, nên biết, bánh xe báu nay rời khỏi chỗ cũ.’ Sau khi nghe thế, vua Kiên Cố Niệm nghĩ: ‘Ta từng nghe các bậc tiền túc kỳ cựu nói: Nếu bánh xe báu rời khỏi chỗ cũ thì thọ mệnh của Chuyển luân vương không còn được lâu. Ta nay đã thụ hưởng phước lạc ở cõi người, nên tìm phương tiện để thọ hưởng phước lạc thiên thượng. Ta hãy lập Thái tử lên thống lãnh bốn châu thiên hạ và phong riêng một ấp cho người hớt tóc, để khiến cắt bỏ râu tóc, rồi ta mặc pháp y, xuất gia tu đạo.’",
        "“Rồi vua Kiên Cố Niệm sai gọi Thái tử và bảo: ‘Khanh biết không? Ta từng nghe các bậc tiền túc kỳ cựu nói, nếu bánh xe báu rời khỏi chỗ cũ thì thọ mệnh của Chuyển luân vương không còn được lâu. Ta nay đã thụ hưởng phước lạc ở cõi người, nên tìm phương tiện để thọ hưởng phước lạc trên Trời. Nay ta muốn cạo bỏ râu tóc, bận ba pháp y, xuất gia tu đạo. Ta đem bốn châu thiên hạ ủy thác cho ngươi. Ngươi hãy gắng sức, thương yêu dân chúng.’ Sau khi Thái tử lãnh mạng. Vua Kiên Cố Niệm liền cạo bỏ râu tóc, bận ba pháp y, xuất gia tu đạo.",
        "“Vua xuất gia được bảy ngày thì bánh xe vàng báu bỗng nhiên không hiện ra nữa. Người coi bánh xe đến tâu vua: ‘Đại vương nên biết, nay bánh xe vàng báu bỗng nhiên biến mất. Vua không vui. Bèn tìm đến chỗ vua Kiên Cố Niệm. Sau khi đến, bạch rằng: ‘Phụ vương nên biết, nay bánh xe vàng báu bỗng nhiên không hiện ra nữa.’ Vua Kiên Cố Niệm trả lời con: ‘Ngươi chớ lo lắng cho là điều không vui. Bánh xe vàng báu đó không phải là của cha ngươi sản xuất ra. Ngươi chỉ cần gắng thi hành chánh pháp thánh vương, rồi đến ngày rằm trăng tròn, tắm gội nước hương, lên ngồi tại chánh pháp điện, có thể nữ bao quanh, tức thì có thần bảo bánh xe vàng báu tự nhiên hiện đến. Bánh xe có nghìn căm, màu sắc đầy đủ, là tác phẩm của thợ nhà trời chứ không phải của loài người.’",
        "“Thái tử tâu phụ vương: ‘Phụ vương, chánh pháp của Chuyển luân Thánh vương là thế nào? Phải làm như thế nào?’ Vua bảo con: ‘Hãy nương trên pháp, an lập trên pháp, thành tựu nơi pháp; cung kính, tôn trọng, quán sát pháp; lấy pháp làm đầu, thủ hộ chánh pháp. Lại nữa, hãy răn dạy các thể nữ bằng pháp. Lại nữa, hãy chăm sóc dạy dỗ các vương tử, đại thần, các quan liêu, trăm quan và thứ dân bằng pháp. Hãy hộ trì, chăm sóc các Sa-môn, Bà-la-môn, cho đến cầm thú.’ Rồi vua lại bảo con: ‘Lại nữa, trong cõi nước ngươi, nếu có các Sa-môn, Bà-la-môn, tu hành thanh chơn, công đức đầy đủ, chuyên cần tinh tấn, xa lìa kiêu mạn, nhẫn nhục nhân ái, một mình ở chỗ nhàn tịnh tu tập, một mình yên nghỉ, một mình đạt đến Niết-bàn; tự mình diệt trừ tham dục, dạy người khác diệt trừ tham dục; tự diệt trừ sân nhuế, dạy người khác diệt trừ sân nhuế; tự diệt trừ ngu si, dạy người khác diệt trừ ngu si; ở trong chỗ ô nhiễm họ không ô nhiễm, trong chỗ tội ác họ không tội ác, trong chỗ ngu si họ không ngu si, chỗ có thể đắm trước họ không đắm trước, chỗ đáng trụ họ không trụ, chỗ đáng ở họ không ở, thân hành chất trực; miệng nói lời chất trực, ý nghĩ chất trực, thân hành thanh tịnh, miệng nói thanh tịnh, ý nghĩ thanh tịnh, chánh niệm thanh tịnh, nhân huệ , không hề chán; biết đủ trong sự ăn mặc, và cầm bát đi khất thực để gây phước lành cho chúng sanh. Nếu có những người như thế, ngươi hãy thường nên tìm đến, tùy lúc hỏi han: phàm những điều tu hành, sao là thiện, sao là ác, sao gọi là phạm, sao gọi không phạm, cái nào đáng thân, cái nào không đáng thân, việc gì đáng làm, việc gì không đáng làm, và thi hành pháp gì để được an lạc lâu dài? Ngươi hỏi xong rồi lấy ý mình quán xét thấy việc nên làm thì gắng làm, việc nên bỏ thì gắng bỏ. Trong nước nếu có kẻ mồ côi già cả hãy nên chẩn cấp. Người nghèo cùng yếu kém đến xin, cẩn thận chớ trái nghịch. Trong nước có luật pháp cũ, ngươi chớ thay đổi. Đó là những pháp mà Chuyển luân Thánh vương tu hành, ngươi hãy phụng hành.”",
        "Phật nói với các Tỳ-kheo:",
        "“Này các Tỳ-kheo, khi Chuyển luân Thánh vương nghe lời phụ vương dạy xong, thì như lời dạy mà tu hành. Đến ngày rằm trăng tròn, tắm gội nước hương, lên ngồi tại bảo điện, có thể nữ bao quanh, tự nhiên có bánh xe báu hiện ra trước mặt, vành xe có ngàn tăm sáng chói, do thợ trời làm chớ không phải đời có được. Bánh xe toàn bằng chân kim, đường kính bánh xe một trượng tư. Khi ấy, Chuyển luân Thánh vương thầm nghĩ: ‘Ta từng nghe các bậc tiên túc kỳ cựu nói: Nếu vua Quán đảnh dòng Sát-lỵ, đến ngày rằm trăng tròn, tắm gội nước hương, lên ngồi tại bảo điện, có thể nữ bao quanh, thời tự nhiên có bánh xe vàng hiện đến trước mặt, bánh xe có nghìn căm, ánh sáng rực rỡ, là tác phẩm của thợ nhà trời chứ không phải do con người làm, được làm thành bằng vàng thiệt, đường kính trượng tư, khi đó được gọi là Chuyển luân Thánh vương. Nay có bánh xe báu ấy hiện đến há không là đây chăng? Ta hãy thử coi bánh xe đó thế nào?’",
        "“Khi ấy, vua Chuyển luân liền triệu bốn thứ binh, hướng về phía bánh xe vàng, trịch áo bày vai phải, đầu gối phải quỳ sát đất, rồi lấy tay mặt vỗ lên bánh xe và nói: ‘Ngươi hãy theo đúng phép mà vận chuyển về phương Đông, chớ trái lệ thường.’ Bánh xe liền chuyển về phương Đông. Vua bèn dẫn bốn thứ quân binh đi theo bánh xe vàng, trước bánh xe vàng có bốn vị thần dẫn đường. Đến chỗ bánh xe vàng ngừng thì vua cũng dừng xe. Bấáy giờ, các tiểu quốc phương Đông thấy đại vương đến, họ đem bát vàng đựng lúa bạc, bát bạc đựng lúa vàng đến trước vua, cúi đầu tâu rằng: “Đại vương đến, thật lành thay! Nay phương Đông này đất ruộng phì nhiêu, nhân dân sung túc, tánh khí nhân hòa, từ hiếu trung thuận. Cúi mong Thánh vương lấy chánh pháp trị hóa chốn này, chúng tôi xin cung cấp hầu hạ, phục vụ mọi việc cần dùng.’ Vua chuyển luân nói với các tiểu vương: “Thôi thôi chư hiền! Thế là các ngươi đã cúng dường ta rồi đó. Các ngươi hãy nên lấy chánh pháp mà trị dân, chớ làm cho thiên lệch, không để cho quốc nội có hành vi phi pháp. Như vậy tức là ta trị hóa đó.’ Các tiểu vương vâng lệnh. Họ liền theo vua đi tuần khắp nước, đến tận mé biển Đông mới trở về.",
        "“Vua lần lượt đi về phương Nam, rồi phương Tây, phương Bắc. Hễ bánh xe vàng đến ở đâu thì các quốc vương đều đến cống hiến như các tiểu quốc phương Đông vậy.",
        "“Bấy giờ, vua Chuyển luân, sau khi đã theo bánh xe vàng đi khắp bốn biển, đem chánh đạo khai hóa, an ủi dân chúng xong, trở về nước, thì bánh xe vàng dừng lại trên không trung ngay cửa cung điện. Vua Chuyển luân vui mừng phấn khởi nói: ‘Bánh xe vàng báu này thật là điềm tốt của ta. Nay ta chính thật là Chuyển luân Thánh vương.’",
        "“Đó là sự thành tựu bánh xe vàng báu.",
        "“Vua ấy trị đời một thời gian lâu, rồi bánh xe vàng báu giữa hư không lại bỗng nhiên rời chỗ cũ. Người coi bánh xe gấp đến tâu vua: ‘Đại vương nên biết, nay bánh xe báu đã rời chỗ.’ Vua nghe xong liền tự mình suy nghĩ: ‘Ta từng nghe nơi các bậc tiên túc kỳ cựu rằng, nếu bánh xe báu dời chỗ, Chuyển luân Thánh vương sống chẳng còn bao lâu nữa. Ta nay đã hưởng thọ phước lạc của loài người, cũng nên tìm phương tiện thọ phước lạc trên trời. Ta hãy lập Thái tử thống lãnh bốn thiên hạ, phong riêng một ấp cho người hớt tóc, và ra lệnh cạo bỏ râu tóc, mặc ba pháp y, xuất gia tu đạo.’",
        "“Rồi vua sai gọi Thái tử và bảo: ‘Khanh biết không? Ta từng nghe các bậc tiền túc kỳ cựu nói, nếu bánh xe báu rời khỏi chỗ cũ thì thọ mệnh của Chuyển luân vương không còn được lâu. Ta nay đã thụ hưởng phước lạc ở cõi người, nên tìm phương tiện để thọ hưởng phước lạc thiên thượng. Nay ta muốn cạo bỏ râu tóc, bận ba pháp y, xuất gia tu đạo. Ta đem bốn châu thiên hạ ủy thác cho ngươi. Ngươi hãy gắng sức, thương yêu dân chúng.’ Sau khi Thái tử lãnh mạng. vua liền cạo bỏ râu tóc, bận ba pháp y, xuất gia tu đạo.",
        "“Vua xuất gia được bảy ngày thì bánh xe vàng bỗng nhiên không hiện. Người coi bánh xe đến báo tin vua: ‘Tâu Đại vương, bánh xe báu nay bỗng nhiên biến mất.’ Vua nghe xong chẳng cho đó là điều đáng lo, cũng chẳng chịu đến hỏi ý phụ vương.",
        "“Rồi vua cha bỗng nhiên thăng hà.",
        "“Kể từ đây về trước có sáu vua Chuyển luân, cứ đắp đổi trao ngôi và lấy chánh pháp trị dân, duy một ông vua sau này tự chuyên trị nước, không theo pháp cũ, chánh trị bất công khiến thiên hạ oán thán, quốc độ kém sút, nhân dân điêu linh. Thấy vậy có một đại thần dòng Bà-la-môn đến tâu vua: ‘Nay quốc độ sút kém, nhân dân điêu linh, không được như trước. Hiện nay trong nước vua có nhiều vị trí thức, thông minh bác đạt, rõ thấu cổ kim, biết đủ pháp chánh trị của tiên vương, sao ngài không vời lại để hỏi những điều họ biết, hỏi chắc họ đáp.’ Vua liền vời quần thần đến hỏi cái đạo trị chánh của Tiên vương, các vị trí thần đáp đủ mọi việc. Vua nghe xong bèn thi hành theo pháp cũ, lấy chánh pháp cứu hộ nhân dân, nhưng vẫn không thể chẩn tế những kẻ cô lão, cấp thí cho người hạ cùng, nhân dân trong nước vẫn bị đưa dần tới chỗ nghèo khổ, xâm đọat lẫn nhau mà thành có nạn đạo tặc hoành hành. Mỗi khi có ai bị rình bắt được đem đến vua, tâu rằng: ‘Người này làm giặc, xin vua trị nó.’ Vua hỏi: ‘Có thật ngươi là giặc không?’ Người ấy đáp: ‘Thật. Vì tôi nghèo cùng đói khát, không tự sống nổi nên phải làm giặc.’ Vua liền xuất kho, lấy của cấp cho và dặn: ‘Ngươi đem của này về cung cấp cha mẹ, giúp đỡ bà con, từ nay chớ làm giặc nữa nghe.’",
        "“Các người khác thấy vậy đồn: ‘Có kẻ làm giặc được vua cấp cho tài bảo’, nên họ cũng bắt chước làm theo. Họ lại bị rình bắt được đem đến vua, tâu rằng: ‘Người này làm giặc, xin vua trị nó.’ Vua lại hỏi: Có thật ngươi là giặc không?’ Người kia đáp: ‘Dạ thật. Vì tôi nghèo cùng đói khát không tự sống nổi, nên phải làm giặc.’ Vua lại xuất kho lấy của cấp cho và bảo: ‘Ngươi đem của này về cung cấp cha mẹ, giúp đỡù bà con, từ nay chớ làm giặc nữa nghe.’",
        "“Lại những người khác nghe nói có kẻ làm giặc được vua cấp cho tài bảo, nên họ bắt chước rủ nhau làm theo, và lại bị rình bắt đem đến vua, tâu: ‘Người này làm giặc, xin vua trị nó.’ Vua lại hỏi: ‘Có thật ngươi làm giặc không?’ Người kia đáp: ‘Dạ thật. Vì tôi nghèo cùng đói khát, không tự sống nổi nên phải làm giặc.’ Lần này vua nghĩ: ‘Trước có người làm giặc, ta thấy nghèo đói cấp cho tài vật, dặn thôi đừng làm. Người khác nghe thế lại bắt chước làm. Nạn đạo tặc nhân đó tràn lan mãi. Thôi bây giờ tốt hơn ta phải hạ lệnh bắt trói người này dắt đi các ngõ đường, sau đưa ra ngoài thành đến chỗ trống trải mà hành hình, để răn người sau.’ Vua liền sắc tả hữu bắt trói lại rồi đánh trống xướng lệnh đưa đi khắp ngõ đường. Xong rồi đem tới một nơi trống trải ở ngoài thành mà hành hình. Mọi người khác thấy vậy truyền nhau: ‘Nếu chúng ta làm giặc, cũng phải bị xử như thế chẳng khác gì.’ Từ đây quốc dân, để tự phòng hộ, mới tạo ra những binh trượng, gươm đao, cung tên, tàn hại nhau, tấn công, cướp giật lẫn nhau.",
        "“Kể từ vua này mới bắt đầu có sự nghèo cùng. Nhân có nghèo cùng mới có đạo tặc. Nhân có đạo tặc mới có đao trượng. Nhân có đao trượng mới có sát hại. Nhân có sát hại nên nhan sắc con người mới tiều tụy, thọ mệnh ngắn ngủi. Họ sống từ bốn vạn tuổi, sau lần xuống còn hai vạn tuổi. Trong số đó có người sống lâu; có người chết yểu; có người khổ; có người sướng. Những người khổ thì sinh tâm tà dâm, tham thủ, bày đủ phương tiện để mưu đoạt của nhau, nên tai nạn nghèo cùng, trộm cướp, đao trượng, sát hại càng ngày càng nhiều, làm cho mạng người lại giảm dần xuống chỉ sống một vạn tuổi.",
        "“Trong thời gian người sống một vạn tuổi, vẫn lại trộm cướp lẫn nhau. Mỗi khi bị rình bắt đem đến vua, tâu rằng: ‘Người này làm giặc, xin vua trị nó.’ Vua hỏi: ‘Có thật ngươi làm giặc không?’ Người kia đáp: ‘Tôi không làm.’ Và ở giữa đám đông nó cố ý nói dối. Như vậy chúng sanh lúc đó vì nghèo cùng nên trộm cướp. Vì trộm cướp nên có đao binh. Vì đao binh nên có giết hại. Vì giết hại nên có tham thủ tà dâm. Vì tham thủ tà dâm nên có nói dối. Vì có nói dối, do đó tuổi thọ lại giảm lần, chỉ còn sống được một ngàn tuổi.",
        "“Trong thời gian sống một ngàn tuổi, bắt đầu người ta tạo bốn ác hạnh về miệng trên đời là nói dối, nói hai lưỡi, nói độc ác và nói thêu dệt. Ba ác nghiệp đó tăng dần lên thì tuổi thọ con người giảm bớt xuống, chỉ còn sống được năm trăm tuổi.",
        "“Trong thời gian sống năm trăm tuổi, người ta lại tạo thêm ba nết ác khác là dâm dục phi pháp, tham lam phi pháp và tà kiến. Ba ác nghiệp này tăng dần lên thì tuổi thọ con người giảm bớt xuống, chỉ còn sống đến ba trăm rồi hai trăm tuổi và nay, nhân loại trong thời ta, chỉ còn sống được một trăm tuổi. Số tuổi thọ được tăng thì ít mà giảm thì nhiều. Hễ cứ làm ác mãi thì tuổi thọ cứ như thế giảm xuống mãi cho đến khi nhân loại chỉ còn sống mười tuổi.",
        "“Trong thời gian nhân loại sống mười tuổi này, con gái vừa sinh ra năm tháng đã gả chồng. Ở vào thời ấy, những vị ngon ngọt như dầu mỡ, đường mật không còn nghe tên. Đậu, mè, lúa, nếp biến thành cỏ rác. Những thứ danh phục, lụa là, gấm vóc, vải trắng, kiếp-ba, lụa tơ, lãnh nhiễu như bây giờ không thấy mặc, mà phải bện lông gai xô xảm lấy làm áo mặc thượng hạng. Bấy giờ, toàn cõi đất này mọc đầy gai gốc, sanh đầy mòng muỗi, ruồi lằng, chấy rận, rắn rết, ong, bò cạp, trùng độc. Vàng bạc, lưu ly, trân châu, danh bảo đều lặn hết xuống đất, chỉ còn ngói đá, sạn sỏi thì nổi cả lên trên. Nhân loại lúc đó tuyệt nhiên không còn nghe đến tên thập thiện mà chỉ có thập ác dẫy đầy thế gian. Nhằm lúc cái tên thiện pháp còn không nghe thấy, nhân loại không biết đâu để tu tập hạnh lành, do đó hễ người nào làm điều cực ác, bất hiếu với cha mẹ, bất kính với sư trưởng, bất trung bất nghĩa, phản nghịch vô đạo, thì được dân chúng tôn sùng như hiện nay người ta tôn sùng kẻ làm điều lành, hiếu dưỡng cha mẹ, kính thuận sư trưởng, trung tín tiết nghĩa, thuận đạo tu nhân vậy.",
        "“Nhân loại thời ấy, phần nhiều tạo mười điều ác nên sa vào nẻo ác nhiều, hễ vừa trông thấy nhau là họ muốn bắn giết nhau như kẻ thợ săn trông thấy bầy nai.",
        "“Cõi đất lúc ấy đầy dẫy hố hầm, khe suối, hang hóc; đất rộng người thưa, đi lại ghê sợ. Nhằm lúc ấy thì có nạn đao binh nổi lên. Cọng cỏ nhánh cây cầm trong tay cũng đều biến thành qua mâu, giết hại nhau trong vòng bảy ngày. Khi ấy, những kẻ có trí, tìm lánh vào rừng sâu, nương ở hang hố, trong bảy ngày lòng quá sợ hãi mà phát lời từ thiện rằng: ‘Ngươi không hại ta, ta không hại ngươi.’ Họ nhờ ăn cỏ cây mà sống còn. Qua khỏi bảy ngày họ từ núi đi ra, hễ gặp người sống sót, vừa thấy nhau đã mừng rỡ nói: ‘Ngươi không chết ư? Ngươi không chết ư?’ Giống như cha mẹ chỉ có con một, xa cách lâu ngày, nay gặp lại mừng không xiết kể. Họ đem lòng mừng rỡ chúc hỏi nhau như thế xong, sau mới thăm hỏi đến nhà, thì hay rằng thân thuộc nhà họ đã chết đi nhiều, nên họ lại buồn khóc, than van, kêu ca với nhau trong suốt bảy ngày tiếp.",
        "“Hết bảy ngày buồn khóc, tiếp đến bảy ngày họ cùng nhau chúc mừng, hoan lạc, và tự nghĩ: ‘Vì chúng ta chứa ác quá nhiều nên gặp phải tai nạn, khiến thân tộc chết chóc, gia quyến mất tiêu. Vậy nay ta nên chung nhau tu tập điều lành, nhưng hãy tu điều lành gì? Ta nên đừng sát sinh.’",
        "“Bấy giờ nhân loại lại phát từ tâm, không tàn hại nhau, nhờ đó nhân loại được tăng dần sắc lực và thọ mệnh từ mười tuổi nay sống lên hai mươi tuổi. Trong lúc sống hai mươi tuổi lại suy nghĩ: ‘Chúng ta nhờ tu chút ít hạnh lành không tàn hại nhau mà thọ mệnh tăng lên hai mươi tuổi. Có lẽ ta nên tu thêm ít điều lành nữa. Nhưng nên tu điều lành gì? Trước đã không sát sinh rồi, giờ ta nên đừng trộm cắp.’ Và do tu điều không trộm cắp mà thọ mệnh tăng lên bốn mươi tuổi. Trong lúc sống bốn mươi tuổi, lại suy nghĩ: ‘Chúng ta nhờ tu chút ít lành mà thọ mệnh tăng lên, nay có lẽ ta nên tu thêm ít điều lành nữa. Nhưng nên tu điều lành gì? Ta nên tu điều không tà dâm. ’Từ đó mọi người đều không tà dâm, và thọ mệnh tăng lên tám mươi tuổi. Trong lúc sống tám mươi tuổi, lại suy nghĩ: ‘Chúng ta nhờ tu chút ít lành mà thọ mệnh tăng lên, nay có lẽ ta nên tu thêm ít điều lành nữa. Nhưng nên tu điều lành gì? Ta nên không nói dối.’ Từ đó mọi người thảy đều không nói dối, và thọ mạng tăng lên đến một trăm sáu mươi tuổi. Trong lúc sống một trăm sáu mươi tuổi lại suy nghĩ: ‘Chúng ta nhờ tu chút ít điều lành mà thọ mạng tăng lên. Nay có lẽ ta nên tu thêm ít điều lành nữa. Nhưng nên tu điều lành gì? Ta nên không nói hai lưỡi.’ Từ đó mọi người đều không nói hai lưỡi, và thọ mạng tăng lên ba trăm hai mươi tuổi. Trong lúc sống ba trăm hai mươi tuổi, lại suy nghĩ: ‘Chúng ta nhờ tu chút ít điều lành mà thọ mạng tăng lên. Nay có lẽ ta nên tu thêm ít điều lành nữa. Nhưng nên tu điều lành gì? Ta nên không ác khẩu.’ Từ đó mọi người không ác khẩu, và thọ mạng tăng lên sáu trăm bốn mươi tuổi. Trong lúc sống sáu trăm bốn mươi tuổi, lại suy nghĩ: ‘Chúng ta nhờ tu chút ít điều lành mà thọ mạng tăng lên. Nay có lẽ ta nên tu thêm ít điều lành nữa. Nhưng nên tu điều lành gì? Ta nên không nói thêu dệt.’ Từ đó mọi người không nói thêu dệt, và thọ mạng tăng lên đến hai nghìn tuổi. Trong lúc sống hai nghìn tuổi, lại suy nghĩ: ‘Chúng ta nhờ tu chút ít điều lành mà thọ mạng tăng lên. Nay có lẽ ta nên tu thêm ít điều lành nữa. Nhưng nên tu điều lành gì? Ta nên không xan tham.’ Từ đó mọi người không xan tham, và thọ mạng tăng lên đến năm nghìn tuổi. Trong lúc sống năm nghìn tuổi, lại suy nghĩ: ‘Chúng ta nhờ tu chút ít điều lành mà thọ mạng tăng lên. Nay có lẽ ta nên tu thêm ít điều lành nữa. Nhưng nên tu điều lành gì? Ta nên không tật đố, từ tâm tu thiện.’ Từ đó mọi người không tật đố, từ tâm tu thiện, và thọ mạng tăng lên đến một vạn tuổi. Trong lúc sống một vạn tuổi, lại suy nghĩ: ‘Chúng ta nhờ tu chút ít điều lành mà thọ mạng tăng lên. Nay có lẽ ta nên tu thêm ít điều lành nữa. Nhưng nên tu điều lành gì? Ta nên tu chánh kiến, không sanh điên đảo.’ Từ đó mọi người tu chánh kiến, không sanh điên đảo, và thọ mạng tăng lên đến hai vạn tuổi. Trong lúc sống bốn vạn tuổi, lại suy nghĩ: ‘Chúng ta nhờ tu chút ít điều lành mà thọ mạng tăng lên. Nay có lẽ ta nên tu thêm ít điều lành nữa. Nhưng nên tu điều lành gì? Ta nên hiếu dưỡng cha mẹ, kính thờ sư trưởng.’ Từ đó mọi người đều hiếu dưỡng cha mẹ, kính thờ sư trưởng, và thọ mạng tăng lên đến tám vạn tuổi.",
        "“Trong lúc nhân loại sống tám vạn tuổi, con gái đến năm trăm tuổi mới gả chồng, và có chín thứ bịnh là lạnh, nóng, đói, khát, đại tiện, tiểu tiện, tham dục, ham ăn và già nua. Cõi đất lúc ấy bằng phẳng không có rạch hầm, gò nổng gai gốc, cũng không mòng muỗi, rắn rết, trùng độc. Ngói, đá, cát, gạch thì biến thành lưu ly. Nhân dân sung túc, ngũ cốc rẻ thường, giàu vui không xiết tả. Có tám vạn thành lớn được dựng lên, thôn thành san sát gần nhau, gà gáy cùng nghe được.",
        "“Vào thời kỳ ấy thì có đức Phật ra đời hiệu là Di-lặc Như Lai, Chí chân, Đẳng chánh giác, mười hiệu đầy đủ, như đức Thích-ca Như Lai ngày nay không khác. Đức Di-lặc kia tự mình tu chứng ngay ở giữa hàng chư thiên, Đế Thích, Ma, Thiên Ma, Sa-môn, Bà-la-môn, và nhân gian, mà tự thân tác chứng, cũng như ta ngày nay ở ngay giữa hàng chư thiên, Đế Thích, Ma hoặc Thiên Ma, Sa-môn, Bà-la-môn và nhân gian mà tự mình tác chứng vậy.",
        "“Đức Di-lặc sẽ thuyết pháp, khoảng đầu, giữa và cuối đều trọn lành, đầy đủ nghĩa vị, tịnh tu phạm hạnh như ngày nay Ta thuyết pháp, khoảng đầu, giữa, cuối đều chân chánh, nghĩa vị đầy đủ, phạm hạnh thanh tịnh vậy.",
        "“Đức Di-lặc có chúng đệ tử vô số ngàn vạn, như Ta ngày nay có đệ tử vài trăm . Nhân dân lúc ấy gọi đệ tử ngài là Từ tử như gọi đệ tử ta nay là Thích tử.",
        "“Lúc ấy, có vua tên là Tương-già , là vua Sát-lỵ Chuyển luân Thánh vương quán đảnh , cai trị bốn châu thiên hạ. Vua lấy chánh pháp trị dân, ai nấy đều mến phục. Vua có đủ bảy thứ báu là bánh xe vàng, voi trắng, ngựa xanh, thần châu, ngọc nữ, cư sĩ, chủ binh và ngàn người con dõng mãnh hùng nghị, đủ sức dẹp ngoại địch, được bốn phương kính thuận, không cần binh đao mà thiên hạ thái bình.",
        "“Vua thiết lập một Đại bảo tràng vòng vây mười tầm, cao một ngàn tầm, được trang nghiêm với ngàn sắc lẫn lộn. Bảo tràng có một trăm góc , mỗi góc có trăm nhánh, dệt bằng chỉ báu, có các châu bảo xen lẫn. Sau khi lập bảo tràng để cúng thí hàng Sa-môn, Bà-la-môn và người nghèo trong nước xong, vua cắt bỏ râu tóc, mặc ba pháp y, xuất gia tu đạo, tập hạnh vô thượng, ngay trong pháp hiện tại mà tự thân tác chứng, sanh tử dứt hết, phạm hạnh thành tựu, việc làm hoàn mãn, không còn phải chịu thân sau nữa.” Phật dạy:",
        "“Này các Tỳ-kheo! Các ngươi hãy siêng tu các thiện hạnh. Nhờ tu thiện hạnh mà thọ mệnh lâu dài, nhan sắc thêm tươi, an ổn khoái lạc, tài bảo phong nhiêu, oai lực đầy đủ, giống như các vua thuận làm theo cựu pháp của Chuyển luân Thánh vương thời thọ mệnh lâu dài, nhan sắc thêm tươi, an ổn khoái lạc, tài bảo phong nhiêu, oai lực đầy đủ. Tỳ-kheo cũng vậy, nên tu thiện pháp, thọ mạng lâu dài, nhan sắc thêm tươi, an ổn khoái lạc, tài bảo phong phú, oai lực đầy đủ.",
        "“Thế nào gọi là Tỳ-kheo được thọ mệnh lâu dài? Tỳ-kheo tu tập dục định, tinh cần không giải đãi, do thành tựu diệt hành mà tu thần thông . Tu tập tinh tấn định, ý định, tư duy định, tinh cần không giải đãi, do thành tựu diệt hành mà tu thần thông. Như thế là Tỳ kheo thọ mệnh lâu dài.",
        "“Thế nào gọi là Tỳ-kheo được nhan sắc thêm tươi? Ở đây, Tỳ-kheo có giới cụ túc, thành tựu oai nghi, thấy có tội nhỏ đã sanh lòng sợ lớn, học tập đầy đủ trong các học giới , hoàn toàn không thiếu sót. Như thế là Tỳ-kheo nhan sắc thêm tươi.",
        "“Thế nào gọi là Tỳ-kheo được an ổn khoái lạc? Ở đây, Tỳ-kheo đoạn trừ dâm dục, xả bỏ pháp bất thiện, có giác có quán, có hỷ lạc phát sanh do viễn ly, chứng đệ nhất thiền. Trừ diệt giác và quán, nội đẳng tịnh , tâm chuyên nhất, không giác không quán, có hỷ lạc phát sanh do định, chứng đệ nhị thiền. Lìa hỷ, an trú xả, chuyên tâm không tán loạn, tự mình biết rõ cảm giác lạc nơi thân, an trú nơi điều mà Hiền Thánh nói là xả-niệm-lạc. chứng đệ tam thiền. Dứt khổ dứt lạc, ưu và hỷ đã loại trừ từ trước, không khổ không lạc, xả và niệm thanh tịnh, chứng đệ tứ thiền. Như thế là Tỳ-kheo an ổn, khoái lạc.",
        "“Thế nào gọi là Tỳ-kheo được tài bảo phong nhiêu? Ở đây, Tỳ-kheo lo tu tập từ tâm, khắp một phương, rồi đến các phương khác cũng vậy, bao trùm, rộng lớn, bình đẳng vô lượng, trừ mọi oán kết, tâm không tật đố, tịch mặc từ nhu. Bi tâm, hỷ tâm, xả tâm cũng như thế. Như thế là Tỳ-kheo được tài bảo phong nhiêu.",
        "“Thế nào gọi là Tỳ-kheo được oai lực đầy đủ? Ở đây, Tỳ-kheo hiểu biết một cách như thật về khổ đế, tập đế, diệt đế, đạo đế. Như thế là Tỳ-kheo được oai lực đầy đủ. Này các Tỳ-kheo! Nay Ta xem khắp những người có sức lực không ai hơn ma lực, nhưng Tỳ-kheo đã đoạn trừ hết hoặc lậu, thì lại thắng được chúng ma đó.",
        "Bấy giờ, các Tỳ-kheo sau khi nghe những điều Phật dạy, hoan hỷ phụng hành."
    ]
}