{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "28. KINH BỐ TRA-BÀ-LÂU",
        "Số Phẩm": "PHẦN 3",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Tôi nghe như vầy:",
        "Một thời, Phật ở tại nước Xá-vệ, trong vườn Kỳ-thọ Cấp cô độc , cùng với chúng đại Tỳ-kheo một ngàn hai trăm năm mươi người.",
        "Bấy giờ, vào lúc sáng sớm, Thế Tôn khoác y cầm bát vào thành Xá-vệ khất thực. Khi ấy, Thế Tôn nghĩ rằng:",
        "“Ngày hôm nay khất thực, thời gian còn sớm, Ta hãy đến thăm khu rừng của Phạm chí Bố-tra-bà-lâu; đợi đến giờ rồi hãy đi khất thực”. Rồi Ngài đi đến rừng của Phạm chí. Phạm chí Bố-tra-bà-lâu từ xa trông thấy Phật đi đến, liền đứng dậy nghinh đón rằng: \n“Hoan nghinh, Sa-môn Cù-đàm! Lâu nay không đến. Nay vì duyên cớ gì lại khuất mình chiếu cố? Xin mời ngồi phía trước đây.”",
        "Thế Tôn ngồi xuống chỗ ấy, nói với Bố-tra-bà-lâu rằng:",
        "“Các ông tập họp tại đây, để làm gì? Để bàn chuyện gì?”",
        "Phạm chí bạch Phật:",
        "“Thế Tôn, ngày hôm qua có nhiều Sa-môn, Bà-la-môn tập họp tại giảng đường, bàn luận sự việc như vậy. Những vấn đề chống trái nhau.",
        "“Cù-đàm, hoặc có Phạm chí nói như vầy: ‘Con người phát sanh tưởng không do nhân gì duyên gì. Tưởng có đến, có đi. Đến thì tưởng sanh. Đi thì tưởng diệt ’.",
        "“Cù-đàm, hoặc có Phạm chí nói như vầy: ‘Do mạng, có tưởng sanh; do mạng, có tưởng diệt. Tưởng kia đi, đến. Đến thì tưởng sanh. Đi thì tưởng diệt. ’",
        "“Cù-đàm, hoặc có Phạm chí nói như vầy: ‘Các thuyết nói trước đó không đúng sự thật. Có vị đại quỷ thần, có uy lực lớn, mang tưởng đi; mang tưởng đến. Khi vị ấy mang tuởng đi thì tưởng diệt. Khi vị ấy mang tưởng đến thì tưởng sanh ’.",
        "“Tôi nhân đó có suy nghĩ, nghĩ rằng Sa-môn Cù-đàm tất biết rõ ý nghĩa này, tất có thể biết rõ tưởng tri diệt định .”",
        "Bấy giờ Thế Tôn nói với Phạm chí rằng:",
        "“Các luận thuyết ấy đều có chỗ sai lầm. Tức là nói không do nhân, không do duyên mà có tưởng sanh; không do nhân, không do duyên mà có tưởng diệt; tưởng có đến, đi; đến thì tưởng sanh, đi thì tưởng diệt. Hoặc nói nhân bởi mạng mà tưởng sanh, nhân bởi mạng mà tưởng diệt; tưởng có đến, đi; đến thì tưởng sanh, đi thì tưởng diệt. Hoặc nói, không hề có chuyện đó, mà là có một vị đại quỷ thần mang tưởng đến và mang tưởng đi; khi vị ấy mang đến thì tưởng sanh; khi mang đi thì tưởng diệt. Những lời như vậy thảy đều sai lầm. Vì sao? Này Phạm chí, có nhân, có duyên để tưởng sanh. Có nhân, có duyên để tưởng diệt.",
        "“Nếu Như Lai xuất hiện ở đời; là bậc Chí chơn, Đẳng chánh giác, mười hiệu đầy đủ. Có người ở trong Phật pháp mà xuất gia tu đạo, cho đến, diệt năm triền cái che lấp tâm, trừ khử dục, ác bất thiện pháp, có giác có quán, hỷ lạc do định sanh, nhập sơ thiền. Trước diệt tưởng về dục, rồi phát sanh tưởng về hỷ và lạc. Phạm chí, vì vậy biết có nhân duyên cho tưởng sanh, có nhân duyên cho tưởng diệt.",
        "“Diệt giác, quán, nội tâm hoan hỷ , nhất tâm, không giác, không quán, hỷ và lạc do định sanh, nhập đệ nhị thiền. Phạm chí, kia tưởng của sơ thiền diệt, tưởng của nhị thiền sanh, vì vậy nên biết có nhân duyên để tưởng diệt; có nhân duyên để tưởng sanh.",
        "“Dứt hỷ, an trú xả, chuyên niệm nhất tâm, tự biết thân lạc, điều mà Hiền Thánh mong cầu, hộ niệm thanh tịnh, nhập đệ tam thiền. Phạm chí, kia tưởng của nhị thiền diệt, tưởng của tam thiền sanh. Vì vậy nên biết có nhân duyên để tưởng diệt, có nhân duyên để tưởng sanh.",
        "“Dứt khổ, dứt lạc, ưu và hỷ từ trước đã diệt, xả niệm thanh tịnh, nhập đệ tứ thiền . Phạm chí, kia tưởng tam thiền diệt, tưởng tứ thiền sanh. Vì vậy biết rằng có nhân duyên để tưởng diệt; có nhân duyên để tưởng sanh.",
        "“Xả hết thảy tưởng về sắc, diệt nhuế , không niệm dị tưởng , nhập không xứ . Này Phạm chí, tưởng về hết thảy sắc diệt, tưởng về không xứ sanh. Vì vậy biết rằng có nhân duyên để tưởng sanh, có nhân duyên để tưởng diệt.",
        "“Vượt hết thảy không xứ, nhập thức xứ. Này Phạm chí, tưởng về không xứ diệt, tưởng về thức xứ sanh. Vì vậy biết rằng có nhân duyên để tưởng sanh, có nhân duyên để tưởng diệt.",
        "“Vượt hết thảy thức xứ, nhập bất dụng xứ . Này Phạm chí, tưởng về thức xứ diệt, tưởng về bất dụng xứ sanh. Vì vậy biết rằng có nhân duyên để tưởng sanh, có nhân duyên để tưởng diệt .",
        "“Xả bất dụng xứ, nhập hữu tưởng vô tưởng xứ. Này Phạm chí, tưởng về bất dụng xứ diệt, tưởng về hữu tưởng vô tưởng xứ sanh. Vì vậy biết rằng có nhân duyên để tưởng sanh, có nhân duyên để tưởng diệt.",
        "“Kia xả hữu tưởng vô tưởng xứ, nhập tưởng tri diệt định. Này Phạm chí, tưởng về hữu tưởng vô tưởng xứ diệt; nhập tưởng tri diệt định. Vì vậy biết rằng có nhân duyên để tưởng sanh, có nhân duyên để tưởng diệt.",
        "“Vị ấy khi đạt đến tưởng này rồi, suy nghĩ như vầy: có niệm là ác, không niệm là thiện. Vị ấy khi suy nghĩ như vậy, tưởng vi diệu của vị ấy không diệt, mà tưởng thô lại sanh. Vị ấy lại suy nghĩ: Nay ta không nên niệm hành, không khởi tư duy. Vị ấy khi không niệm hành, không khởi tư duy, tưởng vi diệu diệt, tưởng thô không sanh. Khi vị ấy không niệm hành, tưởng vi diệu diệt, tưởng thô không sanh, liền nhập định tưởng tri diệt.",
        "“Thế nào, Phạm chí, từ trước đến nay ông đã bao giờ nghe nhân duyên của thứ tự diệt tưởng này chưa?”",
        "Phạm chí bạch Phật:",
        "“Tôi tin là từ trước đến nay chưa bao giờ nghe đến nhân duyên của thứ tự diệt tưởng này.”",
        "Phạm chí lại bạch Phật:",
        "“Nay tôi có ý nghĩ như vầy, tức là, đây là có tưởng; đây là không có tưởng. Hoặc lại có tưởng. Sau khi có tưởng như vậy rồi, vị ấy suy nghĩ như vầy: có niệm là ác, không niệm là thiện. Vị ấy khi suy nghĩ như vậy, tưởng vi diệu của vị ấy không diệt, mà tưởng thô lại sanh. Vị ấy lại suy nghĩ: Nay ta không nên niệm hành, không khởi tư duy. Vị ấy khi không niệm hành, không khởi tư duy, tưởng vi diệu diệt, tưởng thô không sanh. Khi vị ấy không niệm hành, tưởng vi diệu diệt, tưởng thô không sanh, liền nhập định tưởng tri diệt.”",
        "Phật nói với Phạm chí:",
        "“Lành thay, lành thay, đó là theo thứ tự đạt diệt tưởng định trong pháp của Hiền Thánh.”",
        "Phạm chí lại bạch Phật:",
        "“Trong các tưởng này, tưởng nào là tối thượng bậc nhất?”",
        "Phật nói với Phạm chí:",
        "“Những gì được nói là có tưởng, và những gì được nói là không có tưởng, ở khoảng trung gian đó mà có thể thứ tự đạt được tưởng tri diệt định, đó là tưởng tối thượng bậc nhất.”",
        "Phạm chí lại hỏi:",
        "“Là một tưởng, hay nhiều tưởng?”",
        "Phật nói:",
        "“Có một tưởng. Không có nhiều tưởng.”",
        "Phạm chí lại hỏi:",
        "“Trước có tưởng sanh sau đó mới trí, hay trước có trí sanh sau đó mới tưởng?”",
        "Phật nói:",
        "“Trước có tưởng sanh, sau đó mới trí. Do tưởng mà có trí.”",
        "Phạm chí lại hỏi:",
        "“Tưởng tức là ngã  chăng?”",
        "Phật hỏi:",
        "“Ngươi nói con người như thế nào là ngã?”",
        "Phạm chí nói:",
        "“Tôi không nói con người là ngã. Tôi tự nói, sắc thân với bốn đại, sáu nhập, do cha mẹ sanh, được nuôi nấng mà lớn, trang sức bằng y phục, nhưng là pháp vô thường, biến hoại. Tôi nói, con người đó là ngã.”",
        "Phật nói với Phạm chí:",
        "“Ngươi nói, sắc thân với bốn đại, sáu nhập, do cha mẹ sanh, được nuôi nấng mà lớn, trang sức bằng y phục, nhưng là pháp vô thường, biến hoại. Nói con người đó là ngã. Này Phạm chí, hãy gác qua tự ngã đó. Nhưng, tưởng của con người sanh, tưởng của con người diệt.”",
        "Phạm chí nói:",
        "“Tôi không nói con người là ngã. Tôi nói, Dục giới thiên là ngã .”",
        "Phật nói:",
        "“Này Phạm chí, hãy gác qua Dục giới thiên là tự ngã đó. Nhưng, tưởng của con người sanh, tưởng của con người diệt.”",
        "Phạm chí nói:",
        "“Tôi không nói con người là ngã. Tôi tự nói, Sắc giới thiên là ngã.”",
        "Phật nói:",
        "“Này Phạm chí, hãy gác qua Sắc giới thiên là tự ngã đó. Nhưng, tưởng của con người sanh, tưởng của con người diệt.”",
        "Phạm chí nói:",
        "“Tôi không nói con người là ngã. Tôi tự nói không xứ, thức xứ, bất dụng xứ, hữu tưởng vô tưởng xứ, Vô sắc thiên, là ngã.”",
        "Phật nói:",
        "“Hãy gác qua không xứ, thức xứ, vô sở hữu xứ, hữu tưởng vô tưởng xứ, vô sắc thiên, là ngã. Nhưng, tưởng của con người sanh, tưởng của con người diệt.”",
        "Phạm chí bạch Phật:",
        "“Thế nào, thưa Cù-đàm, tôi có thể biết được tưởng của con người sanh, tưởng của con người diệt không? ”",
        "Phật nói:",
        "“Ngươi muốn biết tưởng của con người sanh, tưởng của con người diệt. Thật quá khó! Thật quá khó! Vì sao vậy? Vì do ngươi, y pháp khác mà có kiến giải khác, tập hành khác, nhẫn khác, thọ khác.”",
        "Phạm chí bạch Phật:",
        "“Thật vậy, thưa Cù-đàm, tôi y theo pháp khác mà có kiến giải khác, tập hành khác, nhẫn khác, thọ khác, cho nên, muốn biết tưởng của con người sanh, tưởng của con người diệt, thật quá khó! Thật quá khó! Vì sao vậy? Ngã, thế gian là thường hằng: đây là thật, ngoài ra là dối. Ngã, thế gian là vô thường: đây là thật, ngoài ra là dối. Ngã, thế gian vừa thường vừa vô thường: đây là thật, ngoài ra là dối. Ngã, thế gian không phải thường không phải vô thường: đây là thật, ngoài ra là dối. Ngã, thế gian là hữu biên: đây là thật, ngoài ra là dối. Ngã, thế gian là vô biên: đây là thật, ngoài ra là dối. Ngã, thế gian vừa hữu biên vừa vô biên: đây là thật, ngoài ra là dối. Ngã, thế gian không phải hữu biên không phải vô biên: đây là thật, ngoài ra là dối. Thân tức là mạng: đây là thật, ngoài ra là dối. Mạng khác thân khác: đây là thật, ngoài ra là dối. Thân, mạng không phải khác không phải không khác: đây là thật, ngoài ra là dối. Không mạng, không thân: đây là thật, ngoài ra là dối. Như Lai có tận cùng: đây là thật, ngoài ra là dối. Như Lai không có tận cùng: đây là thật, ngoài ra là dối. Như Lai không phải có tận cùng không phải không có tận cùng: đây là thật, ngoài ra là dối.”",
        "Phật nói với Phạm chí:",
        "“Thế gian là thường hằng, cho đến, Như Lai không phải có tận cùng không phải không có tận cùng: là những câu hỏi Ta không trả lời.”",
        "Phạm chí bạch Phật:",
        "“Cù Đàm, vì sao không trả lời, Ngã và thế gian là thường hằøng, cho đến, Như Lai không phải có tận cùng không phải không có tận cùng?”",
        "Phật nói:",
        "“Vì chúng không phù hợp ý nghĩa, không phù hợp pháp, không phải phạm hạnh, không phải vô dục, không phải vô vi, không phải tịch diệt, không phải chỉ tức, không phải chánh giác, không phải Sa-môn, không phải Nê-hoàn. Vì vậy Ta không trả lời.”",
        "Phạm chí lại hỏi:",
        "“Thế nào là phù hợp nghĩa, phù hợp pháp? Thế nào là phạm hạnh sơ ? Thế nào là vô vi ? Thế nào là vô dục ? Thế nào là tịch diệt ? Thế nào là chỉ tức ? Thế nào là chánh giác ? Thế nào là Sa-môn ? Thế nào là nê-hoàn ? Thế nào là vô ký ? ”",
        "Phật nói:",
        "“Ta trả lời về khổ đế, về khổ tập, khổ diệt, khổ xuất yếu đế. Vì sao vậy? Vì phù hợp nghĩa, phù hợp pháp, là phạm hạnh sơ thủ, là vô dục, vô vi, tịch diệt, chỉ tức, chánh giác, Sa-môn, Nê-hoàn. Vì vậy Ta trả lời.”",
        "Bấy giờ, Thế Tôn thuyết pháp cho Phạm chí nghe xong, chỉ bày, khuyến khích, làm cho ích lợi, hoan hỷ, Ngài đứng dậy mà đi.",
        "Phật đi chưa bao lâu, sau đó các Phạm chí khác nói với Phạm chí Bố-tra-bà-lâu rằng:",
        "“Tại sao ngươi nghe theo những lời của Sa-môn Cù-đàm? Chấp nhận những lời của Cù-đàm rằng: ‘Ngã và thế gian là thường hằng, cho đến, Như Lai không phải có tận cùng không phải không có tận cùng, là những vấn đề không phù hợp nghĩa nên Ta không trả lời.’ Tại sao ngươi ấn khả những lời như vậy? Chúng ta không chấp nhận sở thuyết như vậy của Sa-môn Cù-đàm”",
        "Bố-tra-bà-lâu trả lời các Phạm chí:",
        "“Sa-môn Cù-đàm nói rằng: ‘Ngã và thế gian là thường hằng, cho đến, Như Lai không phải có tận cùng không phải không có tận cùng, là những vấn đề không phù hợp nghĩa nên Ta không trả lời.’ Tôi cũng không ấn khả lời ấy. Nhưng Sa-môn Cù-đàm kia y trên Pháp, trụ trên Pháp, đúng Pháp mà nói, đúng theo Pháp mà xuất ly; làm sao tôi có thể chống lại lời nói có trí tuệ ấy? Pháp ngôn vi diệu như thế của Sa-môn Cù-đàm, không thể chống trái được.”",
        "Rồi, một lúc khác, Phạm chí Bố-tra-bà-lâu cùng với Tượng Thủ Xá-lợi-phất  đến chỗ Thế Tôn, chào hỏi xong, ngồi xuống một bên. Tuợng Thủ lễ Phật xong rồi ngồi xuống. Phạm chí bạch Phật:",
        "“Trước đây Phật tại chỗ tôi. Khi Ngài đi chưa lâu, sau đó các Phạm chí khác nói với tôi rằng: ‘Tại sao ngươi nghe theo những lời của Sa-môn Cù-đàm? Chấp nhận những lời của Cù-đàm rằng: ‘Ngã và thế gian là thường hằng, cho đến, Như Lai không phải có tận cùng không phải không có tận cùng, là những vấn đề không phù hợp nghĩa nên Ta không trả lời.’ Tại sao ngươi ấn khả những lời như vậy? Chúng ta không chấp nhận sở thuyết như vậy của Sa-môn Cù Đàm.’Tôi trả lời các Phạm chí: ‘Sa-môn Cù-đàm nói rằng: ‘Ngã và thế gian là thường hằng, cho đến, Như Lai không phải có tận cùng không phải không có tận cùng, là những vấn đề không phù hợp nghĩa nên Ta không trả lời.’ Tôi cũng không ấn khả lời ấy. Nhưng Sa-môn Cù-đàm kia y trên Pháp, trụ ttrên Pháp, đúng Pháp mà nói, đúng theo Pháp mà xuất ly; làm sao chúng ta có thể chống lại lời nói có trí tuệ ấy? Pháp ngôn vi diệu như thế của Sa-môn Cù-đàm, không thể chống trái được’.”",
        "Phật nói với Phạm chí:",
        "“Các Phạm chí nói: ‘Ngươi tại sao nghe những điều Sa-môn Cù-đàm nói mà ấn khả?’ Lời ấy sai lầm. Vì sao vậy? Pháp mà Ta nói, có trường hợp được ghi nhận xác quyết, có trường hợp không được ghi nhận xác quyết. Thế nào gọi là không ghi nhận xác quyết? Ngã, thế gian thường hằng, cho đến, Như Lai không phải có tận cùng không phải không có tận cùng. Ta cũng nói lời ấy, nhưng không ghi nhận xác ký. Sở dĩ như vậy, vì những lời ấy không phù hợp nghĩa, không phù hợp pháp, không phải là phạm hạnh sơ, không phải vô dục, không phải vô vi, không phải tịch diệt, không phải chỉ tức, không phải chánh giác, không phải Sa-môn, không phải nê-hoàn. Vì vậy, này Phạm chí, Ta tuy nói những lời ấy nhưng không ghi nhận xác quyết. Thế nào gọi là ghi nhận xác quyết? Ta ghi nhận khổ đế, khổ tập, khổ diệt, khổ xuát yếu đế. Vì sao vậy? Điều đó phù hợp nghĩa, phù hợp pháp, là phạm hạnh sơ thủ, vô dục, vô vi, tịch diệt, chỉ tức, chánh giác, Sa-môn, nê-hoàn. Vì vậy, Ta nói được ghi nhận xác quyết.",
        "“Hoặc có Sa-môn, Bà-la-môn, chủ trương ở một nơi thế gian chỉ có hoàn toàn lạc. Ta nói với vị ấy rằng: ‘Các ông có thật chủ trương ở một nơi thế gian chỉ có hoàn toàn lạc chăng?’ Những vị ấy trả lời Ta rằng: ‘Thật vậy.’ Ta lại nói với họ rằng: ‘Các ông có thấy, biết một nơi thế gian chỉ có hoàn toàn lạc không?’ Họ trả lời: ‘Không thấy, không biết.’ Ta lại nói với họ: ‘Chư thiên ở một nơi thế gian chỉ có hoàn toàn lạc; các ông đã từng thấy chưa?’ Kia đáp: ‘Không biết, không thấy.’ Ta lại hỏi: ‘Chư thiên ở một nơi thế gian kia, có bao giờ các ông từng cùng đứng ngồi trò chuyện, tinh tấn tu định chưa?’ Đáp rằng: ‘Chưa.’ Ta lại hỏi: ‘Chư thiên ở một nơi thế gian hoàn toàn sung sướng kia, có bao giờ đến nói với các ông chưa, rằng: ‘Việc làm của ngươi chất trực, ngươi sẽ sanh lên cõi trời hoàn toàn sung sướng kia. Ta do việc làm chất trực, nên được sanh lên kia cùng hưởng thọ dục lạc?’ Kia đáp rằng:’Chưa.’ Ta lại hỏi: ‘Các ông có thể ở nơi thân của mình, khởi tâm biến hóa thành thân tứ đại khác, thân thể đầy đủ, các căn không khuyết, hay không?’ Kia đáp: ‘Không thể.’ Thế nào, Phạm chí, những điều mà Sa-môn, Bà-la-môn kia nói có thành thật chăng? Có thích ứng với pháp chăng?”",
        "Phạm chí bạch Phật:",
        "“Đấy không phải là thành thật; không phải là lời nói đúng pháp.”",
        "Phật bảo Phạm chí:",
        "“Như có người nói: ‘Tôi đã giao thông với người nữ xinh đẹp kia, khen ngợi dâm nữ kia.’ Người khác hỏi: ‘Ngươi có biết người nữ ấy không? Ở tại địa phương nào: Đông, Tây, Nam, Bắc?’ Đáp: ‘Không biết.’ Lại hỏi: ‘Ngươi có biết đất đai, thành ấp, chòm xóm mà người nữ ấy cư ngụ không?’Đáp: ‘Không biết.’ Lại hỏi: ‘Ngươi có biết người kia là Sát-lợi, hay Bà-la-môn, hay cư sĩ, hay thủ-đà-la không?’ Đáp: ‘Không.’ Lại hỏi: ‘Ngươi có biết người kia cao hay thấp, thô kệch hay thanh lịch. Đen hay trắng, xấu hay đẹp không?’ Đáp: ‘Không.’ Thế nào, Phạm chí, những điều mà người này nói có thành thật chăng?’",
        "Đáp: ‘Không.’",
        "“Phạm chí, Sa-môn, Bà-la-môn kia cũng vậy, không có sự chân thật. Phạm chí, cũng như có người dựng thang nơi khoảng đất trống. Những người khác hỏi: ‘Dựng thang để làm gì?’ Đáp: ‘Tôi muốn leo lên nhà trên.’ Thế nào, Phạm chí, người dựng thang kia há không phải là dối sao?”",
        "Đáp: “Kia thật sự hư dối”.",
        "Phật nói:",
        "“Các Sa-môn, Bà-la-môn kia cũng vậy, hư dối, không thật.”",
        "Phật bảo Bố-tra-bà-lâu:",
        "“Thân ta, sắc gồm bốn đại, sáu nhập, do cha mẹ sanh, được nuôi lớn bằng bú mớm, trang sức bằng y phục, vô thường hoại diệt; thân đó được cho là ngã. Ta nói đó là ô nhiễm, là thanh tịnh, là được giải thoát. Ý của ngươi hoặc giả cho rằng pháp nhiễm ô không thể diệt, pháp thanh tịnh không thể sanh, luôn luôn tồn tại trong đau khổ. Chớ nghĩ như vậy. Vì sao? Vì, pháp nhiễm ô có thể bị diệt tận, pháp thanh tịnh có thể xuất sanh, an trú nơi lạc địa, hoan hỷ, ái lạc, chuyên niệm, nhất tâm, trí tuệ rộng lớn. Phạm chí, Ta đối với Dục giới thiên, Sắc giới thiên, Không xứ, Thức xứ, Bất dụng xứ, Hữu tưởng vô tưởng thiên, nói là ô nhiễm, và cũng nói là thanh tịnh, cũng nói là được giải thoát. Ý ngươi có thể cho rằng pháp nhiễm ô không thể diệt, pháp thanh tịnh không thể sanh, luôn luôn tồn tại trong đau khổ. Chớ nghĩ như vậy. Vì sao? Vì, pháp nhiễm ô có thể bị diệt tận, pháp thanh tịnh có thể xuất sanh, an trú nơi lạc địa, hoan hỷ, ái lạc, chuyên niệm, nhất tâm, trí tuệ rộng lớn. ”",
        "Bấy giờ Tượng Thủ Xá-lợi-phất bạch Phật rằng:",
        "“Thế Tôn, khi đang hiện hữu thân người thuộc Dục giới, với bốn đại và các căn, khi ấy thân thuộc Dục giới thiên, thân thuộc Sắc giới thiên, thân thuộc không xứ, thức xứ, bất dụng xứ, hữu tưởng vô tưởng xứ thiên, lúc ấy có đồng thời cùng hiện hữu không?",
        "“Bạch Thế Tôn, khi đang hiện hữu thân thuộc Dục giới thiên, khi ấy thân người thuộc Dục giới với bốn đại và các căn, thân thuộc Sắc giới thiên, thân thuộc Không xứ, Thức xứ, Bất dụng xứ, Hữu tưởng vô tưởng xứ thiên, lúc ấy có đồng thời cùng hiện hữu không?",
        "“Bạch Thế Tôn, khi đang hiện hữu thân thuộc Sắc giới thiên, khi ấy thân người thuộc Dục giới với bốn đại và các căn, thân thuộc Dục giới thiên, thân thuộc Không xứ, Thức xứ, Bất dụng xứ, Hữu tưởng vô tưởng xứ có đồng thời cùng hiện hữu không?",
        "“Cũng vậy, cho đến, khi đang hiện hữu thân thuộc Hữu tưởng vô tưởng xứ, khi ấy thân người thuộc Dục giới với bốn đại và các căn, thân thuộc Dục giới thiên, thân thuộc Sắc giới thiên, thân thuộc Không xứ, thức xứ, Bất dụng xứ thiên có đồng thời cùng hiện hữu không?”",
        "Phật nói với Tượng Thủ Xá-lợi-phất :",
        "“Khi đang hiện hữu thân người thuộc Dục giới với bốn đại và các căn, thì ngay khi ấy là thân người thuộc Dục giới với bốn đại và các căn, chứ không phải là thân thuộc Dục giới thiên, thân Sắc giới thiên, thân Không xứ thiên, thân Thức xứ thiên, thân Vô sở hữu xứ thiên, thân Hữu tưởng vô tưởng thiên. Cũng vậy, cho đến, nếu khi đang hiện hữu thân Hữu tưởng vô tưởng thiên, thì ngay khi ấy là thân Hữu tưởng vô tưởng thiên, chứ không phải là thân người Dục giới với bốn đại và các căn, không phải là thân Dục giới thiên, thân Sắc giới thiên, thân Không xứ, Thức xứ, Vô sở hữu xứ thiên.",
        "“Này Tưởng Thủ, ví như sữa bò. Sữa biến thành tô. Tô biến thành lạc. Lạc biến thành sanh tô. Sanh tô biến thành thục tô. Thục tô biến thành đề hồ. Đề hồ là bậc nhất. Khi là sữa, thì chỉ được gọi là sữa mà không gọi là lạc, tô, đề hồ. Cũng vậy, lần lượt cho đến khi là đề hồ, thì khi ấy chỉ được gọi là đề hồ mà không gọi là lạc, tô.",
        "“Tượng Thủ, ở đây cũng vậy, khi đang hiện hữu thân người thuộc Dục giới với bốn đại và các căn, thì ngay khi ấy là thân người thuộc Dục giới với bốn đại và các căn, chứ không phải là thân thuộc Dục giới thiên, cho đến, không phải là thân Hữu tưởng vô tưởng thiên. Cũng vậy, lần lượt cho đến, khi đang hiện hữu thân Hữu tưởng vô tưởng thiên, thì ngay khi ấy chỉ có thân Hữu tưởng vô tưởng thiên, chứ không phải là thân người Dục giới với bốn đại và các căn, cho đến, thân Vô sở hữu xứ thiên.",
        "“Tượng Thủ, ý ngươi nghĩ sao? Nếu có người hỏi ngươi: ‘Khi đang hiện hữu thân quá khứ; khi ấy thân vị lai và thân hiện tại có cùng nhất thời hiện hữu không? Khi đang hiện hữu thân vị lai, khi ấy thân quá khứ và thân hiện tại có đồng thời hiện hữu không? Khi đang hiện hữu thân hiện tại, khi ấy thân quá khứ và thân vị lai có đồng thời hiện hữu không?’ Giả sử được hỏi như vậy, ngươi sẽ trả lời như thế nào?”",
        "Tượng Thủ đáp:",
        "“Giả sử có người hỏi như vậy, con sẽ trả lời người ấy rằng: ‘Khi đang hiện hữu thân quá khứ, khi ấy duy chỉ là thân quá khứ, mà không phải là thân hiện tại và vị lai. Khi đang hiện hữu thân vị lai, khi ấy duy chỉ là thân vị lai. Chứ không phải là thân quá khứ và hiện tại. Khi đang hiện hữu thân hiện tại, khi ấy chỉ là thân hiện tại, chứ không phải là thân quá khứ và thân vị lai’.”",
        "Phật nói:",
        "“Tượng Thủ, ở đây cũng vậy, khi đang hiện hữu thân người thuộc Dục giới với bốn đại và các căn, thì ngay khi ấy là thân người thuộc Dục giới với bốn đại và các căn, chứ không phải là thân thuộc Dục giới thiên, cho đến, không phải là thân Hữu tưởng vô tưởng thiên. Cũng vậy, lần lượt cho đến, khi đang hiện hữu thân Hữu tưởng vô tưởng thiên, thì ngay khi ấy chỉ có thân Hữu tưởng vô tưởng thiên, chứ không phải là thân người Dục giới với bốn đại và các căn, cho đến, thân Bất dụng xứ thiên.",
        "“Lại nữa, Tượng Thủ, giả sử có người hỏi ngươi: ‘Có phải ngươi trong quá khứ đã từng hiện hữu và đã diệt; vị lai sẽ sanh, và hiện tại đang tồn tại chăng?’ Nếu được hỏi như vậy, ngươi sẽ trả lời như thế nào?”",
        "Tượng Thủ bạch phật:",
        "“Giả sử có người hỏi như vậy, con sẽ trả lời người ấy rằng: ‘Trong quá khứ tôi đã từng hiện hữu; không phải không hiện hữu. Trong vị lai, tôi sẽ sanh, chứ không phải không có; trong hiện tại, tôi đang tồn tại. Chứ không phải không có.”",
        "Phật nói:",
        "“Tượng Thủ, ở đây cũng vậy, khi đang hiện hữu thân người thuộc Dục giới với bốn đại và các căn, thì ngay khi ấy là thân người thuộc Dục giới với bốn đại và các căn, chứ không phải là thân thuộc Dục giới thiên, cho đến, không phải là thân Hữu tưởng vô tưởng thiên. Cũng vậy, lần lượt cho đến, khi đang hiện hữu thân Hữu tưởng vô tưởng thiên, thì ngay khi ấy chỉ có thân Hữu tưởng vô tưởng thiên, chứ không phải là thân người Dục giới với bốn đại và các căn, cho đến, thân Vô sở hữu xứ thiên.”",
        "Bấy giờ, Tượng Thủ bạch Phật:",
        "“Con nay quy y Phật, quy y Pháp, quy y Tăng. Xin nhận con là ưu-bà-tắc trong Chánh pháp. Từ nay đến trọn đời, nguyện không giết, không trộm, không tà dâm, không dối, không uống rượu.”",
        "Khi ấy Phạm chí Bố-tra-bà-lâu bạch Phật:",
        "“Con có thể ở trong Phật pháp xuất gia, thọ giới cụ túc được không?”",
        "Phật nói với Phạm chí:",
        "“Nếu có người dị học muốn được xuất gia thọ giới trong Pháp của Ta, trước hết phải cần bốn tháng quán sát, làm hài lòng đại chúng, sau đó mới được xuất gia thọ giới. Tuy có quy định như vậy, nhưng cũng còn nhận xét tùy người.”",
        "Phạm chí bạch Phật:",
        "“Nếu có các người dị học muốn được xuất gia thọ giới trong Phật Pháp, trước hết phải cần bốn tháng quán sát, làm hài lòng đại chúng, sau đó mới được xuất gia thọ giới. Như con nay, có thể ở trong Phật pháp qua bốn tháng quan sát, khi đại chúng hài lòng, con mới xin xuất gia thọ giới cụ túc.”",
        "Phật nói với Phạm chí:",
        "“Ta đã có nói với ngươi trước rồi. Tuy có quy định như vậy, nhưng cũng còn nhận xét tùy người.”",
        "Bấy giờ Phạm chí liền được xuất gia thọ giới cụ túc ở trong Chánh pháp. Như vậy không bao lâu, do tín tâm kiên cố, tịnh tu phạm hạnh, ở ngay trong đời này mà tự thân tác chứng, sanh tử đã dứt, điều cần làm đã làm xong, không còn tái sinh nữa; tức thành A-la-hán.",
        "Bấy giờ, Bố-tra-bà-lâu sau khi nghe những điều Phật dạy hoan hỷ phụng hành."
    ]
}