{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "30. KINH THẾ KÝ - PHẨM 11 : BA TRUNG KIẾP",
        "Số Phẩm": "PHẦN 3",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Phật bảo Tỳ-kheo:",
        "“Có ba trung kiếp. Những gì là ba? Một là kiếp đao binh. Hai là kiếp đói kém. Ba là kiếp tật dịch",
        "“Thế nào là kiếp đao binh?",
        "“Người thế gian này vốn thọ bốn vạn tuổi. Sau đó giảm xuống, thọ hai vạn tuổi. Sau đó lại giảm nữa, thọ một vạn tuổi. Lần lượt giảm, thọ một ngàn năm, năm trăm năm, ba trăm năm, hai trăm năm. Như nay con người thọ một trăm tuổi, với số ít vượt quá, mà phần nhiều là dưới. Sau đó, tuổi thọ con người giảm dần xuống còn mười tuổi. Khi đó, người nữ sinh ra chừng năm tháng là đi lấy chồng. Bấy giờ, các loại mỹ vị có được trong thế gian như bơ sữa, mật, đường thẻ, đường đen, những gì có vị ngon, tự nhiên biến mất; ngũ cốc không sinh sản, chỉ còn có loại lúa hoang mà thôi. Lúc này, các loại y phục cao cấp như gấm vóc, lụa là, kiếp bối, sô-ma, tất cả đều không còn nữa, mà chỉ còn có loại vải dệt thô sơ bằng cỏ. Bấy giờ, mặt đất này hoàn toàn chỉ sinh gai gốc, muỗi mòng, ong, bọ cạp, rắn, rết, trùng độc; còn vàng bạc, lưu ly, bảy báu, châu ngọc, tự nhiên chúng bị vùi vào đất hết, và chỉ có đá, cát, các thứ xấu xí là dẫy đầy. Lúc này chúng sanh chỉ làm mười điều ác càng ngày càng tăng, không còn nghe đến danh từ mười điều thiện, cho đến không có cả danh từ thiện, huống chi là có người làm việc thiện? Bấy giờ, trong loài người ai không có hiếu với cha mẹ, không kính trọng sư trưởng, hay làm việc ác thì được cúng dường, được mọi người cung kính hầu hạ. Cũng người nay ai hiếu thuận mẹ cha, kính trọng sư trưởng, thường làm việc lành, thì được cúng dường, được mọi người cung kính hầu hạ, thì người làm việc ác kia lại cũng được cúng dường như vậy. Bây giờ, con người thân hoại mạng chung bị đọa vào trong súc sanh, cũng như con người hiện tại được sinh lên cõi trời. Lúc đó con người gặp nhau thường ôm lòng độc hại, chỉ muốn giết nhau; cũng giống như thợ săn gặp được đàn nai, chỉ muốn giết chúng, không có bất cứ một ý nghĩ thiện nào; con người lúc đó cũng như vậy, chỉ muốn giết nhau, không có một chút ý nghĩ thiện nào. Bấy giờ, mặt đất này chỉ là sông ngòi, khe suối, núi đồi, đất đống, không có chỗ đất nào bằng phẳng cả. Khi có người đi đến, tức thì kinh sợ, run rẩy, lông tóc dựng đứng.",
        "“Bấy giờ, trong vòng bảy ngày có sự nổi lên của kiếp đao kiếm. Lúc ấy, những thứ cỏ, cây, ngói, đá mà con người cầm trong tay đều biến thành đao kiếm; những thứ đao kiếm này rất bén nhọn, đụng đến vật gì thì vật đó đều sẽ bị cắt đứt. Chúng sát hại lẫn nhau. Trong lúc này có người có trí tuệ thấy đao binh sát hại nhau nên hoảng sợ tránh vào núi rừng, hang động, khe suối, những chỗ không người. Trốn tránh trong vòng bảy ngày, tâm nghĩ miệng tự nói: ‘Ta không hại người, người chớ hại ta.’ Trong vòng bảy ngày người này chỉ ăn rễ cây cỏ để tự nuôi sống mình. Qua bảy ngày, sau đó mới lại ra khỏi rừng núi. Lúc này, gặp được một người, vui mừng nói rằng: ‘Nay gặp được người còn sống! Nay gặp được người còn sống!’ Cũng giống như cha mẹ vì gặp lại một người con bị thất lạc lâu ngày không thấy nhau, nên vui mừng nhảy nhót mà không thể tự kiềm chế chính mình được, thì sự kiện người này cũng như vậy, vì sự vui mừng nên nhảy nhót mà không thể tự kiềm chế được cảm xúc vui nơi chính mình. Khi ấy thì người dân trong vòng bảy ngày chỉ có khóc lóc mà thôi; cũng trong vòng bảy ngày này họ lại cùng gặp vui nên vui vẻ chúc mừng nhau. Người lúc bấy giờ khi thân hoại mạng chung đều đọa vào địa ngục. Vì sao? Vì con người ấy luôn luôn ôm lòng sân hận và phẫn nộ, họ chỉ có một tâm hại nhau mà thôi, vì không có tâm nhân từ nên gọi là kiếp đao binh.” Phật bảo Tỳ-kheo:",
        "“Thế nào gọi là kiếp đói kém?.Con người bấy giờ phần nhiều làm những việc phi pháp, tà kiến điên đảo, làm mười nghiệp ác. Vì làm mười nghiệp ác nên trời không mưa xuống, làm cho trăm thứ cỏ cây chết khô, ngũ cốc không thành, mà chỉ có gốc rạ mà thôi.",
        "“Thế nào gọi là đói kém? Vì lúc bấy giờ, người dân phải thu quét những hạt thóc còn rơi rớt lại các nơi như ruộng vườn, đường sá, đầu ngõ, và trong phân đất d? tự sống còn, nên mới gọi là đói kém",
        "“Lại nữa, lúc đói kém, người bấy giờ lượm nhặt xương cốt từ những nơi như lò sát sanh, chợ búa, các đường sá và các bãi tha ma, rồi nấu nước trấp mà uống, nhờ vậy mà họ sống, nên gọi là ‘đói xương trắng’",
        "‘Lại nữa, vào kiếp đói kém, ngũ cốc được gieo trồng đều biến thành cỏ cây. Con người lúc này lấy bông nấu nước trấp để uống. Lại nữa, vào thời đói kém, bông của các loài cây cỏ rụng phủ kín cả mặt đất, lúc ấy mọi người phải đào đất lấy bông để nấu ăn, nhờ vậy mà tự tồn tại, nên gọi là ‘đói cây cỏ’. Bấy giờ, chúng sanh thân hoại mạng chung đọa vào trong ngạ quỷ. Sao vậy? Vì những người sống trong kiếp đói kém này, thường ôm lòng tham lam keo bẩn, không có lòng bố thí nhân ái, không chịu chia xẻ cùng người, và không nhớ nghĩ đến những tai ách của người khác.",
        "“Đấy là kiếp đói kém.”",
        "Phật bảo Tỳ-kheo:",
        "“Thế nào là kiếp tật dịch? Người đời bấy giờ, tu hành chánh pháp, chánh kiến không điên đảo, đầy đủ thập thiện hành. Có quỷ thần thế giới phương khác đến, mà quỷ thần ở đây thì buông lung dâm loạn, không thể hộ vệ con người được. Quỷ thần thế giới khác xâm lấn, nhiễu loạn con người thế gian này, họ dùng tay đánh đập, dùng gậy quật ngã, rồi hút lấy tinh khí, khiến cho tâm người loạn lên, rồi cưỡng bức mang đi. Giống như quốc vương ra lệnh cho các tướng soái những thứ phải bảo vệ, nhưng giặc cướp ở phương khác đến xâm phạm quấy nhiễu, mà các tướng soái ở đây lại buông lung, nên nước nhà bị chúng cướp mất. Ở đây cũng vậy, những quỷ thần ở thế giới khác đến bắt giữ mọi người ở thế gian này, chúng đánh đập, quật ngã, rồi hút lấy tinh khí mọi người, và cưỡng bức mang đi.”",
        "Phật bảo Tỳ-kheo:",
        "“Giả sử quỷ thần ở thế gian này dù không buông lung dâm loạn, nhưng khi quỷ thần có sức mạnh lớn ở thế giới khác đến, thì quỷ thần ở thế gian này cũng phải sợ hãi mà đi trốn. Các đại quỷ thần kia bèn xâm lấn, quấy nhiễu người ở đây, đánh đập, quật ngã, hút lấy tinh khí, giết chết rồi bỏ đi. Giống như quốc vương, hay đại thần của quốc vương sai khiến các tướng soái bảo vệ nhơn dân; tuy tất cả các tướng lãnh này đều trong sạch thận trọng, không buông lung, nhưng khi các tướng soái mạnh bạo, có binh lính đông đảo kia lại đến khuấy phá thành ấp, làng xóm, mà cướp đoạt người vật. Thì ở đây lại cũng như vậy, nếu quỷ thần ở thế gian này dù không dám buông lung đi nữa, nhưng khi các quỷ thần có sức mạnh lớn ở thế giới khác đến, thì các quỷ thần thế gian này cũng sẽ sợ hãi tránh đi, và những hàng quỷ thần lớn mạnh kia sẽ xâm đoạt, nhiễu hại người thế gian này; đánh đập, quật ngã, hút lấy tinh khí, và giết hại mọi người rồi bỏ đi.",
        "“Khi ấy, người dân trong kiếp tật dịch, sau khi thân hoại mạng chung đều sinh lên cõi trời. Vì sao? Vì con người lúc ấy đều hướng tâm từ bi đến nhau, thăm hỏi nhau: ‘Bệnh tật của bạn có giảm không? Thân thể có được an ổn không?’ Vì những nhân duyên này, nên họ được sinh lên cõi trời. Cho nên gọi là kiếp tật dịch.",
        "“Đó là ba trung kiếp.”"
    ]
}