{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "17. KINH THANH TỊNH",
        "Số Phẩm": "PHẦN 2",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Tôi nghe như vầy:",
        "Một thời, Phật ở tại nước Ca-duy-la vệ , trong khu rừng của ưu-bà-tắc Miến-kỳ , cùng với chúng đại Tỳ kheo một ngàn hai trăm năm mươi người.",
        "Bấy giờ, có sa-di Châu-na , ở tại nước Ba-ba, sau an cư mùa hạ, cầm y bát, đi lần đến nước Ca-duy-la-vệ, trong vườn Miến-kỳ; đến chỗ A-nan, cúi đầu lễ dưới chân, rồi đứng sang một bên, bạch A-nan rằng:",
        "“Có Ni-kiền Tử trong thành Ba-ba , chết chưa bao lâu, mà các đệ tử của ông đã chia làm hai phe. Họ tranh chấp nhau, trực diện mắng chửi nhau, không còn phân biệt trên dưới; tìm tòi khuyết điểm của nhau, ganh đua kiến thức với nhau rằng: ‘Ta có thể biết điều này; ngươi không thể biết điều này. Hành động của ta chân chính, còn ngươi là tà kiến. Ngươi đặt cái trước ra sau; để cái sau ra trước; điên đảo, thác loạn, không có phép tắc. Những điều ta làm thật là vi diệu. Những điều ngươi nói thì sai lầm. Ngươi có điều gì nghi ngờ, cứ hỏi ta.’ Bạch Đại đức A-nan, bấy giờ, những người thờ Ni-kiền Tử trong nước này nghe những tranh tụng như vậy sinh lòng chán ghét.”",
        "A-nan nói với sa-di Châu-na:",
        "“Ta có điều muốn bạch Thế Tôn. Ngươi hãy đi với ta, trình bày Thế Tôn về sự việc này. Nếu Thế Tôn có răn dạy điều gì, chúng ta hãy cùng phụng hành.”",
        "Rồi thì, sa-di Châu-na sau khi nghe A-nan nói bèn cùng đi theo đến chỗ Thế Tôn. Sau khi cúi lạy dưới chân Thế Tôn, bèn đứng sang một bên. Lúc bấy giờ, A-nan bạch Thế Tôn rằng:  “Sa-di Châu-na này, sau an cư mùa hạ ở nước Ba-ba, cầm y bát, đi lần đến đây. Sau khi đảnh lễ dưới chân con, nói với con rằng: ‘Có Ni-kiền Tử trong thành Ba-ba, chết chưa bao lâu, mà các đệ tử của ông đã chia làm hai phe. Họ tranh chấp nhau, trực diện mắng chửi nhau, không còn phân biệt trên dưới; tìm tòi khuyết điểm của nhau, ganh đua kiến thức với nhau rằng: ‘Ta có thể biết điều này; ngươi không thể biết điều này. Hành động của ta chân chính, còn ngươi là tà kiến. Ngươi đặt cái trước ra sau; để cái sau ra trước; điên đảo, thác loạn, không có phép tắc. Những điều ta làm thật là vi diệu. Những điều ngươi nói thì sai lầm. Ngươi có điều gì nghi ngờ, cứ hỏi ta.’ Bấy giờ, những người thời Ni-kiền Tử trong nước này nghe những tranh tụng như vậy sinh lòng chán ghét.’.”",
        "Thế Tôn nói với Châu-na:",
        "“Quả vậy, Châu-na, trong phi pháp ấy không có gì đáng để nghe. Đó không phải là những điều được nói bởi bậc Chánh đẳng chánh giác . Cũng như ngôi tháp đổ nát, khó có thể bôi màu . Kia tuy có thầy, nhưng thảy đều ôm giữ tà kiến. Tuy có pháp, nhưng thảy đều không chân chánh,không đáng để nghe theo, không có khả năng xuất ly , không phải là những điều được nói bởi Chánh đẳng chánh giác. Cũng như ngôi tháp đổ nát không thể bôi màu vậy.",
        "“Trong số các đệ tử của vị ấy có người không thuận theo pháp ấy, dứt bỏ tà kiến ấy, đi theo chánh kiến. Châu-na, nếu có người đến nói với các đệ tử ấy rằng: ‘Này chư hiền, pháp của thầy ông là chân chánh, nên tu hành trong pháp ấy, sao lại bỏ đi?’ Nếu người đệ tử này mà tin lời ấy, thì cả hai đều thất đạo, mắc tội vô lượng. Vì sao vậy? Kia tuy có pháp, nhưng không chân chánh.",
        "“Châu-na, nếu thầy không tà kiến, và pháp ấy chân chánh, có thể khéo léo nghe theo, có khả năng xuất yếu, là pháp được nói bởi đấng Chánh biến tri . Cũng như ngôi tháp mới có thể dễ dàng bôi màu. Nhưng nếu các đệ tử, ở trong pháp ấy, không tinh cần tu tập, không thể thành tựu, bỏ con đường bình đẳng, đi vào tà kiến. Nếu có người đến nói với các đệ tử ấy rằng: ‘Này chư hiền, pháp của thầy các người là chân chánh, nên ở trong đó mà tu hành, sao lại bỏ đi mà đi vào tà kiến?’ Các đệ tử ấy nếu tin lời ấy, thì cả hai đều thấy chân chánh, được phước vô lượng. Vì sao vậy? Vì pháp ấy chân chánh.” Phật bảo Châu-na:",
        "“Kia tuy có thầy, nhưng ôm giữ tà kiến. Tuy cũng có pháp, nhưng thảy đều không chân chánh, không có khả năng xuất yếu, không phải là pháp được thuyết bởi đấng Chánh biến tri. Cũng như ngôi tháp đổ nát không thể bôi màu. Các đệ tử kia thành tựu pháp và tùy pháp, tùy thuận theo mà tu hành, nhưng lại khởi tà kiến. Châu-na, nếu có người đến nói đệ tử ấy rằng: ‘Pháp của thầy ngươi là chân chánh. Điều ngươi làm là đúng. Nay ngươi tu hành cần khổ như vậy, có thể ở trong đời này ngươi sẽ thành tựu đạo quả.’ Các đệ tử kia tin lời ấy, thì cả hai đều thất đạo, mắc tội vô lượng. Vì sao vậy? Vì pháp không chân chánh vậy.",
        "“Này Châu-na, nếu bậc thầy không tà kiến; Pháp của vị ấy chân chánh, có thể khéo léo nghe theo, có khả năng xuất ly, là pháp được thuyết bởi đấng Chánh biến tri. Cũng như ngôi tháp mới thì dễ bôi màu. Nay đệ tử của vị ấy thành tựu pháp và tùy pháp, tùy thuận tu hành mà sanh chánh kiến. Nếu có người đến nói với các đệ tử ấy rằng: ‘Pháp của thầy ngươi là chân chánh. Sở hành của ngươi là đúng. Nay cần khổ tu hành như vậy, có thể ở trong đời này mà thành tựu đạo quả.’ Các đệ tử kia tin lời ấy, cả hai đều chánh kiến, được phước vô lượng. Vì sao vậy? Vì pháp ấy chân chánh.",
        "“Này Châu-na, hoặc có bậc Đạo sư xuất thế khiến cho các đệ tử buồn rầu. Hoặc có Đạo sư xuất thế khiến các đệ tử không buồn rầu.",
        "“Thế nào là Đạo sư xuất thế khiến các đệ tử sinh buồn rầu?",
        "“Này Châu-na! Đạo sư mới xuất hiện thế gian, thành đạo chưa lâu, pháp của vị ấy đầy đủ phạm hạnh thanh tịnh, như thật chơn yếu nhưng không được phân bố rộng khắp, rồi vị đạo sư ấy lại chóng diệt độ. Các đệ tử vì thế không được tu hành, thảy đều buồn rầu mà nói rằng: ‘Thầy vừa mới xuất thế, thành đạo chưa lâu, pháp của Thầy đầy đủ phạm hạnh thanh tịnh, như thật chơn yếu, nhưng rốt cùng lại không được phân bố rộng khắp, mà nay Đạo sư lại nhanh chóng diệt độ, khiến cho đệ tử chúng ta không được tu hành.’ Đấy là có vị Đạo sư xuất thế nhưng đệ tử lại ưu sầu.",
        "“Thế nào là Đạo sư xuất thế, đệ tử không ưu sầu?",
        "“Có vị Đạo sư xuất thế, Pháp của vị ấy thanh tịnh, đầy đủ phạm hạnh, như thật chơn yếu, lại được lưu bố rộng rãi, rồi sau đó mới vào diệt độ. Các đệ tử vì thế mà được tu hành, không ưu sầu, mà nói rằng: ‘Thầy mới xuất hiện thế gian, thành đạo chưa lâu, pháp của Thầy thanh tịnh, đầy đủ phạm hạnh, như thật chơn yếu lại được lưu bố rộng rãi, rồi sau đó mới vào diệt độ, khiến cho đệ tử chúng ta thảy đều được tu hành.’ Này Châu-na, như vậy, Đạo sư xuất thế, đệ tử không ưu sầu.”",
        "Phật lại bảo Châu-na:",
        "“Với chi này mà phạm hạnh thành tựu. Đó là, Đạo sư xuất thế, xuất gia chưa bao lâu, danh tiếng chưa rộng, đó gọi là phạm hạnh chi chưa đầy đủ . Này Châu-na! Đạo sư xuất thế, xuất gia đã lâu, danh tiếng đã rộng rãi, đó gọi là chi phạm hạnh đầy đủ.",
        "“Này Châu-na, Đạo sư xuất thế, xuất gia đã lâu, danh tiếng đã rộng, nhưng các đệ tử chưa nhận được sự dạy dỗ, chưa đầy đủ phạm hạnh, chưa đến nơi an ổn , chưa đạt được mục đích của mình, chưa thể phân bố diễn thuyết pháp đã được thọ lãnh; nếu có dị luận nổi lên thì không thể như pháp mà diệt, chưa chứng đắc thần thông có khả năng biến hóa . Đó gọi là chi phạm hạnh chưa đầy đủ.",
        "“Này Châu-na! Đạo sư xuất thế, xuất gia đã lâu, danh tiếng đã rộng, mà các đệ tử thảy đều chịu giáo huấn, phạm hạnh đầy đủ, đã đến nơi an ổn, đã đạt được mục đích của mình, lại có thể phân biệt diễn thuyết pháp được lãnh thọ; nếu có dị luận khởi thì có thể như pháp mà diệt, đã chứng đắc thần thông có khả năng biến hóa đầy đủ. Đó là chi phạm hạnh đầy đủ.",
        "“Này Châu-na! Đạo sư xuất thế, xuất gia chưa lâu, danh tiếng chưa rộng, các Tỳ-kheo ni chưa nhận được sự dạy dỗ, chưa đến chỗ an ổn, chưa đạt được mục đích của mình, chưa thể phân bố diễn thuyết pháp đã được lãnh thọ; nếu có dị luận khởi lên chưa thể như thật diệt trừ bằng chánh pháp, chưa chứng đắc thần thông có khả năng biến hóa. Đó là chi phạm hạnh chưa đầy đủ.",
        "“Này Châu-na! Đạo sư xuất thế, xuất gia đã lâu, danh tiếng đã rộng, các Tỳ kheo ni thảy đều nhận được giáo huấn, phạm hạnh đầy đủ, đã đến nơi an ổn, có thể phân biệt diễn thuyết pháp đã lãnh thọ; nếu có dị luận khởi lên thì như pháp mà trừ diệt, đã chứng đắc thần thông có khả năng biến hóa. Đó là chi phạm hạnh đầy đủ.",
        "“Này Châu-na! Các ưu bà tắc, ưu bà di rộng tu phạm hạnh... cho đến... đã chứng đắc thần thông có khả năng biến hóa, cũng vậy.",
        "“Này Châu-na, nếu Đạo sư không còn ở đời, không có danh tiếng, sự lợi dưỡng tổn giảm. Đó là chi phạm hạnh không đầy đủ. Nếu Đạo sư tại thế, danh tiếng và lợi dưỡng đều có đủ, không có tổn giảm; đó là chi phạm hạnh đầy đủ.",
        "“Nếu Đạo sư còn ở đời, danh tiếng và lợi dưỡng thảy đều đầy đủ, nhưng các Tỳ-kheo không thể đầy đủ danh tiếng và lợi dưỡng. Đó là chi phạm hạnh không đầy đủ.",
        "“Nếu Đạo sư tại thế, danh tiếng và lợi dưỡng đầy đủ không tổn giảm, chúng các Tỳ-kheo cũng đầy đủ như vậy. Đó là chi phạm hạnh đầy đủ. Chúng Tỳ kheo ni cũng vậy.",
        "“Châu-na, Ta xuất gia đã lâu, danh tiếng rộng xa, các Tỳ-kheo của Ta đã nhận lãnh giáo huấn, đã đến chỗ an ổn, đã tự mình đạt được mục đích, lại có thể nói cho người khác pháp đã lãnh thọ; nếu có dị luận khởi lên có thể như pháp mà diệt, đã chứng đắc thần thông có khả năng biến hóa. Các Tỳ-kheo, Tỳ-kheo-ni, ưu-bà-tắc, ưu-bà-di, cũng vậy.",
        "“Châu-na, Ta đã lưu bố rộng rãi phạm hạnh... cho đến, đã chứng đắc thần thông có khả năng biến hóa.",
        "“Này Châu-na! Hết thảy Đạo sư trong thế gian, không thấy có ai có danh tiếng và lợi dưỡng như Ta, Như Lai, Chí chân, Đẳng chánh giác. Này Châu-na, hết thảy đồ chúng có trong thế gian, không thấy ai có danh tiếng và lợi dưỡng như chúng của Như Lai.",
        "“Châu-na, nếu muốn nói cho chân chánh, thì nên nói ‘thấy mà không thấy.’Thế nào là thấy mà không thấy? Hết thảy phạm hạnh thanh tịnh cụ túc, đã được tuyên thuyết, được lưu bố hiển thị.Đó gọi là thấy mà không thấy.”",
        "Rồi thì, đức Thế Tôn nói với các Tỳ kheo:",
        "“Uất-đầu-lam Tử  ở giữa đại chúng, nói như vậy: ‘Thấy mà không thấy. Thế nào là thấy mà không thấy? Như có thể thấy con dao nhưng không thể thấy sự bén nhọn.’ Này các Tỳ kheo, vị ấy chỉ dẫn lời nói không nhận thức của phàm phu mà ví dụ. Như vậy, này Châu-na, nếu muốn nói một cách chân chánh, nên nói: ‘Thấy mà không thấy.’ Thế nào là thấy mà không thấy? Ngươi cần phải nói một cách chân chánh rằng: ‘Hết thảy phạm hạnh thanh tịnh đầy đủ, được tuyên thị, lưu bố.",
        "Đó là thấy mà không thấy.’",
        "“Này Châu-na, pháp tương tục kia không đầy đủ nhưng có thể đạt được. Pháp không tương tục kia tuy đầy đủ nhưng không thể đạt được . Này Châu-na, phạm hạnh trong các pháp, là đề hoà trong các thứ tô lạc”",
        "Rồi Thế Tôn nói với các Tỳ-kheo:",
        "“Ta đối với pháp này tự thân tác chứng . Đó là bốn niệm xứ, bốn thần túc, bốn ý đoạn, bốn thiền, năm căn, năm lực, bảy giác ý, tám đạo Hiền Thánh. Các ngươi tất cả hãy cùng hòa hiệp chớ sanh tranh chấp. Cùng theo học một Thầy, cũng như nước và sữa hòa một; ở trong Chánh pháp của Như Lai, hãy tự thắp sáng cho mình, nhanh chóng được an lạc. Sau khi đã được an lạc, nếu có Tỳ-kheo nào, trong lúc có",
        "Tỳ-kheo đang thuyết pháp, mà nói rằng: ‘Điều được nói của vị kia, văn cú không chánh; nghĩa lý không chánh.’ Tỳ-kheo nghe như thế không nên nói đấy là đúng, cũng không nên nói đấy là sai, mà hãy nói với Tỳ-kheo ấy rằng: ‘Thế nào, chư hiền? Câu của tôi như vậy. Câu của các ngài như vậy. Nghĩa của tôi như vậy. Nghĩa của các ngài như vậy. Cái nào hơn? Cái nào thua?’ Nếu Tỳ-kheo kia nói rằng: ‘Câu của tôi như vậy. Câu của ngài như vậy. Nghĩa của tôi như vậy. Nghĩa của ngài như vậy. Câu của ngài hơn. Nghĩa của ngài cũng hơn.’ Tỳ-kheo kia nói vậy, nhưng cũng chớ cho là đúng, cũng chớ cho là sai, mà nên can gián Tỳ-kheo ấy, nên khuyến cáo hãy từ bỏ, hãy cùng suy cầu. Như vậy, cùng nhau hòa hiệp, chớ sanh tranh chấp. Cùng một Thầy học, như sữa và nước hiệp nhất; ở trong chánh pháp của Như Lai, hãy tự mình thắp sáng, chóng được an lạc.",
        "“Sau khi đã an lạc, nếu có Tỳ-kheo nào trong khi có Tỳ-kheo đang thuyết pháp mà nói như vậy: ‘Điều mà vị ấy nói, văn cú không chánh, nhưng nghĩa thì chánh.’ Tỳ-kheo nghe như vậy, không nên nói đấy là đúng, cũng không nên nói đấy là sai, mà nên nói với Tỳ kheo ấy rằng: ‘Thế nào, Tỳ-kheo? Câu của tôi như vậy. Câu của ngài như vậy. Câu nào đúng? Câu nào sai?’ Nếu Tỳ kheo ấy nói: ‘Câu của tôi như vậy. Câu của ngài như vậy. Câu của ngài hơn.’ Tỳ-kheo kia nói như vậy, nhưng cũng không nên nói đấy là đúng, cũng không nên nói thế là sai, mà nên can gián Tỳ kheo ấy, nên khuyến cáo hãy dứt bỏ, hãy cùng suy cầu. Như vậy tất cả cùng hòa hiệp, chớ sanh tranh chấp, đồng một Thầy học, như nước sữa hiệp nhất, ở trong Chánh pháp của Như Lai, hãy tự mình thắp sáng, nhanh chóng được an lạc.",
        "“Sau khi đã an lạc, nếu có Tỳ-kheo nào trong khi có Tỳ-kheo đang thuyết pháp mà nói như vậy: ‘Điều mà vị kia nói, văn cú chánh, nhưng nghĩa không chánh.’ Tỳ-kheo nghe như vậy, không nên nói đấy là đúng, cũng không nên nói đấy là sai, mà nên nói với Tỳ-kheo ấy rằng: ‘Thế nào, Tỳ-kheo? Câu của tôi như vậy. Câu của ngài như vậy. Câu nào đúng? Câu nào sai?’ Nếu Tỳ-kheo ấy nói: ‘Câu của tôi như vậy. Câu của ngài như vậy. Câu của ngài hơn.’ Tỳ kheo kia nói như vậy, nhưng cũng không nên nói đấy là đúng, cũng không nên nói thế là sai, mà nên can gián Tỳ kheo ấy, nên khuyến cáo hãy dứt bỏ, hãy cùng suy cầu. Như vậy tất cả cùng hòa hiệp, chớ sanh tranh chấp, đồng một Thầy học, cùng hòa hiệp như nước với sữa, ở trong Chánh pháp của Như Lai, hãy tự mình thắp sáng, chóng được an lạc.",
        "“Sau khi được an lạc, nếu có Tỳ-kheo trong khi có Tỳ-kheo đang thuyết pháp mà nói như vậy ‘Điều được thuyết kia, văn cú chánh, nghĩa chánh.’ Tỳ-kheo nghe như vậy, không nên nói là sai, mà hãy nên khen ngợi Tỳ-kheo ấy rằng: ‘Điều ngài nói là đúng. Điều ngài nói là đúng.’ Vì vậy, này Tỳ-kheo, trong mười hai bộ kinh hãy tự mình chứng nghiệm, rồi lưu bố rộng rãi. Một là quán kinh. Hai là k? dạ kinh. Ba là thọ ký kinh. Bốn là kệ kinh. Năm là pháp cú kinh. Sáu là tương ưng kinh. Bảy là bổn duyên kinh. Tám là thiên bổn kinh. Chín là quảng kinh. Mười là vị tằng hữu kinh. Mười một là thí dụ kinh. Mười hai là đại giáo kinh. Các ngươi hãy khéo thọ trì, hãy tùy năng lực mà suy xét, phân bố rộng rãi.",
        "“Này các Tỳ-kheo, y mà Ta quy định, hoặc y lấy từ bãi tha ma, hoặc y của trưởng giả, hoặc y xấu hèn; các thứ y ấy đủ để che nóng che lạnh, muỗi mòng; đủ để trùm kín bốn chi thể.",
        "“Này các Tỳ-kheo, ẩm thực mà Ta quy định, hoặc thực phẩm do khất thực, hoặc từ cư sỹ; các loại thực phẩm ấy đủ no. Nếu thân thể khổ não, các bệnh hoạn bức thiết mình, sợ rằng có thể vì thế mà chết, cho nên Ta cho phép các loại thực phẩm ấy, để tri túc thì thôi.",
        "“Này các Tỳ-kheo, trú xứ mà Ta quy định, hoặc dưới gốc cây, hoặc chỗ trống, hoặc trong phòng, hoặc trên lầu gác, hoặc trong hang, hoặc tại các trú xứ khác; các trú xứ ấy đủ để ngăn che nóng lạnh, che nắng, che mưa, muỗi mòng, cho đến chỗ vắng vẻ để nghỉ ngơi.",
        "“Này các Tỳ-kheo, thuốc men mà Ta quy định , hoặc đại tiểu tiện, hoặc dầu, hoặc mật; các thứ thuốc ấy tự đủ, nếu thân thể phát sanh đau nhức, các thứ bịnh hoạn bức thiết mình, sợ rằng có thể chết, cho nên Ta quy định các thứ thuốc ấy.”",
        "Phật lại nói:",
        "“Hoặc có Phạm chí ngoại đạo đến nói: ‘Sa-môn Thích tử hưởng thụ các thứ hoan lạc.’ Nếu có người nói như vậy, nên trả lời rằng: ‘Ngươi chớ nói như vậy, rằng Sa-môn Thích tử ham hưởng thụ các thứ hoan lạc.’ Vì sao?",
        "Có thứ lạc nếu hưởng thụ thì bị Như Lai chê trách. Có thứ lạc nếu hưởng thụ thì được Như Lai khen ngợi. Nếu Phạm chí ngoại đạo hỏi: ‘Thứ lạc nào mà nếu hưởng thụ thì bị Cù-đàm chê trách?’ Nếu có hỏi như vậy, nên trả lời rằng: ‘Năm phẩm tính của dục , đáng ưa đáng thích, mọi người đều đam mê. Thế nào là năm? Mắt nhận thức sắc, đáng ưa đáng thích, mọi người đều đam mê. Tai nghe tiếng, mũi ngửi hương, lưỡi nếm vị, thân biết xúc cảm, đáng ưa đáng thích, mọi người đều đam mê. Này chư hiền, do duyên là năm dục mà sanh hỷ lạc; đó là điều mà Như Lai, Chí chân, Đẳng chánh giác chê trách. Cũng như có người cố tình sát hại chúng sanh, tự cho thế là hoan lạc; đó là điều mà Như Lai, Chí chân, Đẳng chánh giác chê trách. Cũng như có người lén lút trộm cắp của người, cho thế là khoái lạc; đó là điều mà Như Lai chê trách. Cũng như có người xâm phạm tịnh hạnh của người khác, tự cho thế là khoái lạc; đó là điều mà Như Lai chê trách. Cũng như có người cố ý nói dối, tự cho thế là khoái lạc; đó là điều mà Như Lai chê trách. Cũng có người sống phóng đãng buông thả; đó là diều Như Lai chê trách. Cũng có người hành khổ hạnh bề ngoài, không phải là hành chân chánh mà Như Lai dạy, tự cho thế là khoái lạc; đó là điều Như Lai chê trách.",
        "“Này các Tỳ-kheo, năm phẩm chất của dục vốn đáng chê trách, mà mọi người tham đắm. Những gì là năm? Mắt nhận biết sắc, đáng ưa đáng thích, là cái mà con người tham đắm. Tai nghe tiếng, mũi ngửi hương, lưỡi nếm vị, thân biết xúc, đáng ưa đáng thích, mọi người tham đắm. Sa-môn Thích tử không tán đồng những thứ khoái lạc như vậy. Cũng như có người cố ý sát sanh, cho đó là khoái lạc. Sa-môn Thích tử không tán đồng khoái lạc như vậy. Cũng như có người trộm cắp, cho thế là khoái lạc. Sa-môn Thích tử không tán đồng những thứ khoái lạc như vậy. Cũng như có người phạm tịnh hạnh, cho thế là khoái lạc. Sa-môn Thích tử không đồng khoái lạc như vậy. Cũng như có người phóng đãng buông trôi, cho thế là lạc. Sa-môn Thích tử không đồng khoái lạc như vậy. Cũng như có người hành khổ hạnh bề ngoài, cho thế là khoái lạc. Sa-môn Thích tử không đồng khoái lạc như vậy.",
        "“Nếu có Phạm chí ngoại đạo hỏi như vậy: ‘Thứ lạc hưởng thụ nào mà Sa môn Thích tử khen ngợi?’ Này các Tỳ kheo, nếu người kia có nói như vậy, các ngươi nên trả lời rằng: ‘Này chư hiền, năm phẩm chất của dục, đáng ưa đáng thích, được người đời tham đắm. Những gì là năm? Mắt biết sắc... cho đến, thân biết xúc, đáng ưa đáng thích, được người đời tham đắm. Này chư hiền, do nhân duyên là năm dục mà sanh lạc, nên nhanh chóng diệt trừ. Cũng như có người cố ý sát sanh, tự cho thế là khoái lạc. Thứ lạc như thế, nên nhanh chóng diệt trừ. Có người trộm cắp, tự cho thế là khoái lạc. Thứ lạc ấy nên nhanh chóng diệt trừ. Cũng như có người phạm tịnh hạnh, tự cho thế là khoái lạc. Thứ lạc ấy nên chóng diệt trừ. Cũng như có người phóng đãng buông trôi, tự cho thế là khoái lạc. Thứ lạc ấy nên nhanh chóng diệt trừ. Cũng như có người hành khổ hạnh bề ngoài, cho thế là khoái lạc. Thứ lạc ấy nên chóng diệt trừ. Cũng như có người ly dục, lìa bỏ pháp ác bất thiện, có giác có quán, có hỷ lạc phát sanh do ly dục, nhập sơ thiền. Lạc như thế là điều Phật khen ngợi. Cũng như có người diệt giác quán, nội tâm hoan hỷ , nhất tâm, không giác không quán, có hỷ lạc do định sanh, nhập nhị thiền. Lạc như thế được Phật khen ngợi. Cũng như có người trừ hỷ, nhập xả, tự biết thân lạc, là điều mà Hiền Thánh mong cầu, có xả niệm , nhất tâm, nhập đệ tam thiền. Lạc như thế được Phật khen ngợi. Lạc hết, khổ hết, ưu và hỷ trước đã diệt, không khổ không lạc, hộ niệm thanh tịnh, nhập đệ tứ thiền. Lạc như vậy được Phật khen ngợi.",
        "“Nếu có Phạm chí ngoại đạo nói như vầy: ‘Trong lạc ấy, các ngươi tìm phẩm chất gì?’ Nên trả lời rằng: ‘Lạc ấy sẽ đưa đến phẩm chất của bảy quả , Những gì là bảy? Ngay trong đời này, chứùng đắc thánh đạo , Giả sử chưa chứng, sau khi chết, sẽ chứng đắc thánh đạo. Nếu trong khi chết mà chưa chứng đắc, thì sẽ đoạn trừ năm hạ phần kết , sẽ chứng đắc trung bát Niết bàn, sanh bát Niết-bàn, hành bát Niết-bàn, vô hành bát Niết-bàn, thượng lưu a-ca-nị-trá Niết-bàn . Này chư hiền, như vậy lạc ấy có bảy phẩm chất. Chư hiền, nếu Tỳ-kheo đang ở bậc học địa mà muốn hướng thượng, tìm cầu chỗ an ổn, nhưng chưa trừ năm triền cái. Những gì là năm? Tham dục triền cái, sân nhuế triền cái, thụy miên triền cái, trạo hý triền cái, nghi triền cái. Tỳ kheo hữu học kia muốn cầu hướng thượng, tìm chỗ an ổn, nhưng chưa diệt trừ năm triền cái, đối với bốn niệm xứ không hay tinh cần, đối với bảy giác ý không hay tinh cần, lại muốn chứng được pháp thượng nhân, trí tuệ tăng thượng của hiền thánh, mong cầu muốn biết, muốn thấy, không có trường hợp ấy.",
        "“Chư hiền, Tỳ-kheo hữu học muốn cầu hướng thượng, tìm cầu chỗ an ổn, mà có thể diệt trừ năm triền cái là tham dục triền cái, sân nhuế triền cái, thụy miên triền cái, trạo hý triền cái, nghi triền cái, đối với bốn niệm xứ lại hay tinh cần, đối với bảy giác ý như thật tu hành, vị ấy muốn được pháp thượng nhân, trí tuệ tăng thượng của Hiền Thánh, muốn biết muốn thấy, có trường hợp như vậy.",
        "“Chư hiền, có Tỳ-kheo là lậu tận Ala-hán, điều cần làm đã làm xong, đã đặt gánh nặng xuống, đã đạt được mục đích của mình, đã dứt sạch các kết sử của hữu, với chánh trí đã giải thoát; vị ấy không làm chín việc. Những gì là chín? Một là không giết. Hai là không lấy trộm. Ba là không dâm. Bốn là không nói dối. Năm, không xả đạo . Sáu, không bị dục chi phối. Bảy, không bị sân chi phối. Tám, không bị sợ hãi chi phối. Chín, không bị nghi chi phối. Chư hiền, ấy là vị lậu tận A-la-hán đã làm xong điều cần làm, đã đặt gánh nặng xuống, đã đạt được mục đích của mình, đã dứt sạch kết sử của hữu, chánh trí giải thoát, xa lìa chín sự.",
        "“Hoặc có Phạm chí ngoại đạo nói như vầy: ‘Sa-môn Thích tử có pháp bất trụ.’ Nên trả lời vị ấy rằng: ‘Chư hiền, chớ nói như vậy, rằng Sa-môn Thích tử có pháp bất trụ. Vì sao vậy? Pháp của Sa-môn Thích tử là thường trụ, không bị dao động. Cũng như ngưỡng cửa thường trụ không động. Pháp của Sa-môn Thích tử cũng vậy, thường trụ không di động.’",
        "“Hoặc có Phạm chí ngoại đạo nói như vậy: ‘Sa-môn Cù-đàm biết suốt việc trong đời quá khứ, nhưng không biết việc trong đơì vị lai.’ Tỳ-kheo kia, cùng Phạm chí dị học kia, trí tuệ khác nhau, trí quán cũng khác , nên lời nói hư dối. Như Lai đối với việc quá khứ kia, không gì không thấy biết, rõ như ở trước mắt. Đối với đời vị lai, Như Lai có trí tuệ phát sanh từ đạo . Việc trong đời quá khứ vốn hư dối không thật, không đáng vui thích, không lợi ích gì, Như Lai không ghi nhận. Hoặc việc quá khứ có thật, nhưng không đáng ưa thích, không ích lợi gì, Phật cũng không ghi nhận. Nếu việc quá khứ có thật, đáng ưa, nhưng không lợi ích, Phật cũng không ghi nhận. Nếu việc quá khứ có thật, đáng ưa, có lợi ích, Như Lai biết suốt, sau đó mới ghi nhận. Vị lai, hiện tại, cũng vậy.",
        "“Như Lai đối với quá khứ, vị lai, hiện tại, nói đúng thời, nói sự thật, nói có nghĩa, có lợi, nói đúng pháp, đúng luật, không có lời hư dối. Phật từ đêm đầu tiên thành Vô thượng chánh giác cho đến đêm cuối cùng, trong khoảng giữa, có nói điều gì, thảy đều như thật; do đó gọi là Như Lai.",
        "“Lại nữa, những điều Như Lai nói đúng như sự; sự đúng như lời; do đó gọi là Như Lai.",
        "“Do nghĩa gì mà gọi là Đẳng chánh giác? Những gì mà Phật thấy biết, diệt trừ, giác ngộ, Phật thảy đều giác ngộ, biết rõ, nên gọi là Đẳng chánh giác.",
        "“Hoặc có Phạm chí ngoại đạo nói như vậy: ‘Thế gian thường còn. Duy chỉ điều này là thật; ngoài ra đều là hư dối.’ Hoặc có người lại nói: ‘Thế gian này là vô thường. Duy chỉ điều này là thật; ngoài ra đều hư dối.’ Hoặc có người lại nói: ‘Thế gian vừa thường vừa vô thường. Duy chỉ điều này là thật; ngoài ra đều hư dối.’ Hoặc có người nói: ‘Thế gian không phải thường, không phải vô thường. Duy chỉ điều này là thật; ngoài ra là hư dối.’",
        "“Hoặc có người nói: ‘Thế gian hữu biên. Duy chỉ điều này là thật; ngoài ra đều hư dối.’ Hoặc có người nói: ‘Thế gian vô biên. Duy chỉ điều này là thật; ngoài ra đều hư dối.’ Hoặc có người nói: ‘Thế gian vừa hữu biên vừa vô biên. Duy chỉ điều này là thật; ngoài ra đều hư dối.’ Hoặc nói: ‘Thế gian không phải hữu biên không phải vô biên. Duy chỉ điều này là thật; ngoài ra đều hư dối.’",
        "“Hoặc nói: ‘Chính mạng tức là thân. Duy chỉ điều này là thật; ngoài ra đều dối.’ Hoặc nói: ‘Mạng không phải là thân. Đây là thật; ngoài ra là dối.’ Hoặc nói: ‘Mạng khác thân khác. Đây là thật; ngoài ra là dối.’ Hoặc nói: ‘Không phải mạng khác thân khác.",
        "Đây là thật; ngoài ra là dối.’",
        "“Hoặc nói: ‘Như Lai có cuối cuøng.Đây là thật, ngoài ra là dối.’ Hoặc nói: ‘Như Lai không có cuối cùng. Đây là thật còn ngoài ra là dối.’ Hoặc nói: ‘Như Lai vừa có cuối cùng vừa không có cuối cùng, đây là thật còn ngoài ra là dối.’ Hoặc nói: ‘Như Lai không phải có cuối cùng cũng không phải không có cuối cùng, đây là thật còn ngoài ra là dối.’",
        "“Những ai có quan điểm như vậy, gọi là bổn sanh bổn kiến . Nay ta ghi nhận cho ngươi rằng: ‘Thế gian là thường còn ... cho đến, Như Lai không phải có cuối cùng cũng không phải không có cuối cùng. Đây là thật còn ngoài ra là dối.’ Đó là bổn kiến bổn sanh. Hãy ghi nhớ lấy.",
        "“Gọi là: ‘Mạt kiếp mạt sanh.’Ta cũng ghi nhận. Những gì là mạt kiếp mạt sanh được ta ghi nhận? Sắc là ta, tùy theo tưởng mà có cuối cùng; đây là thật còn ngoài ra là dối. Vô sắc là ta, tùy theo tưởng có cuối cùng. Vừa có sắc vừa vô sắc là ta, tùy theo tưởng mà có cuối cùng. Không phải có sắc không phải không sắc là ta, tùy theo tưởng mà có cuối cùng. Ta là hữu biên, ta là vô biên, ta vừa hữu biên vừa vô biên, ta không phải hữu biên cũng không phải vô biên, tùy theo tưởng mà có cuối cùng. Ta có lạc, tùy theo tưởng mà có cuối cùng. Ta không có lạc, tùy theo tưởng mà có cuối cùng. Ta vừa có khổ vừa có lạc, tùy theo tưởng mà có cuối cùng. Ta không khổ cũng không lạc, tùy theo tưởng mà có cuối cùng. Một tưởng là ta, tùy theo tưởng mà có cuối cùng. Nhiều tưởng là ta, tùy theo tưởng mà có cuối cùng. Ít tưởng là ta, tùy theo tưởng mà có cuối cùng. Vô lượng tưởng là ta, tùy theo tưởng mà có cuối cùng. Đây là thật ngoài ra là dối. Đó là tà kiến bổn kiến bổn sanh, được Ta ghi nhận.",
        "“Hoặc có Sa-môn, Bà-la-môn, có luận như vầy, có kiến như vầy: ‘thế gian này thường còn, đây là thật, ngoài ra là dối ... cho đến, vô lượng tưởng là ta, đây là thật, ngoài ra là dối.’ Sa-môn, Bà-la-môn kia, lại nói như vầy, thấy như vầy: ‘Đây là thật ngoài ra là hư dối’. Nên trả lời người ấy rằng: ‘Có phải ngươi chủ trương rằng, thế giới này là thường còn; đây là thật còn ngoài ra là dối? Lời nói như vậy Phật không chấp nhận. Vì sao? Trong các kiến giải đó mỗi thứ đều có kết sử. Ta lấy lý mà suy, trong các Sa-môn, Bà-la-môn, không ai bằng Ta, huống hồ muốn hơn Ta’. Các tà kiến như vậy chỉ có nơi lời nói mà thôi, không đáng cùng bàn luận... Cho đến vô lượng tưởng là ta, cũng vậy.",
        "“Hoặc có Sa-môn, Bà-la-môn nói như vầy: ‘Thế gian này tự tạo.’ Lại có Sa-môn, Bà-la-môn nói: ‘Thế gian này cái khác tạo.’ Hoặc nói: ‘Vừa tự tạo vừa cái khác tạo.’Hoặc nói: ‘không phải tự tạo cũng không phải cái khác tạo nhưng ngẫu nhiên mà có.’ Sa-môn, Bà-la-môn nào nói rằng thế gian là tự tạo thì các Sa-môn, Bà-la-môn ấy đều nhân bởi nhân duyên là xúc. Nếu lìa xúc là nhân mà có thể nói được; không có trường hợp ấy. Vì sao? Do sáu nhập thân mà phát sanh xúc. Do xúc mà sanh thọ. Do thọ mà sanh ái. Do ái mà sanh thủ. Do thủ mà sanh hữu. Do hữu mà sanh sanh. Do sanh mà có già, chết, ưu, buồn, khổ não, khối lớn khổ đau. Nếu không có sáu nhập, thì không có xúc. Không có xúc thì không có thọ. Không có thọ thì không có ái. Không có ái thì không có thủ. Không có thủ thì không có hữu. Không có hữu thì không có sanh. Không có sanh thì không có già, chết, ưu, buồn, khổ não, khối lớn khổ đau.",
        "“Lại nói, ‘thế gian này do cái khác tạo’; lại nói, ‘thế gian này vừa tự tạo vừa do cái khác tạo’; lại nói, ‘thế gian này không phải tự tạo cũng không phải do cái khác tạo, nhưng ngẫu nhiên mà có’; cũng vậy. Nhân xúc mà có, không có xúc thì không.”",
        "Phật bảo các Tỳ-kheo:",
        "“Nếu muốn diệt trừ các quan điểm tà ác ấy, nên tu ba hành đối với bốn niệm xứ. Thế nào Tỳ-kheo diệt trừ các tà ác, nên tu ba hành với bốn niệm xứ? Tỳ-kheo quán thân trên nội thân, tinh cần không biếng nhác, ghi nhớ không quên, trừ tham ưu ở đời. Quán thọ, ý, pháp, cũng vậy. Đó là muốn diệt trừ ba hành đối với bốn niệm xứ.",
        "“Có tám giải thoát . Những gì là tám? Có sắc, quán sắc, đó là giải thoát thứ nhất. Bên trong có sắc tưởng, quán ngoại sắc; giải thoát thứ hai. Tịnh giải thoát , giải thoát thứ ba. Vượt sắc tưởng, diệt hữu đối tưởng, trú không xứ, giải thoát thứ tư. Xả không xứ trú thức xứ; giải thoát thứ năm. Xả thức xứ, trú bất dụng xứ , giải thoát thứ sáu. Xả bất dụng xứ, trú hữu tưởng vô tưởng xứ; giải thoát thứ bảy. Diệt tận định, giải thoát thứ tám.”",
        "Bấy giờ, A-nan đứng sau Thế Tôn, cầm quạt quạt Phật, bèn trịch áo bày vai phải, quỳ gối phải xuống đất, chấp tay bạch Phật rằng:",
        "“Kỳ diệu thay, Thế Tôn. Pháp này thanh tịnh, vi diệu bậc nhất, nên gọi là gì? Nên phụng trì như thế nào?” Phật bảo A-nan:",
        "“Kinh này gọi là “Thanh tịnh”. Ngươi hãy phụng trì như thế.”",
        "Bấy giờ, A-nan sau khi nghe những lời Phật dạy, hoan hỷ phụng hành."
    ]
}