{
    "metadata": {
        "STT": "1",
        "Tên Tạng": "A Hàm",
        "Bộ": "Trường A Hàm",
        "Tập Số (Đại Chánh)": "1",
        "Số Hiệu (Đại Chánh)": "T1",
        "Việt Dịch (Số tập)": "1",
        "Tên Kinh Đầy Đủ": "Trường A Hàm",
        "Tên Tiếng Hán": "長阿含經",
        "Tên Kinh rút gọn": "TrgAH",
        "Hán Dịch": "Pháp Hiển (法顯) dịch, đời Lưu Tống",
        "Việt Dịch": "HT. Tuệ Sỹ",
        "Khảo Dịch - Hiệu đính": "HT. Tuệ Sỹ",
        "Năm xuất bản": "PL.2549 - 2005 sửa chữa và bổ sung",
        "Số Quyển": "22",
        "Tên Kinh Nhỏ": "03. KINH ĐIỂN TÔN",
        "Số Phẩm": "PHẦN 1",
        "Chia Đoạn": "Theo kinh nhỏ",
        "Chủ đề chính": "Kinh điển Nikāya, giáo lý căn bản",
        "Từ khóa liên quan": "Trường bộ, Nikāya, Đại Chánh Tân Tu, A Hàm",
        "ONIX tương ứng (gợi ý)": "Not_Available",
        "Ghi chú": "Theo Đại Chánh Tân Tu T1, CBETA. Bản dịch: HT. Tuệ Sỹ"
    },
    "noi_dung": [
        "Tôi nghe như vầy.",
        "Một thời, Phật ở núi Kỳ-xà-quật thành La-duyệt-kỳ cùng chúng đại Tỳ kheo một nghìn hai trăm năm mươi người. Bấy giờ có nhạc thần là Ban giá-dực , trong lúc đêm thanh vắng không người, phóng ánh sáng rọi sáng núi Kỳ-xà-quật, đi đến chỗ Phật, đầu mặt đảnh lễ chân Phật rồi đứng sang một bên, bạch đức Thế Tôn rằng:",
        "“Đêm qua Phạm thiên vương đến cõi trời Đao-lợi bàn nghị với Đế Thích. Con ở đó chính mình được nghe; nay có thể thuật lại đức Thế Tôn nghe chăng?”",
        "Phật đáp:",
        "“Ngươi muốn nói thì nói.” Ban-giá-dực nói:",
        "“Một thời, chư thiên Đao-lợi nhóm ở Pháp đường để luận nghị. Lúc đó bốn Thiên vương ngồi bốn phía theo phương hướng mình. Đề-đế-lại-tra Thiên vương ngồi ở phía Đông, mặt day về hướng Tây. Đế Thích ngồi trước mặt. Tỳ-lâu-lặc Thiên vương ngồi ở phía Nam, mặt day về hướng Bắc; Đế Thích ngồi trước mặt. Tỳ-lâubác-xoa Thiên vương ngồi ở phía Tây, mặt day về hướng Đông; Đế Thích ngồi trước mặt. Tỳ-sa-môn Thiên vương ngồi phía Bắc, mặt day về hướng Nam; Đế Thích ngồi trước mặt. Sau khi các Thiên vương ngồi xong, con mới ngồi. Lại còn có các đại thiên thần khác nữa, toàn là những người đã từng theo Phật tu hành phạm hạnh, khi mệnh chung ở đây, được sanh lên cõi trời Đao-lợi, khiến cho chư thiên ở đó thêm được năm thứ phước: tuổi thọ cõi trời, sắc đẹp cõi trời, danh xưng cõi trời, âm nhạc cõi trời, và oai đức trời. Bấy giờ chư thiên Đao-lợi vui mừng phấn khởi nói rằng:",
        "“Mong chúng chư thiên tăng gia, chúng A-tu-la giảm thiểu.”",
        "“Lúc ấy, Thích Đề-hoàn Nhân biết chư thiên có điều vui mừng, bèn vì chư thiên Đao-lợi mà làm bài tụng rằng:",
        "Chúng chư thiên Đao-lợi,",
        "Cùng Đế Thích hoan lạc,",
        "Cung kính lễ Như Lai,",
        "Đấng Pháp vương tối thượng.",
        "Chư thiên thọ phước báo,",
        "Thọ, sắc, danh, nhạc, uy.",
        "Theo Phật tu phạm hạnh,",
        "Nên sanh vào nơi đây.",
        "Lại có các thiên nhân,",
        "Ánh màu sáng chói lọi.",
        "Đệ tử trí tuệ Phật,",
        "Sanh đây càng trỗi vượt.",
        "Đao-lợi và Nhân-đề,",
        "Nghĩ thế mà sung sướng.",
        "Cung kính lễ Như Lai,",
        "Đấng Pháp vương tối thượng.",
        "Chư thiên Đao-lợi sau khi nghe bài kệ ấy, lại càng vui mừng không thể tự chế:",
        "“Mong chúng chư thiên gia tăng, chúng A-tu-la giảm thiểu.”",
        "Thích Đề-hoàn Nhân thấy Chư thiên Đao-lợi vui mừng hớn hở, bèn bảo họ rằng:",
        "“Chư hiền có muốn nghe tám pháp vô đẳng về Như Lai không?” Chư thiên đáp:  “Chúng tôi muốn nghe.” Đế Thích nói:",
        "“Hãy lắng nghe, hãy khéo suy nghĩ. Này chư hiền, Đức Như Lai, Chí chân, Đẳng chánh giác, đầy đủ mười hiệu. Ta không thấy có ai trong quá khứ, vị lai, hiện tại có đủ mười đức hiệu, Như Lai, Chí chân, Đẳng chánh giác, như Phật.",
        "“Pháp Phật vi diệu, được khéo giảng thuyết, được người trí thật hành. Ta không thấy có ai trong quá khứ, vị lai, hiện tại có giáo pháp vi diệu như Phật.",
        "“Phật do pháp ấy mà tự giác ngộ, thông đạt vô ngại, trú trong an lạc . Ta không thấy có ai trong quá khứ, vị lai, hiện tại có thể ở nơi pháp ấy mà tự giác ngộ, thông đạt vô ngại, tự tại an vui như Phật.",
        "“Chư hiền! Phật do pháp ấy mà tự giác ngộ rồi còn có thể khai thị con đường dẫn đến Niết-bàn, thân cận , dần dần đến chỗ nhập vào nơi tịch diệt. Ví như nước sông Hằng , và nước sông Diệm-ma , cả hai dòng sông đều chảy vào biển cả. Phật cũng vậy. Có thể khai thị con đường dẫn đến Niết-bàn, thân cận, dần dần đến chỗ nhập vào nơi tịch diệt. Ta không thấy có ai trong quá khứ, vị lai, hiện tại có thể khai thị con đường dẫn đến Niết-bàn được như Phật.",
        "“Chư hiền! Như Lai thành tựu quyến thuộc, gồm những người có trí tuệ, Sát lỵ, Bà-la-môn, cư sĩ, Sa-môn. Ta không thấy có ai trong quá khứ, vị lai, hiện tại có được quyến thuộc như Phật.",
        "“Chư hiền! Như Lai thành tựu đại chúng. Đó là Tỳ-kheo, Tỳ-kheo ni, ưu bà tắc, ưu bà di. Ta không thấy ai trong quá khứ, vị lai, hiện tại thành tựu đại chúng như Phật.",
        "“Chư hiền! Ngôn và hành của Như Lai tương ưng. Nói đúng như làm, làm đúng như nói, thành tựu pháp và tùy pháp. Ta không thấy có ai trong quá khứ, vị lai, hiện tại mà ngôn hành tương ưng, pháp pháp thành tựu như Phật.",
        "“Chư hiền! Như Lai vì lợi ích mọi người, vì an lạc mọi người; với lòng từ mẫn, Ngài làm lợi ích cho chư thiên và nhân loại. Ta không thấy có ai trong quá khứ, vị lai, hiện tại vì lợi ích mọi người, vì an lạc mọi người như Phật.",
        "“Chư hiền, đó là tám pháp vô đẳng về Như Lai.”",
        "Khi ấy có vị Đao-lợi nói:",
        "“Giả sử thế gian được tám đức Phật ra đời một lượt, thời sẽ làm tăng nhiều Chư thiên mà giảm bớt chúng A-tu-la.” Vị trời khác nói:",
        "“Đừng nói chi tám đức Phật, dẫu cho có bảy Phật, sáu Phật đến hai đức Phật ra đời, cũng làm cho thêm nhiều chúng chư Thiên mà giảm bớt chúng A-tu-la.” Thích Đề-hoàn Nhân liền nói với trời Đao-lợi:",
        "“Ta được nghe từ Phật, trực tiếp lãnh giáo từ Phật, thì không bao giờ có thể có hai đức Phật ra đời một lần. Nhưng nếu một đức Như Lai mà Ngài ở đời lâu dài, vì thương mọi người, vì ích lợi cho nhiều người, vì an lạc cho chư thiên và nhân loại, thời cũng có thể tăng nhiều chúng chư thiên mà giảm bớt chúng A-tu-la vậy.”",
        "Rồi Ban-giá-dực bạch Phật:",
        "“Bạch Thế Tôn, chư thiên Đao-lợi sở dĩ tập họp tại Pháp giảng đường, ấy là để bàn luận, tư duy, thương lượng, xem xét giáo lệnh được ban ra. Rồi trao cho Tứ thiên vương. Tứ thiên vương sau khi thọ lãnh, mỗi vị ngồi đúng theo chỗ của mình. Không bao lâu, có ánh sáng lớn kỳ lạ chiếu sáng bốn phương. Chư thiên Đao-lợi nhìn thấy ánh sáng ấy thảy đều kinh sợ: ‘Nay ánh sáng lạ này, sắp có điều gì quái lạ chăng?’ Các đại thiên thần có oai đức cũng đều kinh sợ: ‘Nay ánh sáng lạ này, sắp báo điều gì quái lạ chăng?’",
        "“Khi ấy, Đại Phạm vương tức thì hóa làm Đồng tử đầu có năm chõm , đứng giữa hư không, bên trên đại chúng, gương mặt xinh đẹp vượt hẳn đám đông, thân màu vàng tía, che mờ ánh sáng chư thiên. Chư thiên Đao-lợi không đứng dậy nghinh đón, cũng không cung kính, không mời ngồi. Khi Phạm Đồng tử ngồi vào chỗ ngồi của vị trời nào thì vị ấy rất hoan hỷ. Ví như vua Quán đảnh thuộc dòng Sát-lỵ, khi làm lễ đăng quang, khi ấy vua rất hoan hỷ phấn khởi.",
        "“Ngồi chưa lâu, Đại Phạm lại tự biến thành hình tượng đoàng tử đầu có năm chõm, ngồi giữa hư không, bên trên đại chúng, như một lực sĩ ngồi trên chỗ ngồi vững chắc, vòi vọi bất động, và làm bài tụng:",
        "Chúng chư thiên Đao-lợi,",
        "Cùng Đế Thích hoan lạc,",
        "Cung kính lễ Như Lai,",
        "Đấng Pháp vương tối thượng.",
        "Chư thiên thọ phước báo:",
        "Thọ, sắc, danh, nhạc, uy.",
        "Theo Phật tu phạm hạnh,",
        "Nên sanh vào nơi đây.",
        "Lại có các thiên nhân,",
        "Ánh màu sáng chói lọi.",
        "Đệ tử trí tuệ Phật,",
        "Sanh đây càng trỗi vượt.",
        "Đao-lợi và Nhân-đề,",
        "Nghĩ thế mà sung sướng.",
        "Cung kính lễ Như Lai,",
        "Đấng Pháp vương tối thượng.",
        "“Rồi thì, chư thiên Đao-lợi nói với",
        "Đồng tử: ‘Chúng tôi đã nghe Thiên đế Thích tán thán tám pháp vô đẳng về Như Lai, thảy đều hoan hỷ phấn khởi không thể tự chế.’ Phạm Đồng tử bèn nói với chư thiên:’Tám pháp vô đẳng về Như Lai là những gì? Ta cũng muốn nghe.’ Thiên Đế Thích bèn nói cho Đồng tử nghe tám pháp vô đẳng về Như Lai. Chư thiên Đao-lợi nghe lần nữa, bội phần hoan hỷ phấn khởi không kể xiết:’Mong chúng chư Thiên tăng thịnh, chúng A-tu-la giảm thiểu.’",
        "“Khi ấy Đồng tử thấy chư Thiên hoan hỷ lại càng phấn khởi, bèn nói với chư Thiên Đao-lợi rằng: ‘Các ngươi muốn nghe một pháp vô đẳng không?’ Đao-lợi thiên đáp: ‘Hay lắm, chúng tôi muốn nghe.’ Đồng tử nói: ‘Hãy lắng",
        "nghe, ta sẽ nói cho’.”",
        "‘Này chư thiên Đao-lợi! Đức Như Lai xưa kia, lúc Ngài còn làm Bồ tát, sanh bất cứ chỗ nào thảy đều thông minh túc trí.",
        "‘Này chư hiền, vào thời quá khứ xa xưa, có vị vua tên Địa Chủ , vua có một Thái tử tên Từ Bi. Đại thần của vua tên Điển Tôn và con đại thần tên Diệm Man. Thái tử Từ Bi có bạn, và bạn này thường kết giao với sáu vị đại thần dòng Sát-lỵ khác",
        "‘Đại vương Địa chủ mỗi khi muốn vào thâm cung du hý, đem quốc sự ủy thác lại đại thần Điển Tôn. Rồi sau đó mới vào cung hát xướng, hoan lạc với ngũ dục.",
        "‘Đại thần Điển Tôn khi muốn xử lý quốc sự thì trước đem việc đó hỏi con, sau mới quyết định. Hoặc có phân xử điều gì cũng nghe theo ý con. Sau bỗng nhiên đại thần Điển Tôn mệnh chung. Vua Địa Chủ nghe tin, buồn thương thảm thiết, đấm ngực mà than rằng: ‘Quái thay! Sao vô phúc! Quốc gia mất người lương bật.’ Thái tử Từ Bi thầm nghĩ: ‘Vua vì mất Điển Tôn mà sinh ưu khổ. Ta hãy đến can vua, chớ nên vì cái tang ấy mà buồn khổ. Vì sao? Vì đại thần Điển Tôn hiện có con tên là Diệm Man còn thông minh túc trí hơn cha. Nay vua có thể triệu vào để giao xử lý quốc sự’.",
        "‘Rồi Thái tử Từ Bi liền đến vua tâu bày ý kiến. Vua nghe lời, cho triệu Diệm Man đến bảo rằng: ‘Nay ta bổ sung ngươi vào chức vị của cha ngươi, trao cho ngươi ấn tướng.’ Diệm Man lãnh ấn tướng xong, khi vua muốn vào thâm cung thì đem quốc sự giao cho Diệm Man.",
        "‘Diệm Man vốn đã biết rõ việc trị lý. Chẳng những những điều trước kia cha làm Diệm Man biết rõ, mà điều trước kia cha không thể làm Diệm Man cũng biết rõ. Về sau danh Diệm Man truyền khắp quốc nội, nên thiên hạ đều tôn xưng là Đại Điển Tôn.",
        "‘Đại Điển Tôn nghĩ: ‘Nay vua Địa Chủ, tuổi đã già yếu, sống chẳng bao lâu. Nếu bây giờ Thái tử nối ngôi cũng chưa khó lắm. Có lẽ ta nên đến nói với sáu đại thần Sát-lỵ: ‘Nay vua Địa Chủ, tuổi đã già yếu, sống chẳng bao lâu. Nếu bây giờ Thái tử nối ngôi cũng chưa khó lắm. Nhưng các ông cũng nên phong riêng vương thổ. Cái ngày ở ngôi cũng đừng quên nhau vậy.’",
        "‘Thế rồi Đại Điển Tôn đi đến sáu đại thần Sát-lỵ kia, nói rằng: ‘Này các ông nên biết, nay vua Địa Chủ tuổi đã già yếu, chẳng còn sống bao lâu, nếu tôn Thái tử lên ngôi cũng không khó lắm. Các ông nên đến tỏ ý này với Thái tử rằng: ‘Chúng tôi với ngài, biết nhau từ nhỏ. Ngài khổ chúng tôi khổ, ngài vui chúng tôi vui, nay vua đã già yếu, chẳng còn sống bao lâu, vậy Thái tử muốn lên nối ngôi vua không khó. Giả sử ngài lên ngôi, xin ngài hãy phong đất cho chúng tôi.’",
        "‘Rồi sáu đại thần sát lị liền đến tỏ với Thái tử. Thái tử trả lời: ‘Giả sử ta lên ngôi, chia đất phong quốc, ta còn phong cho ai khác hơn?’ Không bao lâu, bỗng vua thăng hà. Đại thần trong nước đến bái yết Thái tử, tôn lên kế vị. Lên ngôi xong, tân vương thầm nghĩ: ‘Nay lập chức Tể tướng nên chuẩn theo Tiên vương. Nhưng người nào xứng đáng để cử chức đó? Hẳn phải là Đại Điển Tôn mới được.’ Vua Từ Bi liền triệu Đại Điển Tôn đến bảo: ‘Nay ta cử ngươi lên chức vị Tể tướng và trao ấn tín cho. Ngươi hãy chuyên cần tổng lý quốc sự.’ Đại Điển Tôn vâng lệnh, lãnh ấn.",
        "‘Mỗi khi vua lui vào cung, thì bao nhiêu quốc sự đều phó thác cả cho Đại Điển Tôn. Đại Điển Tôn thầm nghĩ: ‘Ta nay nên đến sáu vị Sát-lỵ để hỏi thử xem họ có nhớ lời trước kia không.’ Bèn đi đến nói với sáu đại thần Sát-lỵ: ‘Các ngài có nhớ lời đã nói khi trước không? Nay Thái tử đã lên ngôi vua, ở kín trong thâm cung, vui thú ngũ dục. Các ngài nay nên đến tâu hỏi vua: ‘Vua ở ngôi trời, vui thú ngũ dục, vậy còn có nhớ lời nói trước kia chăng?’’",
        "‘Sáu vị Sát-lỵ nghe lời ấy xong liền đến chỗ vua, tâu: ‘Vua ở ngôi trời, vui thú ngũ dục, vậy còn có nhớ lời nói trước kia chăng? Rằng: Cắt đất phong ấp, ai xứng đáng ở đó?.’ Vua đáp: ‘Không quên! Xưa ta có nói, chia đất phong ấp, phi các khanh còn ai được.’ ‘Tiếp đó vua thầm nghĩ: ‘Cõi đất Diêm-phù-đề này trong rộng ngoài hẹp . Người nào có khả năng phân nó làm bảy phần?.’ Rồi lại nghĩ: ‘Hẳn phải là Đại Điển Tôn mới làm được việc này.’ Vua liền triệu Đại Điển Tôn đến nói rằng: ‘Ngươi hãy chia cõi đất Diêm-phù-đề này ra làm bảy phần.’ Khi được lệnh, Đại Điển Tôn liền phân bảy phần. Thành, thôn ấp, quận quốc do vua cai trị thảy làm một phần. Sáu nước Sát-lỵ đại thần là được chia cho mỗi bộ phận. Vua lấy làm hài lòng nói: ‘Nguyện vọng của ta đã thỏa. Sáu đại thần Sát-lỵ cũng sung sướng cho nguyện vọng mình đã thỏa. Công việc này thành được là nhờ Đại Điển Tôn vậy.’",
        "‘Sáu vua dòng Sát-lỵ lại tự nghĩ: ‘Nước ta mới lập, phải cần có vị phụ tướng. Nhưng biết ai có thể đảm đương được? Nếu có ai như Đại Điển Tôn, ta sẽ khiến kiêm thông lãnh quốc sự.’",
        "‘Sáu vua Sát-lỵ đều mời Đại Điển Tôn đến bảo: ‘Nước ta cần phụ tướng. Khanh hãy vì ta kiêm thông, lãnh quốc sự.’ Cả sáu nước đều trao tướng ấn cho. Đại Điển Tôn nhận tướng ấn xong, sáu vua lui vào hậu cung hưởng thụ dục lạc. Đại Điển Tôn được giao luôn quốc sự, và xử lý luôn công việc cả bảy nước; thảy đều thành tựu cả.’",
        "‘Đồng thời trong nước có bảy đại cư sĩ, Đại Điển Tôn cũng xử lý luôn việc nhà giúp họ. Ông lại có thể dạy bảo cho bảy người Phạm chí đọc tụng kinh điển.’",
        "‘Bảy quốc vương kính xem ông như thần minh. Bảy đại cư sĩ kính xem ông như Đại vương. Còn bảy Phạm chí kính xem ông như Phạm thiên. Họ đều thầm nghĩ rằng: ‘Tể tướng Đại Điển Tôn thường gặp gỡ Phạm thiên, chuyện trò đi đứng thân thiện với Phạm thiên.’ Đại Điển Tôn thầm biết ý tưởng bảy vua, cư sĩ, và Phạm chí, rằng: ‘Ta thường gặp gỡ Phạm thiên, chuyện trò đi đứng thân thiện với Phạm thiên. Nhưng ta thật chưa từng thấy Phạm thiên, chưa từng nói chuyện với Phạm thiên. Ta không thể làm thinh để vọng nhận tiếng khen đó. Ta cũng từng nghe các vị kỳ túc nói: Ai trong bốn tháng mùa hạ ở nơi nhàn tĩnh tu tập bốn vô lượng tâm thời trời Phạm thiên sẽ xuống gặp. Nay ta nên tu bốn vô lượng tâm để được Phạm thiên xuống gặp chăng?’",
        "‘Rồi thì, Đại Điển Tôn tìm đến bảy quốc vương nói rằng: ‘Tâu Đại vương, mong Đại vương hãy trông nom quốc sự. Tôi muốn vào bốn tháng mùa hạ tu bốn vô lượng tâm.’ Bảy vua nói:",
        "‘Khanh tự biết thời.’",
        "‘Đại Điển Tôn lại đến nói với bảy cư sĩ: ‘Các ông hãy tự lo công việc của mình. Ta muốn vào bốn tháng mùa hạ, tu bốn vô lượng tâm.’ Các cư sĩ đáp: ‘Vâng. Ngài tự biết thời.’",
        "‘Lại nói với bảy trăm Phạm chí: ‘Các khanh hãy siêng năng đọc tụng và chỉ bảo lẫn nhau. Ta muốn vào bốn tháng mùa hạ, tu bốn vô lượng tâm.’ Các Phạm chí đáp: ‘Vâng. Đại sư tự biết thời.’",
        "‘Rồi Đại Điển Tôn ở phía Đông thành ấy dựng một am thất, vào bốn tháng mùa hạ, nghỉ ở đó mà tu bốn vô lượng tâm. Nhưng Phạm thiên vẫn không hiện xuống. Đại Điển Tôn thầm nghĩ:’Ta nghe các bậc túc cựu nói, tu bốn vô lượng tâm trong bốn tháng hạ thì sẽ có Phạm thiên hiện xuống, nhưng nay sao lặng lẽ không thấy dấu tích gì.’",
        "‘Đến ngày rằm trăng tròn, Đại Điển Tôn ra khỏi tịnh thất, đến chỗ đất trống, ngồi, chưa bao lâu bỗng có ánh sáng lạ hiện tới. Đại Điển Tôn tự nghĩ: Nay ánh sáng lạ đó là điềm Phạm thiên hiện xuống chăng?",
        "‘Ngay khi ấy Phạm thiên hóa làm một Đồng tử đầu có năm chỏm, ngồi giữa không, bên trên chỗ Đại Điển Tôn. Đại Điển Tôn sau khi thấy bèn nói bài tụng rằng:",
        "Đây là thiên tượng gì,",
        "Ở ngay giữa hư không,",
        "Sáng chói cả bốn phương,",
        "Như đống củi cháy hực?",
        "Phạm Đồng tử đáp lại bằng bài kệ:",
        "Duy chư thiên cõi Phạm",
        "Biết ta Phạm đồng tử.",
        "Những người khác bảo ta",
        "Thờ tự bởi thần Lửa.",
        "Đại Điển Tôn đáp bằng bài kệ:",
        "Nay tôi sẽ thưa hỏi;",
        "Vâng dạy, rất thành kính.",
        "Dọn các thứ thượng vị,",
        "Nguyện Trời biết lòng tôi.",
        "Phạm Đồng tử lại nói kệ:",
        "Nay dọn cúng dường này,",
        "Điển Tôn, ngươi tu gì?",
        "Muốn gì, chí cầu gì?",
        "Ta sẽ trao cho ngươi.",
        "‘Lại bảo Điển Tôn:",
        "‘Ngươi muốn hỏi gì tùy ý hỏi. Ta sẽ nói cho.’",
        "‘Đại Điển Tôn thầm nghĩ: Ta nên hỏi việc hiện tại chăng? hay việc vị lai? Rồi lại tự nghĩ: Việc hiện tại đời này cần gì nữa hỏi. Ta hãy hỏi việc u minh chưa tỏ. Liền hướng đến Phạm Đồng tử nói bài kệ:",
        "Tôi xin hỏi Phạm đồng,",
        "Nhờ giải quyết mối nghi;",
        "Học và trụ pháp gì,",
        "Được sanh lên Phạm thiên ?",
        "‘Phạm Đồng tử đáp:",
        "Dứt ý tưởng ta, người;",
        "Độc cư, tu từ tâm;",
        "Trừ dục, không xú uế,",
        "Được sanh lên Phạm thiên.",
        "‘Đại Điển tôn nghe xong bài kệ, liền suy nghĩ: ‘Phạm Đồng tử thuyết kệ là nên trừ xú uế. Ta không hiểu điều này. Vậy cần hỏi thêm nữa’. Bèn nói kệ:",
        "Phạm kệ nói xú uế,",
        "Xin giải rõ tôi hay,",
        "Ai mở cửa thế gian,",
        "Đọa ác, không sanh thiên?",
        "‘Phạm Đồng tử đáp bằng bài kệ:",
        "Dối trá và tật đố,",
        "Ngã mạn, tăng thượng mạn",
        "Tham dục, sân nhuế, si",
        "Mặc tình chứa đầy tâm,",
        "Là thế gian xú uế;  Ta nói cho ngươi rõ.",
        "Nó mở cửa thế gian;  Đọa ác, không sanh thiên.",
        "‘Nghe xong, Đại Điển Tôn thầm nghĩ: ‘Theo lời của Đồng tử, bây giờ ta đã hiểu nghĩa chữ xú uế. Nhưng tại gia thì không thể dứt trừ được. Tốt hơn ta có nên bỏ đời, xuất gia, cạo bỏ râu tóc, bận pháp phục, tu đạo chăng?’ Khi ấy Phạm Đồng tử biết được ý nghĩ của ông, bèn nói bài kệ:",
        "Nếu ngươi hay dũng mãnh,",
        "Chí đó thật tuyệt vời;",
        "Là hành vi bậc trí;",
        "Chết tất sanh Phạm thiên.",
        "‘Thế rồi Phạm đồng tử bỗng nhiên biến mất.",
        "‘Bấy giờ, Đại Điển Tôn trở về, đi đến bảy vua, tâu rằng: ‘Tâu Đại vương, mong ngài đem sức thần mà xử lý quốc sự. Nay tôi có ý xuất gia, bỏ đời, bận pháp phục tu đạo. Vì sao vậy? Tôi thân nghe từ Phạm thiên nói đến sự xú uế mà lòng rất ghét. Nếu tại gia thì không sao loại trừ được nó.’ Bảy quốc vương thầm nghĩ: ‘Bọn Bà-la-môn thường hay tham tài bảo, có lẽ ta nên mở rộng kho tàng cho ông ta cần dùng gì tùy ý, để đừng xuất gia.’ Rồi vời Đại Điển Tôn đến bảo: ‘Ngươi muốn cần dùng gì ta đều cấp cả, không cần xuất gia.’ Đại Điển Tôn tâu đáp: ‘Tôi đã được vua ân tứ rồi. Tôi cũng có nhiều tài bảo. Nay xin để lại hết dâng đại vương. Xin cho tôi được thỏa chí nguyện xuất gia thôi.’ ‘Bảy quốc vương lại thầm nghĩ: ‘Những người Bà-la-môn thường ham mỹ sắc, có lẽ ta đem thể nữ trong cung cấp cho vừa ý, để khỏi xuất gia.’ Rồi nói với Đại Điển Tôn: ‘Nếu cần thể nữ ta cấp hết cho ngươi. Không cần xuất gia nữa.’ Đại Điển Tôn đáp: ‘Nay tôi đã được vua ân tứ rồi. Nhưng trong nhà tôi thể nữ có nhiều nay cho về hết. Tôi chỉ mong lìa ân ái để xuất gia hành đạo vì tôi thân nghe Phạm Đồng tử nói điều xú uế mà lòng nhàm ghét. Nếu tại gia thì không sao trừ được.’",
        "‘Rồi Đại Điển Tôn nói bài kệ cho vua Từ Bi nghe:",
        "Vua hãy nghe tôi nói Vua là bậc nhân tôn,  Cho tài bảo, thể nữ.",
        "Thứ ấy phi sở thích.",
        "‘Vua Từ Bi đáp bằng bài kệ:",
        "Thành Đàn-đặc, Già-lăng.",
        "Thành A-bá, Bố-hòa.",
        "Thành A-bàn, Đại-thiên.",
        "Thành Ương-già, Chiêm-bà.",
        "Số-di, Tát-la thành",
        "Tây-đà, Lộ-lâu thành",
        "Thành Bà-la, Già-thi.",
        "Thảy do Điển Tôn dựng.",
        "Có bao nhiêu ngũ dục,",
        "Ta sẽ cùng cho ngươi.",
        "Hãy cùng trông việc nước.",
        "Không nên bỏ xuất gia.",
        "‘Điển Tôn trả lời bằng bài kệ:",
        "Ngũ dục, tôi không thiếu.",
        "Chỉ không ham thế gian.",
        "Sau khi nghe trời nói,",
        "Không còn muốn tại gia.",
        "‘VuaTừ Bi đáp lại bằng bài kệ:",
        "Lời Đại Điển Tôn nói,",
        "Được nghe từ Trời nào,",
        "Mà dứt bỏ ngũ dục?",
        "Nay hỏi; mong trả lời.",
        "‘Đại Điển Tôn nói kệ:",
        "Xưa tôi ở chỗ vắng,",
        "Một mình, tự suy tư.",
        "Rồi Phạm thiên vương đến,",
        "Tỏa hào quang rực sáng.",
        "Tôi nghe được từ Ngài;",
        "Không còn ham thế gian.",
        "‘Vua Từ Bi nói kệ:",
        "Hãy chờ, Đại Điển Tôn!",
        "Để cùng hoằng thiện pháp;",
        "Rồi sau cùng xuất gia.",
        "Khanh là thầy của ta.",
        "Ví như trong hư không,",
        "Thanh tịnh, đầy lưu ly;",
        "Nay ta tín thanh tịnh,",
        "Đầy khắp trong Phật pháp.",
        "‘Rồi Đại Điển Tôn lại làm bài tụng:",
        "Chư thiên và người đời,",
        "Đều nên xả ngũ dục;",
        "Chùi sạch các ô uế,",
        "Mà tịnh tu phạm hạnh.",
        "‘Bấy giờ bảy vị quốc vương nói với Đại Điển Tôn:",
        "‘Ngươi nên hoãn lại bảy năm để cùng nhau vui thú ngũ dục. Sau đó chúng ta cùng bỏ nước, giao lại cho con em, cùng xuất gia. Há không hay hơn sao? Những gì ngươi sở đắc, chúng ta cũng đồng.’",
        "‘Đại Điển Tôn đáp: “Thế gian vô thường, mạng người mau chóng, chỉ trong hơi thở còn khó bảo toàn. Nay hoãn đến bảy năm chẳng quá lâu lắm sao?” Bảy vua nói: “Bảy năm lâu thì sáu, năm... hoặc một năm cũng được. Chúng ta lưu lại trong tĩnh cung để cùng chung vui hưởng ngũ dục tuyệt thế. Sau đó chúng ta cùng bỏ nước, giao lại cho con em, cùng xuất gia. Há không hay hơn sao? Những gì ngươi sở đắc, chúng ta cũng đồng.’",
        "‘Đại Điển Tôn vẫn đáp: “Thế gian vô thường, mạng người mau chóng, chỉ trong hơi thở còn khó bảo toàn. Nên dầu cho một năm vẫn còn lâu; thậm chí bảy tháng, hay một tháng cũng không thể được”. Bảy vua nói tiếp: “Thôi hoãn bảy ngày”. Đại Điển Tôn đáp: “Bảy ngày không lâu, có thể hoãn được. Xin Đại vương chớ sai lời. Quá bảy ngày nếu vua không xuất gia thì tôi xuất gia một mình”.",
        "‘Rồi Đại Điển Tôn lại đến bảy cư sĩ, bảo họ: ‘Mỗi người hãy tự lo lấy công việc của mình. Tôi muốn xuất gia, tu đạo vô vi. Vì sao vậy? Ta thân nghe từ Phạm thiên, nói đến sự xú uế mà lòng rất ghét. Nếu tại gia thì không sao dứt trừ được.”",
        "‘Bảy cư sĩ đáp Đại Điển Tôn: “Lành thay, chí hướng ấy. Hãy làm những gì thích hợp. Chúng tôi cũng muốn cùng xuất gia theo. Những gì ông sở đắc, chúng tôi cũng nên đồng.”",
        "‘Đại Điển Tôn lại đến nói với bảy trăm Phạm chí:",
        "‘Các khanh, hãy siêng năng phúng tụng, tìm rộng đạo nghĩa, rồi dạy bảo lẫn nhau. Ta muốn xuất gia tu đạo vô vi. Vì sao? Ta thân nghe từ Phạm thiên nói đến xú uế mà lòng rất ghét. Nếu tại gia thì không thể dứt trừ được.”",
        "‘Bấy giờ bảy trăm Phạm chí nói với Đại Điển Tôn:",
        "‘Đại sư, chớ xuất gia. Sống gia đình thì an vui, hưởng thụ ngũ dục, có nhiều người hầu hạ, tâm không ưu khổ. Người xuất gia sống một mình ở chỗ hoang vắng; muốn gì đều không có, chẳng ham lấy được gì.”",
        "‘Đại Điển Tôn đáp: “Nếu ta cho tại gia là vui, xuất gia là khổ, hẳn ta không xuất gia. Nhưng ta đã cho tại gia là khổ, xuất gia là vui, nên ta xuất gia”.",
        "‘Các Phạm chí nói: “Đại sư xuất gia, chúng tôi cũng xuất gia. Đại sư làm gì, chúng tôi làm theo cả”.",
        "‘Đại Điển Tôn lại đến nói với các bà vợ: “Nay các ngươi được tùy nghi. Ai muốn ở thì ở. Ai muốn về thì về. Nay ta muốn xuất gia cầu đạo vô vi“. Rồi kể hết sự việc như trên, và nói rõ ý muốn xuất gia. Các phu nhân đáp: “Đại Điển Tôn nếu còn ở nhà, thì vừa là chồng cũng vừa như cha chúng tôi. Nay nếu xuất gia, chúng tôi sẽ xin đi theo. Việc gì Đại Điển Tôn làm, chúng tôi cũng sẽ làm”.",
        "‘Sau bảy ngày, Đại Điển Tôn cạo bỏ râu tóc, mặc ba pháp y, bỏ nhà mà đi. Đồng thời, bảy quốc vương, bảy cư sĩ, bảy trăm Phạm chí, bốn mươi phu nhân, cũng lần lượt xuất gia. Lần hồi lên tới tám vạn bốn ngàn người, đồng thời theo Đại Điển Tôn xuất gia. Đại Điển Tôn thường cùng đại chúng dạo qua các nước, hóa độ rộng rãi, đem lại ích lợi cho nhiều người.",
        "‘Bấy giờ Phạm vương bảo với thiên chúng: “Các ngươi chớ nghĩ Đại thần Điển Tôn lúc đó là ai đâu khác. Chính là tiền thân của đức Phật Thích-ca hiện nay vậy. Thế Tôn vào lúc ấy, sau bảy ngày, xuất gia tu đạo, dẫn các đại chúng du hành các nước, hóa độ rộng rãi, làm lợi ích cho nhiều người. Nếu có nghi lời ta nói, các ngươi hãy đến đức Thế Tôn hiện ngự tại núi Kỳ-xà-quật để hỏi. Như những gì Phật dạy, hãy gắng nhớ lấy”.",
        "Nhạc thần Ban-giá-dực bạch Phật:  “Bạch Thế Tôn! Vì duyên cớ đó nên hôm nay con đến đây. Bạch Thế Tôn, Đại Điển Tôn kia chính là Thế Tôn đó phải không? Thế Tôn qua bảy ngày thì xuất gia tu đạo; cùng với bảy quốc vuơng, cho đến tám vạn bốn nghìn người đồng thời xuất gia, cùng chúng đi du hành các nước, giáo hóa rộng rãi, làm lợi íchh cho nhiều người, phải không?”",
        "Phật đáp Ban-giá-dực:",
        "“Đại Điển Tôn lúc đó là ai khác chăng? Chớ nghĩ như vậy. Chính thân Ta đó vậy. Lúc bấy giờ, gái trai cả nước mỗi khi đi lại, cử động, có điều gì nguy khốn, họ liền cất tiếng niệm: Nam mô Đại Điển Tôn, vị Tể tướng của bảy vua. Nam mô Đại Điển Tôn, vị Tể tướng của Bảy vua. Niệm đến ba lần như vậy.",
        "“Này Ban-giá-dực! Đại Điển Tôn lúc đó tuy có oai đức lớn, nhưng không thể vì đệ tử giảng nói đạo cứu cánh, không thể khiến đệ tử được cứu cánh phạm hạnh, không thể khiến đến được chỗ cứu cánh an lạc. Pháp của Đại Điển Tôn nói ra, nếu đệ tử nào thật hành thì khi thân hoại mệnh chung chỉ được sanh lên cõi trời Phạm thiên. Người nào thật hành cạn hơn thì sanh lên cõi trời Tha hóa tự tại. Thứ nữa sanh Hóa tự tại, Đâu-suất-đà, Diệm ma, Đao-lợi, Tứ thiên vương, hoặc Sát-lị, Bà-la-môn, cư sĩ tại gia. Muốn gì cũng được vừa ý.",
        "“Này Ban-giá-dực! Đệ tử của Đại Điển Tôn đều là kẻ xuất gia không phải ngu si. Có quả báo, có giáo giới, nhưng chưa phải là đạo cứu cánh, chẳng khiến đệ tử chứng được cứu cánh phạm hạnh, chẳng đưa đệ tử đến chỗ an ổn hoàn toàn. Chỗ cao tột của đạo kia chỉ đến cõi trời Phạm thiên là cùng. Còn nay giáo pháp của ta dạy cho đệ tử có thể khiến họ chóng được đạo cứu cánh, được cứu cánh phạm hạnh, cứu cánh an ổn và cuối cùng thì vào Niết-bàn. Pháp của ta nói, nếu đệ tử nào thật hành thì xả bỏ hữu lậu mà thành vô lậu, ngay trong đời này mà tự mình chứng ngộ tâm giải thoát, tuệ giải thoát, sanh tử đã dứt, phạm hạnh đã vững, việc cần làm đã làm xong, không còn tái sinh nữa.",
        "Người nào thật hành cạn hơn thì đoạn được năm kết sử hạ giới và có thể nhập Niết-bàn tại thiên giới, chứ không trở lại cõi này. Thứ nữa thì đoạn ba kiết sử, dâm, nộ, si mỏng, chỉ phải một lần sanh vào cõi này nữa là sẽ nhập Niết-bàn. Và thứ nữa thì đoạn được ba kiết sử, chứng quả Tu-đà-hoàn, không còn bị đọa vào ác đạo, nhiều lắm là bảy lần sanh đến cõi này nữa là chắc chắn được Niết-bàn.",
        "“Này Ban-giá-dực! Các đệ tử Ta xuất gia không phải ngu si, có quả báo, có giáo giới, được cứu kính đạo pháp, cứu kính phạm hạnh, cứu kính an ổn và cuối cùng vào Niết-bàn.”",
        "Ban-giá-dực nghe Phật dạy xong, hoan hỷ phụng hành."
    ]
}